"@KrysDuh16 Make his ass eat Chick-fil-A"
"RT @_brendon4real: Say it louder for the ppl inside Pizza Hut they aint here you from inside 🗣🗣🗣 https://t.co/6N66SnLwih"
"RT @weathershan: “I wouldn’t call myself a connoisseur of chicken strips but....” https://t.co/iRWAYJtzCH"
"RT @dril: i love \"Going hollywood\" by retweeting burger king and lock heed martin 1000 times"
"RT @MrAlfredGarnett: Turns out Fat Donna from the estate agents has an incurable disease.\nMust mention that to her next time I see her s… "
"How to get your boss to like you: “I got you a bunch of Taco Bell gift cards”"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"Here’s the real reason why Chick-fil-A is closed on Sundays https://t.co/ePMgsRVPk5 https://t.co/m9oHvnPH87"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"RT @sexorpizza: Haven’t ordered Pizza Hut in a while I wonder if they’re worried about me"
"Randomly having the worst jack in the box craving 😫🍔🍟🥞🌮"
"Boo. The Forever 21 x Taco Bell collection is sold out."
"RT @artrbl: jay said \"let's get it\" at the end of his subway ad who wants to call the police https://t.co/nnpLw4azkN"
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"RT @BigBeard_Ali: Dove &amp; Chick-Fil-a just gone have to call me a nigger to my face 🤷🏽‍♂️"
"Just posted a photo @ Starbucks Middle East https://t.co/1zwsbFUQBI"
"RT @TypicalGlRL: when a mcdonalds employee slides in an extra nugget https://t.co/8vkZcLxLps"
"RT @Arbys: We have the Venison. 10-21-2017 https://t.co/sD4rZBOJRb"
"RT @2fingasss: Whataburger https://t.co/YMzXF4Fr8k"
"NYC rapper Princess Nokia takes credit for throwing hot soup at subway rider shouting racial slurs https://t.co/2qxHglXDYU via @ashleydaysc"
"Subway stations could soon allow you to walk through without needing to tap your card https://t.co/hTamaKsQqY https://t.co/9cESkojc3k &lt; w…"
"Hardee's Hawaiian Chicken Sandwich https://t.co/zO9qT3SRxu"
"McDonald's Free App Download https://t.co/Qy0roUAKXB"
"RT @DavidPapp: Subway stations could soon allow you to walk through without needing to tap your card https://t.co/icmb5EJsrk"
"RT @nycmia: Police hunting for serial subway masturbator https://t.co/50HXDjcM5R RICH TAKE UBER,THE WELFARE R HOME &amp;THE MAYOR TAKES CHOPPER…"
"RT @nihilist_arbys: Sure, shit's bleak, but remember: we're all gonna be so fucking dead soon. None of this matters.\nEat arbys"
"RT @Bindu_Offl: Having some fun #starbucks https://t.co/RmZU1sEU5S"
"I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote?\nhttps://t.co/goAECYvK4Q"
"RT @THELILMOSHOW: Just always have your next move planned. PLAY chess NOT checkers. Keep sumn tucked, just in case you fall and nobody ther…"
"RT @365DaysofBaking: #ad Celebrate National #CheeseCurdDay by visiting @culvers with a friend and you could get some Cheese Curds FREE!… "
"Is this really how you run your business, @Starbucks ? Inventory piled up during business hours. Not a good look."
"One day away from Pink Dunkin Donuts. See you at Century Automotive Fri the 13th. 6a-10a.  Can wait! https://t.co/IMBKonku2o"
"I'm just saying, you can become my best friend by giving me a large iced mocha coffee with extra syrup from #McDonalds #mccafe"
"Ordered a grande PSL and the barista made me a venti... @Starbucks knew this 12hr shift is about to be a struggle."
"The Venison sandwich will be available nationwide at @Arbys  on the 21st. &gt;&gt; https://t.co/WWYWa89YBD\n\nWill you try… https://t.co/aXF3uxECCu"
"I never posted this yesterday but my lunch date wanted Subway when… https://t.co/O0wMiWrcsM"
"RT @transgirlsonic: you guys have no schezwan sauce? no- i want schezwan sauce! \nwhere's! my! schezwan! sauce! im PICKLE RICKKKKK, WUBB… "
"krystal's birthday party at smtown theatre 4F at 8:30PM KST. oct 24, 2017  https://t.co/0CHrgopzjH"
"Taco bell just released a fashion line, and it’s kind of amazing https://t.co/CxWOe16Z3r"
"I’ve been at Burger King for 3 hours. It’s only 7"
"Do you why there was a starbucks cup in tumblr?s logo?... https://t.co/lE2bgo5Idg #Journalism ?"
"subway never got back to me the pricks"
"RT @MaxTemkin: Apparently McDonald's brought back the Szechuan Sauce? But not enough? And at some locations people rioted? And the… "
"RT @rdewalt: McDonalds sends every store 20 packets of \"Rick and Morty\" sauce.  Fans waited all night in line find out, immediately Ebay th…"
"RT @Chauncey_Boy: Here at the San Jose Mcdonalds. This is our reaction to the shortage of #szechuansauce #giveusthesauce #rickandmorty http…"
"RT @SupladongBolpen: Eye to eye?\n\nKFC  Glorietta. 😊\n\n#ALDUB117thWeeksary https://t.co/x08FSfslVO"
"RT @foodevolutionph: Leo Martinez schools millennials on how to enjoy KFC teriyaki shots in different ways\nhttps://t.co/2d5MujllVX"
"@ColeLedford11 @BurgerKing @Wendys @djwazzle dude, you weren't joking. BK shady as hell."
"RT @BlvkKing: And even still.... https://t.co/rFEvBXehbj"
"RT @ogkarteo: Chipotle's got nothing on Moes"
"@Whataburger The correct name for the eastern regional burger is the Green Chile Double \n\nRoll that out nationwide just once plsssss"
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"RT @Hardees: If a burger needs anything but meat and fire, it's not our kind of burger. https://t.co/rPabUrJ1TT"
"TACO BELL #29135 2300 BESSEMER SUPER HWY BIRMINGHAM 35208 scored 84 on 2017-10-10 https://t.co/60srAbQNJr"
"RT @Whataburger: I don’t need a curve on a test. I need Whataburger."
"RT @DrDenaGrayson: Trump plays checkers, while those around him play 3-D chess🔥\n\nInvestigative leads ARE being pursued. Good things ARE hap…"
"RT @Estadao: Quinze Ronalds McDonalds invadem lanchonete do Burger King https://t.co/SfUZtYCLMF https://t.co/QU7MHSwYNK"
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"Javon misses bus = perfect Starbucks opportunity 👌🏻"
"RT @myjoe_: Starbucks promo utk students. Buy one FREE one till 15 Nov. \n\nTunjuk students ID je. #PromoJoeMY https://t.co/VCcTh2HJEa"
"RT @mkapaydin: McDonald’s, Starbucks, Burger King ve FG\n\n https://t.co/t0uHQl6fsf"
"last night consisted of my screen cracking, getting a ticket, and MCDONALDS WAS CLOSED!! lol why?????????"
"I'm at Starbucks in Athens, AL https://t.co/qeAZu9YgsG"
"@RussPayton a little Thursday motivation https://t.co/FLrLPUtgg0"
"RT @RedNationRising: Democracy Alliance was created in 2005 by a handful of major donors, including billionaire financier George Soros a… "
