"I've got #Oklahoma to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/DN2YVTV6Ny"
"RT @holaaitsisa: I dreamt that I met Zach efron in el pollo loco and we saved a chihuahua from cardiac arrest"
"RT @Arbys: Sit boy! https://t.co/rwUIkYZ9bF"
"I'm putting in my two weeks at Taco Bell today lol"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"RT @eatVegan_co: Vegan enchiladas with sweet potato and smoky chipotle sauce? Yes please! 😍https://t.co/aUKORdFB7c"
"RT @AllyBrooke: Hahahhahaa. Omg. This photo is so old!! Major throwbaaaack 2014 I think? This caption is everything 😂😂😂 https://t.co/MADVqg…"
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"RT @RichieIsEvol: @Wendys are spicy nuggets back yet?"
"@Kimutiger I never tried it and don't care, Mcdonalds is cancer for people"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"RT @SantanaASB: Chipotle fundraiser tonight from 5-9 pm. 50% of the proceeds come back to our school. Please come support Santana’s ASB 💜💛"
"So wait... @Wendys what's your guys' reasoning for getting rid of spicy nuggets..? When they're the greatest thing since sliced bread..."
"Agreed https://t.co/u1pvsPDP9g"
"MFW this sub stops being about Mcdonalds and Israel/Palestine https://t.co/qR00FYyoT8"
"RT @ps4andchill: bae: why tf pizza hut keep texting you \nme: https://t.co/7upSqUqkl1"
"RT @HoodJesusYo: Live by the 5 C’s and you’ll be alright:\n\n1. Christ \n2. Coffee \n3. Chick-Fil-A \n4. Chipotle \n5. Canes"
"My fucken America , my fucken people . Y’all need to stand up against these racists and if u see something speak up. https://t.co/HIqpkIjSVs"
"Can't beleive I'm saying this, but, @Wendys salads are actually amazing! Spring mix, quinoa, onions and chicken were all so fresh! 👍🏽👍🏽"
"RT @TeamRWB: Watch and Share @TeamRWB's submission to the @Starbucks Upstanders Challenge to help us win a $25k grant!… "
"actually had one of these not bad lol 👌🏼 https://t.co/C5xSn5AFph"
"RT @nihilist_arbys: It's Columbus Day, so we're gonna sail over to McDonald's, beat the shit out of everyone, wreck the place &amp; call it arb…"
"Chick-fil-A or Pieology sounds fire"
"RT @jayqyt: unbalanced placement of ingredients in chipotle burrito &lt;&lt;&lt;&lt; wearing red to target so everybody thinks ur an employee"
"RT @RedbirdMenace: Rick and Morty fans are behind the times; Bojack Horseman fans have been lining up at McDonalds to get depression for ye…"
"I also only missed 1 question on my Geography test, got a $.50 refill on my starbucks, and I'm getting tacos for dinner tonight! 😁"
"RT @GiffardCDI: So good!!\n#foodporn #food #shrimp #chipotle #tuna #chihuahua en Julianas https://t.co/dKAsKsn70a"
"RT @lisacrost: I just found this beauty at a U-Bahn station in Berlin: A subway map that shows the amount of passengers with line… "
"RT @kelseyuhlich: me walkin into work every morning 10 minutes late with a Starbucks like wuddup get the fuck out my face good morning peop…"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"Brooklyn Subway Passenger Ejected From Train By Fellow Straphangers After Shouting Racial Slurs https://t.co/4JIoZeMMv1"
"So I'm walking and I past a guy who is talking on the phone. This guy sounds exactly like the guy in the Jack in the Box commercials."
"RT @endlessgoth: enjoying a lukewarm starbucks beverage on this fine afternoon in late capitalism"
"Just adding an extra 2 cents and also since Destiny 2 will be digitally published by blizzard and not Dairy effing Queen so yeah."
"Want to work at Starbucks? We're #hiring in #FairOaks, CA! Click for details: https://t.co/VybxYZ8QSx #CustomerService #Job #Jobs"
"It's been too long since I last had @SUBWAY so took the family for lunch"
"@holgermu What? no caffeinne? SHOCKING and sadness #wdayrising https://t.co/Zc9pRFDIJ3"
"Just came to Starbucks for them to tell me they have no pumpkin syrup today ???????¿¿¿¿¿ HOW"
"Tell me why a dumbass came in the drive thru @ Starbucks the wrong way &amp; almost crashed into the other dumbasses that came in the right way😩"
"@CHOW @McDonalds Losers."
"The Phantom Turd of the Burger King Bathroom #FastFoodBroadway"
"Man yelling racial slurs on subway in New York was forced off train by passengers who didnt tolerate his… https://t.co/5wsrn33RKz"
"Hey @starbucks - your Packwood Creek shopping center location in Visalia keeps getting slower. Watching people leave from waiting 2 long."
"Join the Starbucks team! See our latest #job opening here: https://t.co/qYnDANakC7 #CustomerService #SantaAna, CA #Hiring #CareerArc"
"The Szechuan sauce fiasco proves Rick and Morty fans don’t understand Rick and Morty https://t.co/qr56ky3wB5"
"RT @mrfeelswildride: apparently the mcdonalds stabbing was not sauce related it was just a normal LA mcdonalds stabbing"
"@starbuckshelp With the online Starbucks store now closed, any advice on where to purchase Torrefazione Italia Coffee now?"
"RT @KlausBromi: Nerds getting rewarded for becoming dumb, angry mobs has been a terrible trend over the last few years. https://t.co/03h8RQ…"
"@CarlsJr @amazon I love @Wendys"
"@McDonalds @danharmon @JustinRoiland GM OF LA location gave me a number that doesn't even lead to mcdonalds. This is OUTRAGEOUS!!!!"
"RT @RiiCH_iN_Spirit: Threw him overboard 😭 https://t.co/rQsl6bueNt"
"@ufc @dc_mma @joerogan @Jon_Anik And then Hendricks said \"You can still have Whataburger, just dont have the fries!\""
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"RT @IsaacGallardo12: im tryna go\nhiking\ncamping\nbowling\nto the beach\nsix flags\nmcdonalds\nto SF\nget spooky\nget schwifty\nand eat some tamales…"
"But then we would have to go to BK. https://t.co/O4hAjMk1G2"
"RT @jimpjorps: at Taco Bell; woman ahead of me is trying to order a “chocobo supreme” and will not work with the cashier to figure out what…"
"@Henrri_Chris @McDonalds Go to The Habbit instead."
"In serious need of a pumpkin scone from Starbucks everytime I ask than ran out 😭🎃"
"Inspire and Nurture. #starbucks #tobeapartner #siren #inktober2017 https://t.co/i3AuUP4pik"
"God I want a hot box of Pizza Hut"
"Dude in office: I'm cutting down on my portions. I only ate half my Panda Express last night.\n\n*thats not portion control, that's wasteful*"
"RT @ebokillem: Why does this sound smack right now https://t.co/XFZ2DJ3zY5"
"@Wendys baconator or spicy chicken sandwich?"
"RT @joanneofarclol: We tried to order a cheese only pizza at the Pizza Hut in China and they came back with this... https://t.co/sEflnqCGvn"
"RT @keithcalder: I apologize for any offense caused by my insensitive joke video where I dipped an SNES Classic in a cup of McDonalds Mulan…"
"RT @elonjames: See, that's nice and all but what jumped out at me was the homeless guy who's been homeless for years. https://t.co/iZPmiwrt…"
"Every single person in this Panda Express is eating alone"
"RT @_LordV_: Lmao I laugh when people hate on @Starbucks like they were into coffee before they came around. Muggle you were drinking folge…"
"@MolliPayne I’m not a BK lover....@Wendys has my heart but I may have to try them 😬"
"RT @Chauncey_Boy: Here at the San Jose Mcdonalds. This is our reaction to the shortage of #szechuansauce #giveusthesauce #rickandmorty http…"
"RT @savannah_landau: One of the most dangerous things in this world is a cis het yt man who didn't become rich and famous like his peers. h…"
"@ChrisssAceves_ Bring me some chipotle to work. Thanks.  Lol"
"RT @_jose1315: Do you think Panda Express is good?"
"RT @ni_alln: the lady with the soup, i salute you https://t.co/MkjOKagUSS"
"I’m so fat dude I hella want Taco Bell but I’m also trying to lose weight 😂😂"
"#Twittercontest Where did the first Chick-fil-A open in 1976? Reply below to enter the chance to win a free meal !😀😀😀"
"Taste like normal ass chicken sandwiches https://t.co/tXcY407NPn"
"A strawberry shake from chick-fil-a sounds bomb"
"Deep Subway discounting. No traffic or even profitable traffic. This market SSS minus 10 last week. https://t.co/M4cdv97eDb"
"But the Burger King is closed 🤔 they want us to die"
"McDonalds Toys and Cards Coming to Happy Meals Again! / Read about it @ https://t.co/hyv9IWN67Y: https://t.co/vjHqgD0mlO"
"Got this 911 dispatch app and have now deduced that 80% of San Francisco crime happens in a McDonalds."
"Babe brought me Taco Bell to work and I didn't even know he was going to do that 🙌🏼🙌🏼😍"
"RT @GameSack: Also not as good as Whataburger. https://t.co/u2MPJySvFw"
"i want a starbucks omg ive never craved one so bad"
"RT @MatthewNussbaum: Fact checkers know it's false. Tax experts know it's false. WH aides know it's false. Trump keeps saying it anyway: ht…"
"RT @sidenotesCA: be like Krystal, stream it here.\n\nhttps://t.co/TJmbFlVl4o https://t.co/xt5LjZ0JtS"
"scratch that, i neeed a starbucks"
"Taco Bell doesn’t put bacon in the loaded potato griller anymore. AND they changed the name."
"@TMobile @funcostumes Pumpkin pie &amp; a pumpkin spice Frapp from @Starbucks :) #TMobileTuesdays #Contest"
"It’s very rare when Starbucks messes up my order, but when they do I can’t stand them 😡😡😡😤😤😤 like bro, y’all were not busy"
"RT @samfbiddle: The replies to this tweet are definitely among the most deranged things I’ve ever seen on the internet https://t.co/tdc9HTq…"
"RT @MrCreeperGamer6: Imagine being a fast food employee with low pay and no job stability and having these horrible STEM dweebs come in… "
"RT @ecampo12: @eclecticbrotha Krystal about a year ago:\n\nhttps://t.co/cPj2Aoh9kR"
"If someone hasn't got the McDonalds app yet just download it and register using this friend-code pls ty: NRG9B https://t.co/MFGWQHJm0k"
"Has anybody worked at Starbucks and if so how was your experience? I am looking for a job but idk if I should apply there for my first job"
"RT @AustinsOwnBBQ: Take your meat to the next level with Austin’s Own Chipotle BBQ Sauce. 🔥 😋👍 https://t.co/PY1Zn0tWC2"
"yu tryna have the shitters https://t.co/ELO2RePmlT"
"Yo! Green tea latte made with coconut milk from Starbucks. #orgasmic 🍵"
"Hey @Wendys can you guys start adding brownie chunks or @Oreo chunks to your #frosty? That would be delish! #pleaseandthankyou"
"RT @Molliwhoppedd: Chick-Fil-A or In N Out is the hardest decision"
"if you are feeling adventurous, try the pumpkin spice caramel macchiato @Starbucks"
"@officialdabney its not so bad if you use starbucks discount coupons https://t.co/71AWMIgbnt"
"So I went to Jack In The Box. I'm getting food cause I haven't ate. I'm bout to print all these shirts. I still haven't packed, So..."
"RT @kfc: “Would you like to be playable in the WWE 2K18 video game?” they said. “As long as my physique is 100% accurate,” s… "
"by the marvelous Alli Smith @anallievent\n#TalkingAbout Krispy Kreme Bread Pudding with Carmel Pecan Sauce!… https://t.co/Vj9HYjwUh6"
"RT @burnie: My new favorite thing is all the people furious about the McDonalds Szechuan sauce promotion."
"So glad to be back and making some #bigmacs again.\n\n#IDontActuallyEat #McDonalds \n#EatHealthy… https://t.co/0lX6M0Vrfz"
"if you shoot me the addy for the afterparty i'll bring del taco @CHAPOTRAPHOUSE"
"RT @JustineWaldman: .@McDonalds on Hopper Ave in #SantaRosa @kron4news https://t.co/D13HsAM8Dg"
"The best part of Pizza Hut pizza is the crust"
"WE LOVE JUSTICE https://t.co/dBRggmOD7L"
"@CrReaM For a second I thought the mic was in the Dunkin' Donuts"
"Subway surf how far can u get with out getting caught https://t.co/QZKjBOXsfn via @YouTube"
"Did you know @Starbucks has opened 2 stores EVERY DAY since 1987! #Coffee https://t.co/4U9K4vIzIv"
"@mrsjoxertm Just get those Starbucks brownies 😭they are amazing!!"
"I thought that said Starbucks is so good kdjskd I was confused on how this correlates https://t.co/5BlFrAo1kX"
"Not sure why Chipotle just sent me an email with an interview time for a job...but free burritos sound nice"
"Trying Arbys for the first time"
"Relatable https://t.co/pYVlVSFJi6"
"RT @Exploditorium: MCDONALDS STUNTS RATING:\nFunny, in good spirit: McFlip\nOminous, powerful: Let's McFrickin LOSE it\nSad, embarrassing: \"I'…"
"@Meggox_ Me when I see my daughter has spent all of her money @Chipotle https://t.co/T7OwDLDhel"
"I was going to try to make it to class on time today, but Starbucks is playing my favorite 80s bangers right now."
"RT @dril: i love \"Going hollywood\" by retweeting burger king and lock heed martin 1000 times"
"RT @thedafff: Fact: No one is immune to Taco Bell induced fiery butthole."
"Sometimes when I'm bored I go on Venmo world and just like random transactions. You bought your roommate Burger King fuck ya here's a like"
"Almost died choking on my last @McDonalds nugget 😵 couldn’t even enjoy the last bite 😫"
"RT @JulienSolomita: when your dad supports you 😍 https://t.co/YCONRR9yXy"
"@kayyivette Uhhh I’ll buy you Starbucks and food 😂"
"They couldn't put in Liv Morgan but could this. SMH. https://t.co/GzfZJ0L0CC"
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"RT @ssentience: RT to win a $10 Starbucks gift card ☕️\n• must be following me and @glowradiant 💫 https://t.co/uQnvo3fiBv"
"@Moonsongstory I was at the Mcdonalds where someone smashed a packet of Szechuan sauce and people ate it off the ground"
"RT @hollymadison: If I don’t get a Taco Bell Fire Sauce bodysuit from Forever 21 have I even lived?"
"How Warren Buffett uses @McDonalds to gamify his #success. https://t.co/8SrHBL7gpK"
"RT @anallievent: Got leftover doughnuts? Make Krispy Kreme Bread Pudding with Carmel Pecan Sauce! Yum!  https://t.co/9aeTv4S1xp… "
"I'm at Chipotle Mexican Grill in West Hollywood, CA https://t.co/UbMBdkL3Pq"
"RT @dsmith124: @McDonalds  talking to my buddy about old school Szechuan sauce from Mulan and MC Kids for original NES... come back..."
"RT @3onyourside: Subway riders shove man shouting racial slurs off New York City train https://t.co/arlZmCpZWq"
"@Pheramuse @HashtagRoundup @TheHashtagGame #FastFoodBroadway\n\nFoot-Long Subway Man\nof La Mancha.\n\nhttps://t.co/QLtS1HnFJU"
"RT @MikeAdamOnAir: when u get a 10 piece nugget at mcdonalds and they only give u one sauce https://t.co/1f3wAuafni"
"RT @David_Acer: Not judging the caliber of tutoring happening beside me in this Starbucks but I did just hear the tutor say \"Triangles come…"
"RT @American1765: @snowconejustice @Bose @budweiserusa @Barclays @Bridgestone @Campbells @Castrol @COVERGIRL @DairyMgmtInc @Dannon… "
"RT @nytimestravel: Want to see the differences between New York and Shanghai? Look at their subway systems https://t.co/TaPkl556io"
"RT @PetitGourmetSD: Chipotle Honey Lime Chicken @keviniscookin https://t.co/NvOP6jyyz2) https://t.co/KsH65EGjKp"
"RT @PhilipMeowlowe: \"on knees\" O MIGHTY GOD OF SATURATED FAT WHO RESIDES AT KFC, ATTACK HIS HEART NOW!!!! https://t.co/PqNt1kGoHH"
"RT @EM0HOMO: love this song https://t.co/D1nzUaT2Pb"
"Air is better today. Still hot though. #work #fuel (@ Starbucks in Anaheim, Calif) https://t.co/hRKc4z2Cw8"
"Tried the new Chipotle queso. It’s ok, but has a slightly weird texture to it. Not sure about that."
"I failed to stay at the Starbucks, but I tried, and that's a victory #agoraphobia #PanicAttack #anxiety"
"@ikusabai Get Starbucks more often then, I wanna see ur face more often"
"Was going to order a pizza for lunch until I looked over and saw this...why sit on a counter like this when you wor… https://t.co/QruRwNZcFe"
"I would’ve snaked him for fun from the side https://t.co/kcpBcTovQu"
"RT @CheyyMaster: Can't find out because @Chipotle isn't open \"late night\" or for Breakfast... https://t.co/osAB26CvWN"
"RT @robyndwoskin: The Burger King and I #FastFoodBroadway"
"Congrats, Jackie Gray!  Winner of a @Starbucks gift card in the #LearnStorm drawing! @khanacademy @RUSDLink @RUSD_ILE Next drawing is Friday"
"North Napa Target-Starbucks celebrating return of power by giving out free coffee (no cream tho, went bad) https://t.co/2L5l4CuCSA"
"RT @McDonalds: You spoke. We’ve listened. Lots more #SzechuanSauce and locations. Details soon. And that’s the wayyy the news goes! https:/…"
"I hate myself for getting addicted to Starbucks"
"We did it @ In-N-Out Burger https://t.co/leXqSKlbhY"
"Something Rotten! at Taco Bell #FastFoodBroadway"
"Such a 1st world prblm.. but if Starbucks doesn’t have an item I ordered on the app, they should let you know before you get to the store"
"@BetuelRosas It’s not that good lol just go to kfc it’s the same thing... although their bread is pretty good"
"2004 Viacom/Burger King SpongeBob Squarepant’s Patrick  Wrist Watch with case  on eBay: https://t.co/qAjSoMrpV6… https://t.co/8qMAfmgqVq"
"Otherwise it defeats the entire purpose of mobile ordering @Starbucks Also while I’m at it, need more veggie sandwich options"
"RT @ADKeierleber: Stopped at @McDonalds this morning and @GrantGrizzlies are still going strong! #Colton #community https://t.co/LhfAKquuqC"
"RT @HXRLEEN: her: why pizza hut texting you to come over at 2am????? \n\nhim: ........\n\nher: unlock your iPhone X now \n\nhim: https://t.co/WxP…"
"Professional #Fact Checkers Investigate ‘Laterally’ https://t.co/hhMmjsfAAp #FakeNews"
"@neonorchid1 Don't associate taco bell with Mexican food. A midget luche libre will appear and bust your knee caps"
"COME RAP WITH DEE DEE KING AT BURGER RECORDS FULLERTON https://t.co/lW1YVUWQAv"
"If I'm already late then Ima be late late #starbucks"
"RT @smosh: #Value🍟🍔\nEVERY MCDONALDS EVER: https://t.co/TnMOgyNiI5"
"best bowl of soup ever. https://t.co/oMJ4yeqxX7"
"HA Burger King promoted this tweet 😂😂😭 https://t.co/K1ffIsM6Fk"
"Making myself study at Starbucks today because I'm at the point where I'm gonna fall asleep if I touch my bed🙃😂"
"RT @jonnysun: seeing rick and morty fans yell about pickle rick then seeing rick and morty fans yell at a mcdonalds https://t.co/qgEWF8PHMO"
"@katlatu25 He’s so annoying! N he wasn’t even trynna look at him til I hit em w the time n the which Taco Bell it was 😂😂😂😂😂😂"
"PSA: Microwaved Taco Bell is not great."
"RT @ChrisArchieRS: Planning for upcoming Brits Try American Fast Food video. Thoughts?\n\n- Chick-fil-A\n- Buffalo Wild Wings\n- In-N-Out\n- Sha…"
"RT @masehealy: PSA: Microwaved Taco Bell is not great."
"Grandma's taking back sunday lol. https://t.co/HlAN6Z8xRY"
"@robyndwoskin #FastFoodBroadway\n\nJesus Christ Famous Star.https://t.co/DqU73aVXLX"
"RT @BenAffleck: Inspiring visit to #DRC. Met with hardworking coffee farmers supported by @easterncongo &amp; partner, @starbucks. https://t.co…"
"I checked in at Starbucks on #Yelp https://t.co/5twMynEpBd"
"*Logs into LinkedIn and sees a guy who I graduated college with is working at Taco Bell* https://t.co/cc2cBTU9bS"
"@catmancatman864 You could’ve taken a prep class but 3 nights at the library and some jimmy johns was enough for you"
"@Itreyu i miss sun chips. BRB GOING TO SUBWAY"
"Does anyone else get a small static shock from their first sip of a Starbucks straw!? It happens to me EVERY time"
"@Whataburger is a necessity rn"
"Omg. I had a heavy lunch and now I’m dying at work. I’m super sleepy. Can @Starbucks deliver ? Partner up with @UberEATS"
"Why is Burger King promoting a tweet towards @Wendys ? https://t.co/EuiWd6VtiN"
"RT @alxaesa: TEXAS has Khalid\nTEXAS has Beyoncé\nTEXAS has Blue Bonnets\nTEXAS has Pluckers\nTEXAS has Selena Gomez\nTEXAS has Daisy… "
"RT @electruhMark: When the Starbucks employee writes your name wrong https://t.co/GXYCKDR5Lf"
"Omg this lady just said she's \"running to KFC\" after she gets out the ER"
"WHY IS THIS SO FUNNY WHY IS BURGER KING SO PETTY https://t.co/uJar89OAtB"
"#TCOT #TLOT #MAGA #CTOT #OCRA #LNYHBT #KAG #BuildTheWall #CCOT Shrimp with Chipotle-Bourbon Butter https://t.co/6p5hi0Ul1D"
"Ugh I envy you! I’ve been craving this all week https://t.co/uNaT7xAsBl"
"RT @Braveheart_USA: Government owned aircraft use is being scrutinized, so @NancyPelosi flights will all be reviewed? \n@realDonaldTrump… "
"My mom just told me she wanted Chipotle and I jokingly replied back \"You got Chipotle money?\" She went tf off 😂😂 oops."
"RT @Mc_Baca: They need to build a chick-fil-a in GT"
"@averycleantramp I saw a video rn of a grown man jumping up and down on the counter at a mcdonalds demanding sezuch… https://t.co/3etDgLNR2M"
"Every time I go and get my meds I buy a scratcher and won $10 and use that to get Taco Bell. No joke, 4th time in a row now 😂"
"how do i get a chipotle bogo coupon.   someone help"
"@BigMikeyMo @Wendys instead of doing achieve3000 everyday"
"RT @thewritingj: @ColeLedford11 @BurgerKing @Wendys PROMOTED BY BURGER KING. I AM DYING. https://t.co/4bBI0nFvpY"
"Good on McDonalds for bringing back honey and honey mustard"
"Homeless Man Sobs In Burger King But Doesn't Know His Photo Is On Facebook https://t.co/oQIyy5QEro"
"RT @TheTrojanHoopz: Please show your support of our Trojan 🏀 program by stopping @ Chipotle on Stockdale Hwy this Sat between 5-9 https://t…"
"Starbucks should have student discounts"
"@arthur_affect @SuperSpacedad @tedlieu We could make Trump’s IQ test based on reading KFC &amp; McDonald’s menus and he… https://t.co/0XWTStO4Ra"
"RT @wtfisaiah: me at McDonalds when my card declines after trying to buy a mcchicken https://t.co/h4V732x0RE"
"I love logging into https://t.co/kzRwq58VT1 and seeing racist people get what they deserve lol pure entertainment https://t.co/B02VDNQOar"
"The guy jumping on the counter at McDonalds is completely staged. Dude films it at perfect angel, nobody in the way, plus its... too perfect"
"She knows... 🎃👌 https://t.co/dVXiAkXP4k"
"RT @jacemarceau: god i love Brooklyn https://t.co/8nIbpLR8uX"
"Makes sense that @McDonalds would only have 20 Szechuan sauce to be sold, still getting 1 sauce for my damn 20 piece."
"@ChickfilA I NEED A CHICK-FIL-A IN CAMARILLO PLZ &amp; THX"
"RT @TheWhaleFacts: While a whales diet mainly consists of small schools of fish and other crustaceans, they occasionally enjoy some Taco Be…"
"What's that facts! https://t.co/WKLV7yE6eH"
"RT @QuintonDoswell2: Del taco is better than Taco Bell. Del taco is better than Taco Bell. Del taco is better than Taco Bell. Del taco is b…"
"@TheCrimsonEgg @maniadrone @mattlieberman Nah buying it from other companies or making it yourself is got dumb dumb… https://t.co/CRKDgabxvh"
"lrt as a mcdonalds worker i approve"
"Dove and Chick-fil-A going just have to call me a nigger to my face 🤷🏽‍♀️🤷🏽‍♀️"
"RT @getfiscal: “Szechuan-McDonalds Riots of 2017” is one of the most Shadowrun backstory phrases I’ve encountered."
"RT @KANTBOT10K: FURTHERMORE I AM SUING MCDONALDS AND CHINA TO OFFICIALLY CHANGE THE NAME TO HARMON SAUCE https://t.co/pmIlAZvX2H"
"Tru life I'm addicted to Chick-Fil-A"
"RT @BRANDONWARDELL: nerds are bullies now https://t.co/2anztoaD4g"
"#FastFoodBroadway west side burger King"
"RT @K1NGR1ZZY: @BurgerKing Girlfriend: I wonder if he’s thinking what I’m thinking. \n\nBoyfriend: I still can’t believe @Wendys doe… "
"RT @cevancoore: Food taste better when the chef angry https://t.co/QT5XOlVcFl"
"RT @ArbelaTech: Going to #AXUGSummit? Tell us your most challenging Dynamics or BI issue, and get a free $50 Starbucks card:… "
"I want coffee bean or Starbucks super bad \nYou crave everything when you can’t afford it 😂😩"
"@Harlan @AngeloRayGomez @realDonaldTrump @NFL = Checkers @POTUS = 4D Chess"
"How long until you have #SzechuanSauce? https://t.co/iK9H4PBkpK"
"This huge black dude just served me the fattest chipotle bowl of all time"
"RT @ALT987fm: Homeless Man Sobs In Burger King But Doesn't Know His Photo Is On Facebook https://t.co/oQIyy5QEro"
"i loved it when she threw her soup at him, so satisfying https://t.co/j7nXAJLMK7"
"RT @PvTruest: Must be a queen for me to even talk to you in the first place cuz im eating hibachi and some yall deserve taco bell"
"Newsflash. If you yell n***** long enough, someone wl beat u up https://t.co/1EF82FbeAl"
"Subway Surfers, Hack &amp; Cheat #SubwaySurfers #agenda2018 Matt Canavan #pokemongobot https://t.co/EZKduaqgGf ♥ ♥"
"@HillaryWarnedUs Who cares about women? It’s all identity politics! Let’s raise the Starbucks barista wage to $39 a… https://t.co/Djh8TFUPDo"
"RT @Reviewtz: .McDonalds, chobani and facebook on social food cues (and Szechuan Sauce) #foodporn https://t.co/RXmNOQlBhB https://t.co/AzCQ…"
"What..... https://t.co/5nm69QozFI"
"i want panda express"
"@iam_juhi with no time for adjustment so it can immediately emotionally fragment Our Hindus. Sis is correct as a \"B… https://t.co/gfI2Oe5vlF"
"mayb fast food really is poison i felt sick bc i hadn't eaten then i had a 1300calorie taco bell meal and i feel the same if not a bit worse"
"RT @KeystonedLight: gilbert arenas went from self anointed american hero yesterday to a #3 on the long john silvers value menu https://t.co…"
"@IvanTheK Another McDonalds out of Schezwan sauce?"
"I swear to God @kfc has to have the worst customer service ever. I don't know why I even go back 🤦🏽‍♀️"
"@caitlindewey This is still the same line McDonalds uses now, yes? I remember them having to say it over and over w… https://t.co/vGnrLAOwpi"
"@Wendys Where should I eat for lunch tomorrow?\nRetweet for @Wendys Like for @ChipotleTweets"
"@maddithematador Taco Bell got some shit del Taco undefeated tho"
"RT @_yeeezzy: If you eat tacos from jack in the box you don't love yourself"
"RT @Karceno: Incident At Starbucks In Chicago: https://t.co/oz5DD7F6xa via @YouTube"
"RT @TonyFergusonXT: Chess Not Checkers #SnapJitsu™"
"@Wendys, can you please teach your employees how to use adjectives? They couldn't describe your S'Awesome sauce. 😂😂"
"$100,000 isn’t a lot of money not everyone works at Taco Bell"
"RT @DobreMarcus: Are you from starbucks because i like you a latte 😂"
"today marks one year with @Starbucks 💚☕️"
"And let me guess, I'm still only going to get 1 for my 20 piece nugget. 😒 https://t.co/rnpZ89909j"
"The only mexicans that some of these Americans want are the ones that keep produce cheap and Making the fake ass Chipotle burritos"
"@kaitlynborja If I beat you again at pool, buy me Starbucks"
"@tresoulfly @DrPhil They both flame but I'm fucking  wit del Taco more burritos untouchable"
"RT @MayorOfLA: Check out amazing photographs of the @MetroConnector subway project &amp; hear from the photographer who captured them.… "
"Double chicken burrito from Chipotle is the shit!\nBut damn does it cost."
"RT @thosjleeper: We are in a stupider timeline than the fictional tv one that is defined by its pointlessness and nihilism. https://t.co/6T…"
"RT @jckseavey: um yes we hanged out with jack for an hour in starbucks. it was his idea. be happy for us."
"Welcome to @twitter where the average person doesn't have $1000 saved, but 100k isn't a lot of money https://t.co/HRMYLYf4dc"
"FUck! I just left subway without grabbing my chips yo 😩 this the worst"
"Grand Central-42nd Street (New York City Subway) to 60 Hudson Street by Line 4 subway, Line 7 subway, Line 2 sub... https://t.co/lyKmrGhSlV"
"@JustKevyKev_ @DrPhil @HaHaDavis this man is a muthafuckN DUMMY! 😭😭😭😭 Even del taco wet burrito dry den the Mojave desert 😭"
"Nothing worse than watching new hires @ chipotle disrespecting your burrito or bowls proportions...and then TASTING… https://t.co/sVWbyTLEER"
"Panda Express Fundraiser is tomorrow. Help raise funds for school PTA to organize more events.\n#ZankerPTA #PTA https://t.co/tC5359vWx1"
"And R&amp;M fans consider themselves “smart”.....fucking idiots https://t.co/8on3FxMbr5"
"Done with work. Starbucks then what to do?"
"@ehhmariah Beggars can't be choosers, bitch this ain't Chipotle"
"and consumer preferences https://t.co/cTCZwCJBt1"
"RT @StufidMoan: Arby's has beaten Wendy's https://t.co/CydUdQyWSF"
"RT @JayNoHoes: \"Yea lemme get uh number 5 with a large COKE” https://t.co/zJvr3zN7Bj"
"I'm praying for all my niggas who think Del Taco is better than Taco Bell, ion think y'all gone see 25 with this type of thinking 😭"
"RT @TheDefJef: Let me hold that then. https://t.co/SxTcsQqZFG"
"RT @geekwire: How @Starbucks uses VR to design stores: “Designers now can walk a store, see what it’s going to look like” —Kevin… "
"I can vouch for the deliciousness of this dish. 😎👍 https://t.co/yhphrw0Jxo"
"A Racist Just Shouted The N-word On The Subway And Immediately Got What He Deserves https://t.co/iw1sNwaijG via @OccupyDemocrats"
"RT @crashdev: Love that one of #Seattle's biggest non-tech success stories ($SBUX) is now a digital #retail leader too https://t.co/Laz5XyA…"
"@dominos So is not cutting pizza  a new thing? https://t.co/gYY7RscP1Z"
"RT @BarberaLoyd: thats a big freakin mcdonalds https://t.co/8IYtaNAm97"
"Found this absolutely gorgeous car at a starbucks that has a supercharger in it. https://t.co/29zHMoNnpo https://t.co/Dogc31FfqD"
"@whatthequelz Let's get chipotle"
"Thanks to @BHarrison25 and her #starbucks store across the country, Justin and his division are… https://t.co/r0znLPPdgz"
"@barstoolWSD white castle"
"At #mobe17 @edyong209: discussing plague in subway story https://t.co/j6k5O3jwNl"
"I'm at Starbucks in Garden Grove, CA https://t.co/7XFtyfCjJS"
"@krystalball @HillaryClinton @HarveyWeinstein This is pathetic Krystal. Just fucking pathetic. Blaming Hillary for sexism."
"In a span of three weeks, Starbucks opens three new locations in the High Desert https://t.co/apwGRp31gZ"
"Who mans is this....trying to talk shit with a lime-a-rita in his hand https://t.co/qZUV6pBcDu"
"RT @phylogenomics: At #mobe17 @edyong209: discussing plague in subway story https://t.co/j6k5O3jwNl"
"RT @gigirules7: #FastFoodBroadway    Beautiful: The Burger King Musical https://t.co/1klwPAK4bt"
"Creeper. \n#orsomething #orderingatstarbucks #maybehesplacingamobileorder @ Starbucks https://t.co/8MDqRCd58t"
"CEO of AT&amp;T in Mexico Kelly King on our wireless work in Mexico City's sprawling subway https://t.co/ZNAIJKrgS2… https://t.co/CnPQQ83okZ"
"RT @chonchonnie: @AaronAceves @Henrri_Chris @McDonalds Aaron, you don't know happiness."
"@chonchonnie @Henrri_Chris @McDonalds You’re not wrong."
"@kfc @dominikahoutx what would his finisher be called? The Pressure Cooker?"
"It really is  compared to what’s out there. Sorry not everyone works at Taco Bell or McDonalds. https://t.co/bgXNQZdlEl"
"both are 🚮 https://t.co/Zh7O2Q9X1j"
"@JaredRowland1 @ColeLedford11 @BurgerKing @Wendys This was posted in February..."
"RT @BlueSea1964: 🚨 Fmr Liberal MSNBC Host Krystal Ball Admits Hillary’s Silence ‘Makes Us All Look Like Hypocrites’!\n\nSurprised? No\n https:…"
"Pleeease. https://t.co/upJhVGBmUn"
"RT @JackAnderson75: Racist ass gets kicked off subway  https://t.co/lB7ocmIflG"
"Del taco is a lifesaver"
"@AndrewHamrick2 Throwing a jack in the box cheeseburger into to ceiling?"
"RT @MiiToons: Mulan didn’t deserve any of this. \n\nHope y’all  enjoy this piece I came up with in the midst of all the chaos!… "
"you sound like you hang around people who work at taco bell because I hang around millionaires and a they aren't le… https://t.co/seaXdscbeN"
"Damn that lady even wasted her Broccoli and Cheddar soup (WHICH YOU KNOW SHE WAS LOOKING SO FORWARD TO EATING) on t… https://t.co/0s7XlVjZsg"
"RT @Eaaasydee: Them hoes hit when you high ☹️ https://t.co/0C2C9wBe96"
"RT @LBPolyBaseball: Do it for the Team! Today at Signal Hill Chipotle 4:30pm-8:30pm. Tell em your supporting LB POLY BASEBALL!! https://t.c…"
"My first job was at jack in the box"
"#BloombergTV ❧ Starbucks CEO Kevin Johnson says the tech industry and coffee industry have a lot in common … https://t.co/KBwvlrbdkz"
"i haven’t had starbucks in while"
"Not too many Taco Bell’s in San Francisco 🤷🏽‍♀️ https://t.co/L1JadEkNFV"
"Also tell them you're there for Evan Seal! https://t.co/D5UnjjFrq0"
"RT @L___1485: WE DID IT, YAY. ❤❤❤\n\nFirst place in both polls of AAA, and now we have won the 1 month BD Subway ad for Chanyeol.… "
"I'm craving Krispy Kreme"
"Just got a chipotle burrito with shockingly few ingredients. This burrito belongs in a Dickensian orphanage"
"RT @NewWillOrder_: Here you go lmaoo https://t.co/pJbsZxphds"
"RT @lschriml: @edyong209 from @TheAtlantic counters poor headlines in NYC after unnecessary subway anthrax scare in general publi… "
"Not a lot in Newport Beach either https://t.co/oYmNiKCpSd"
"There's a group of girls at Starbucks looking for a hubby on  the LLU med potpourri 😂"
"Is the queso at Chipotle good???"
"RT @cnni: The next Pizza Hut pizza that arrives at your door should be hotter -- up to 15 degrees hotter… "
"I liked a @YouTube video https://t.co/SJsxL7Kgdi Kermit The Frog gets a BLOWJOB from Angry Mom in McDonalds Drive Thru!"
"You Can Now Buy Your Very Own Subway Countdown Clock. https://t.co/wamb7uXyWh"
"all sports in my town got cancelled today so everyone in sports just went to taco bell instead so there's like 40 kids in taco bell"
"RT @jackantonoff: i took an edible yesterday, went to burger king, slept till 3pm and STILL found time to address harvey weinstein."
"Come support El Modena Football (@elmodenafb) at Chipotle today (10/10 from 4:00-8:00 p.m. #dominatetheday https://t.co/F0N5aHDXw6"
"Everyone in starbucks is ready to quit their job"
"It gets so crazy at starbucks but its customers who appreciate our hardwork that keep me sane 😭"
"There is a fat elephant sitting on America and I think it's time to address it .. @McDonalds we want Orange Hi-c back NOW"
"Ext. Subway Parking lot:\n\nA man who prob has a daughter: Hey sexy mmmmm!!\n\nMe: Two dogs pissed on me today and I didn't even wash my hands."
"I went to mcdonalds and they still had the \"were all out of Szechuan sauce\" sign up am I dreaming"
"@notdiablosrsly @Moonsongstory My point is that the reason it got popular was because it was from Mcdonalds in spec… https://t.co/2EpeJedsSG"
"BOONK GANG MY ASS TO TACO BELL 😂💦"
"Carl’s Jr. Is Begging Amazon To Buy It On Twitter And People Think It’s A Bit Desperate https://t.co/EvoznewcYZ"
"RT @SoDamnCheap: Thanks a lot Taco Bell https://t.co/P43yNrhMoi"
"RT @bluechoochoo: When you ambulance chase on social, you awaken the karma kraken. Somebody's about to find a fidget spinner in their… "
"I had a gross teriyaki bowl from jack , half a jimmy johns sandwich nd now I’m sitting at my desk with a bag of hot Cheetos nd bbq chips 🙄"
"RT @toddmillionaire: Welcome to @twitter where the average person doesn't have $1000 saved, but 100k isn't a lot of money https://t.co/HRMY…"
"Craving a chocolate smoothie from Starbucks sooooo bad"
"How New Yorkers Reacted To Subway Rider’s Racist, Drunken Rant (Video) https://t.co/VK1Z438LI4 https://t.co/Qq7YpWbrr4"
"RT @BannerSaga: Superfan @nafeij has created this incredible subway map of the #BannerSaga world! Nicely done, Nafeij!… "
"my chipotle voice is a different person tbh like whomst is that happy bitch???? I DONT EVEN LIKE PEOPLE THAT MUCH"
"Pumpkin isn’t the only spice to eat this fall! We have savory, creamy, &amp; spicy flavors from Chipotle Style Rolled T… https://t.co/BcOZpWARhw"
"8 Things That Annoy Starbucks Baristas and 1 Thing That Doesn't. https://t.co/HGZE4Pyx6A"
"lookin like a $5 box from Taco Bell https://t.co/7a65HJDoKn"
"RT @rainamilen: CRINE https://t.co/zJyBXwe6Q6"
"Gain the skills to get your careers cooking - join the Boston Market team. https://t.co/xysBl6imiF #FastCasual #RanchoCucamonga, CA #Job"
"This video gave me so much joy 🤣 https://t.co/CGclc6nZiS"
"RT @safrazie: I've been a Flower Subway proponent, but only recently realized what a major benefit moving Blue-Expo xfer to Washington woul…"
"RT @CamdenAngelis: I take too many photos in Starbucks bathrooms, I'm trying to pretend this is sanitary but I know I'm disguising https://…"
"mom gave me this taco bell nachos with all this stuff on it and i cant bring myself to eat it somehow"
"RT @lilypodracky: 146. high at subway https://t.co/iYs2xpRL9K"
"@mostillusive But Taco Bell is good 😁"
"@_KiiGetHer I barely even go to Wendys at that lol"
"RT @emma_reusing: Come support HHS Wrestling today from 5-9pm at the chipotle on Tyler!❤️🤼‍♀️ https://t.co/xBCLTkDEIB"
"@LickMySwoosh @KAFosterSowell @Madi_Hitt97 @jvdoak @ElderLansing McDonalds pays same for a White, Black, Asian, His… https://t.co/uKubqpr9wB"
"@BadJuJu19 @billy4ever9 @Imabigscrewball @AlexanderArch3r @Remington45S @1Silverbeard @BWANA86a @waggles111… https://t.co/QrR9ei7qXN"
"Day two: @facebook black and white photo challenge. As my mom calls it, my Mecca, @Starbucks. https://t.co/G9Lx4nKPn7"
"Chipotle Fundraiser Tonight! Be sure to go and support! 🌯 https://t.co/Lpki5LsHhg"
"@Omarvelous29 I don't even get an \"I love you too\" I'll take that ass to jack in the box for some tacos"
"The Lion Burger King #FastFoodBroadway"
"RT @UberFacts: KFC's Colonel Sanders was once a lawyer who assaulted a client -- He also killed a man in a shootout."
"I did know a guy who worked as one of Harvey Weinstein's assistants over a decade ago. No juicy stories, though. Ju… https://t.co/OFZj881QpX"
"SOMEONE COME TO MY DORM AND BRING ME STARBUCKS IM STUCK HERE UNTIL I FINISH MY MIDTERM"
"@metrolosangeles Ironic that the PSA about subway etiquette starts with the main character boarding without letting people off ;-)"
"RT @junsazanami1083: nagisa: we'll take this place over\nohii-san: yes we will make everyone bow to us!\nibara: they'll be crushed to dust!\nm…"
"2017: The year of McDonalds sauce think pieces."
"RT @RossitaMendes: A Racist Just Shouted The N-word On The Subway And Immediately Got What He Deserves https://t.co/TLOfIyZbEs https://t.co…"
"@ailayne @Arbys for real love their target demographic 😂"
"RT @liza_chamber: A Racist Just Shouted The N-word On The Subway And Immediately Got What He Deserves https://t.co/kYKxDE6t7I https://t.co/…"
