"@OriginalMtabbs I do the same thing when KFC gives me an extra drumstick."
"RT @nihilist_arbys: Sure, shit's bleak, but remember: we're all gonna be so fucking dead soon. None of this matters.\nEat arbys"
"RT @morganhousel: Twitter created the most addictive and socially transformative product of our generation and turned it into a $2.5b… "
"Pretty sure I'm addicted to Taco Bell's cinnamon twists"
"@ChrisDeposits I was going to guess Young Taco Bell"
"Hmmm, interesting... we need to start promoting #healthyfood choices in our #fashion rather than high-calorie… https://t.co/LAz92w0S9F"
"@s_geislinger5 @Wendys this is disgusting"
"Everything you ever wanted to know about Starbucks Macchiatos https://t.co/1XaFy6bWzR via @starbucks"
"@ped_red is this about a Starbucks customer cause im gonna be mad if it is"
"RT @Lin_Manuel: Good morning.\nI believe in you.\nNot always in our leaders, not always in the subway schedules, \nbut always in you.\nYou, unw…"
"RT @aldotcom: This is why @Arbys venison sandwiches aren't illegal in Alabama https://t.co/dDUhFL4aic https://t.co/vrQWHRNX5T"
"@mattwhitlockPM young pizza for some asshole in florida that got into my dominos account"
"@Chantastic_ get me taco bell too mail that ish to colorado :^)))"
"young pizza for some asshole in florida that got into my dominos account https://t.co/KBblr4mP0J"
"RT @HaydenStills: Do you think if I cry directly into into my shitty Chipotle the spirit of Durango will get absorbed and it will magically…"
"I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/jCMB1Wr0un"
"RT @erinbusby: @mivrve must be a chipotle thing bc people always be standing in my fucking bubble in line too.. like chill fatty you’ll get…"
"Someone put onions in my Filet-O-Fish so now I’m pissed #mcdonalds ruined my fave junk meal and I have bad breath."
"I want Starbucks and Pizza ☹️"
"@6thgrade4ever Mine is young taco bell"
"@sarahparkdrums Lol that’s what $13 of Taco Bell does to you😂"
"I can definitively say, the Taco Bell in Ferdinand, Indiana is the absolute worst Taco Bell in this country"
"Lmao u right https://t.co/RG8mch01gk"
"@jakeychristy do more videos with your keyboard. I've watched the Pizza Hut Demo disk video around 70 times because of the sick jams in it"
"@Starbucks Store Manager denied benefits with Crohns Disease https://t.co/bsdnB0jewZ #StepUpStarbucks and do the right thing"
"You ever fucked a toasted subway footlong just to not feel alone?"
"@abbiemarissa @McDonalds Remember that one time you ordered a cheeseburger ketchup only and it was just bun and ketchup?"
"@COSportsNut @McDonalds Honey mustard"
"RT @MylesAjani: A dollar menu at Chick-fil-A https://t.co/rckLWh7tUq"
"Racism as part of the identity politics game is like playing checkers while the Jewish syndicate plays chess.  They are so far out in front."
"RT @Ohhbrandon: Chick-fil-A better than canes don’t @ me"
"RT @RendertheBooty: The guy at chipotle said I look like Yukon Cornelius. What a fucking compliment honestly https://t.co/tWj26aI49Q"
"why is Burger King promoting this? https://t.co/UPXAubT2N2"
"I don’t know the guy that was working at chipotle but he gave me a free burrito so he’s definitely invited to my wedding now"
"subway is the land of inconveniences"
"RT @huffpostqueer: Apple, Starbucks and others petition SCOTUS to ban lgbtq workplace discrimination https://t.co/XgmOh5s9OI"
"Attn: lifting heavy has exploded. Chaos will now occupy participating Dunkin Donuts locations. Line up for extremities enhancement."
"Store manager goes on LOA for Chrons @starbucks denies it. #StepUpStarbucks https://t.co/kqsBaiddLq"
"I really want taco bell"
"I would go to chipotle just for their water"
"Young taco Bell https://t.co/VNreJGxaof"
"RT @deantscott: Well that's 22 mins away and it's bottom of the 9th for the #Nationals. Look at us world we have a pumpkin for a su… "
"@Arbys Texas loves your venison sandwiches! https://t.co/PPud50c4MU"
"***$1200/wk* -- \"AUST. $$$  XPRESS? -- \"OZZIE\": \"EVEN - OUR CENTRE - \"MCDONALDS - SWANSTON ST\" -- \"NOT HERE! -- \"PH… https://t.co/s5WvqmO708"
"Arby's releases #venison sandwiches, tests out limited edition #elk #sandwich for #huntingseason https://t.co/PPud50c4MU"
"RT @Dezzaray___: Laying in the bed, eating McDonald's watching Netflix and playing UNO is a perfect date ☺️😍 https://t.co/zj5F2pUOf8"
"RT @carlykissel: i’ve eaten more taco bell since i’ve been in college than i have my entire life leading up to going to college"
"HAPPY HAPPY BIRTHDAY 💗 love you bunches and I hope your day is filled with happiness and endless amounts of Taco Be… https://t.co/0BleMTC8T7"
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"RT @extranapkins: Check out this terrible pumpkin I saw on the counter of the gas station Subway. Please enjoy it https://t.co/3PgqXSnXBc"
"@tbhadulting @kayyy_girl07 Me every time I go by the Starbucks on campus 😬😂"
"RT @The_News_DIVA: Alaska Fried Chicken? In the UK, Every State Is Fair Game for a KFC Knockoff One data scientis...… "
"LOVE YOU!!!! Miss you so much babe❤️❤️ https://t.co/aYkcStRx3n"
"@TaylorCockrell0 is an angel for taking me to whataburger  to get my chicken....honey...butter....biscuit"
"RT @Lmao: 12 year olds are having sex and i can't even order in mcdonalds without panicking"
"RT @dodomesticdad: So I just had my first cheese curd at @Culvers! And it was GOOD! #CheeseCurdDay #AD https://t.co/vL1SEVvZCj https://t.co…"
"RT @Anti: People who say Subway sucks are mad dumb, you make the fuckin sandwich lmaooo"
"@starbucks you have a reputation of treating partners well. Why not in this case? #StepUpStarbucks https://t.co/bsdnB0APox"
"I got rly drunk and ordered taco bell online and my door dash delivery guy laughed at how fucked up I was"
"RT @iAmTreboR_TSOE: I'm sorry you had to go through that 🤕 https://t.co/Ow3e0PVTtF"
"RT @2fingasss: Whataburger https://t.co/YMzXF4Fr8k"
"RT @squatbot_: \"Admittedly I’m not always the best at this (hello, massive airport McDonalds)...\" https://t.co/QIO98AwGQe #Travel… "
"RT @p_purnell: @mattwhitlockPM Young Chick-fil-A"
"RT @ryahnevers: me: *eats chipotle*\nme 2 hours later: https://t.co/g7kBj1krZi"
"That spicy chicken sandwich from Checkers is perfection"
"Fair warning to everyone: Chick-fil-a tortilla soup is VERY spicy 😫🌶"
"Craving Taco Bell sooo bad rn😩"
"RT @roywoodjr: They look like an ad for a terrible Karate Academy that's next door to a Little Caesars https://t.co/NIS91UqueI"
"RT @CommonWhiteGrls: 12 year olds are having sex and i can't even order in mcdonalds without panicking."
"RT @AUTOMNFS: /am/ rt for followan?\n\n-krystal"
