"RT @RichieIsEvol: @Wendys are spicy nuggets back yet?"
"RT @MiiToons: Mulan didn’t deserve any of this. \n\nHope y’all  enjoy this piece I came up with in the midst of all the chaos!… "
"@drinkinrussian @micha3lamal @amz_bro Mcdonalds knows not to feed the troll 😂"
"No surprise that not surviving on Starbucks has benefits, but I'm so used to being constantly exhausted.. This change in a day is wild."
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"RT @BurgerKing: @ColeLedford11 @Wendys 2017 literally just go so much spicier. 10-piece spicy nuggets are here at BK starting 10/12 for $1.…"
"“Promoted by Burger King” https://t.co/wdjaNutQMs"
"@shomaristone In custody huh? did they stop at burger king before bringing him in?"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"Starbucks Cranberry Bliss Bars Copycat Recipe via @MomSpark"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"I’m Connor and I endorse this message. https://t.co/xBdPNuTskA"
"Chick-Fil-a should train other restaurant's employees. Start with them Checkers employees &amp; smaller businesses like Snappers  😭."
"RT @HoodJesusYo: Live by the 5 C’s and you’ll be alright:\n\n1. Christ \n2. Coffee \n3. Chick-Fil-A \n4. Chipotle \n5. Canes"
"I have become physically &amp; emotionally dependent on Starbucks iced green tea latte"
"Come out to @culvers off Cortez between 5:00 &amp; 8:00 to support Manatee Basketball."
"We’ve got so much work to do. 😒😒😒 https://t.co/sJf7f1icQp"
"RT @_JayAntonio: Burger King is petty for paying to promote this tweet. https://t.co/qMN9S5OEEg"
".@BrunswickFB, @gahs_football vote for your matchup in this week's #Subway #FridayNightBlitz Game of the Week:… https://t.co/7ZTDG6HVio"
"RT @Polygon: McDonald’s proved that Rick and Morty’s smartest fans have no idea what the show is about https://t.co/D87jC9H3fF"
"RT @jackantonoff: i took an edible yesterday, went to burger king, slept till 3pm and STILL found time to address harvey weinstein."
"RT @hotnews____: Man points gun at McDonald's worker on Constitution BLVD over wrong order https://t.co/miAnwozY2U"
"RT @nihilist_arbys: It's Columbus Day, so we're gonna sail over to McDonald's, beat the shit out of everyone, wreck the place &amp; call it arb…"
"RT @Arbys: Sit boy! https://t.co/rwUIkYZ9bF"
"RT @ComicBookNOW: #McDonalds testing a new burger! https://t.co/pkTcEN6VcX https://t.co/gJNXQlTqkB"
"I eat @Wendys burgers knowing full well what the future ramifications of my health will be. They are that good!"
"Want to work at Starbucks? We're #hiring in #Tallahassee, FL! Click for details: https://t.co/vtxn0ERR0U #CustomerService #Job #Jobs"
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"RT @zackfox: Bro pulled up on a Sunday we've all been there https://t.co/9Bm8inKifl"
"Chick-fil-a has the best milkshakes, don’t @ me"
"@McDonalds so you can bring back Szechuan sauce but not the McRib? Por qué no los dos?"
"RT @fart: the president is a nazi and the rich are trying to kill us and you ridiculous fuckers are protesting for bbq sauce https://t.co/A…"
"Promoted by Burger King https://t.co/NYuxFBpj9w"
"if you don’t favor papa johns over other pizza chains, ur sleep"
"RT @ps4andchill: bae: why tf pizza hut keep texting you \nme: https://t.co/7upSqUqkl1"
"It's been like a month since I had Chipotle. My addiction is broken 😩"
"Been like a month since I had Chipotle. My addiction is broken 😩"
"RT @spacecommunism: I'd better not ever see anyone make fun of things teenage girls like after seeing the absolute state of the respons… "
"RT @McDonalds: You spoke. We’ve listened. Lots more #SzechuanSauce and locations. Details soon. And that’s the wayyy the news goes! https:/…"
"Why do people come to subway ... bitch go to the store and make your own damn sandwich lazy fucks"
"The promoter tho?🤷🏻‍♂️😂 https://t.co/BvkphIyiNF"
"KFC in Jamaica is sooooo good. Ugh. I wish all y’all in the states knew how good it is. 😩😋"
"RT @TarekFatah: Y r we hearing about a Toronto-area #ISIS jihadi from 2016 only now? And that too from US? Y was this hidden from us https:…"
"Wendy's on #Yelp: My wife and I went there yesterday and got food poisoning, I am calling the health department to … https://t.co/XC0QB6Ukdt"
"I love chipotle aioli so much."
"RT @Seapeekay: 2 Great Harmony Hollow Episodes recorded today! \n\n2 left to do,\n\nthen 3 One life videos!\n\nbut first.... Mcdonalds is calling…"
"this is the definition of new york values https://t.co/DOkyP7mXXw"
"@JimSimulacrum @CampbellsPoop I actually used to work at taco Bell kfc also when i was 16. So 😋 and😝"
"Check out this photo of Wendy's on #Yelp https://t.co/DSUtrllzwd"
"BITCH I JUST GOT FREE TACO BELL"
"Win a $25 Starbucks gift card! Go to our Facebook page and check out our latest giveaway! https://t.co/vbhQKcPpGA  #afregives  #RealEstate"
"It’s as if @McDonalds realizes it’s a lifestyle publisher—even if that style is so #lowbrow it’s falling off ur fac… https://t.co/0LICdO29aO"
"New Starbucks Magic Kingdom Tumbler Has Been Released https://t.co/tfGVPK45C6 https://t.co/qdWXVdsZ1T"
"@Wendys Just made a Twitter got any idea what to do on this app?"
"@andeemarie19 Every university Chick-fil-A"
"McDonalds mobile ordering is in Orlando 😭😭😭😭"
"RT @K1NGR1ZZY: @BurgerKing Girlfriend: I wonder if he’s thinking what I’m thinking. \n\nBoyfriend: I still can’t believe @Wendys doe… "
"RT @AaronAmaama: ROOM✈️KITCHEN-NO FOOD✈️MCDONALDS-NO MONEY✈️BACK TO ROOM 😢😰 https://t.co/9FZZOtQYwv"
"@pashunfruit_ You have me craving subway but the way my money set up that $30 need to last till next week"
"RT @DouglasDrama: CAR WASH COMING UP!!! DOUGLAS DRAMA WILL BE WASHING YOUR CARS AT WENDYS oct 14t FROM 8:30 TO 2:30!!"
"I’ve ate McDonald’s for 20 years and still weigh 10 pounds https://t.co/jjXCWSH7uT"
"RT @davidcanfield97: Come for Ivana Trump ranting about her furs, stay for the bizarre Taco Bell and Michael Jackson references: https://t.…"
"Subway had the wrong Jared. @firehousesubs @wbr @wmnashville @wbpictures @paramountpics @viacom @thatsjared @justjared @justjaredjr"
"Is Forever 21 really trying to make Taco Bell fashion?"
"Open daily from 8 am to 2 pm, our on-site Starbucks is the perfect spot to get a front row seat to the rebuilding o… https://t.co/UtvOrQ7N9l"
"Just saw a guy get a large Pepsi at Panera bread, is this real life?"
"@ChipotleTweets Right! Chipotle: Way to go Burritonian. Look out for a Free Chips &amp; Queso w/ entree purchase offer coming your way on 10/10."
"RT @SubwayTally: Looks like someone is happy that the new #subway just opened in Bannerman Crossing!! Stop by and see some smiles!… "
"Bro @Wendys really rap battled wing stop on here lmao #Legendary"
"RT @RizzoIsCaptain: When you’re at Starbucks and they spell your name wrong on the cup: \n\n https://t.co/X1cy046cgV"
"burger king being shady??? lol https://t.co/slYUz0Nbb8"
"#News via #FOXNEWS \"Burger King's new spicy nuggets are a direct attack on Wendy's\" https://t.co/s3dmGPZqfH https://t.co/LZmCgdRAzD"
"RT @gasstationwhore: i love this song https://t.co/zzeyaYgELz"
"RT @DobreMarcus: Are you from starbucks because i like you a latte 😂"
"RT @immasid: Someone give me one good reason why Starbucks isn't on UberEats"
"Somebody bring me chipotle 😭😭"
"*walks in Starbucks w/ 30% phone battery*\n“Oh no, all the seats next to outlets are taken”\n*sits down &amp; stays on phone*\n“Ohhh nooo....”"
"@ex_waifu i have a friend in burlington and he said the only taco bells are combod with kfc cuz kfc brings the aver… https://t.co/UsrJxgzyFY"
"@ConanOBrien Dude. I recently binge-watched all the Subway commercials. I did *NOT* see that surprise twist coming!"
"Join the Starbucks team! See our latest #job opening here: https://t.co/9HFclzmugY #CustomerService #Orlando, FL #Hiring #CareerArc"
"RT @BlueSea1964: 🚨 Fmr Liberal MSNBC Host Krystal Ball Admits Hillary’s Silence ‘Makes Us All Look Like Hypocrites’!\n\nSurprised? No\n https:…"
"Harvey Weinstein once masturbated in front of me, too. I was on the subway, so I just tried to ignore him like everyone else.\n\nToo soon?"
"Sbarro: FREE XL NY Slice of Pizza with drink purchase + more when you join The Slice Society https://t.co/0LVhQv1TNN #coupon"
"“This fire zone is KFC everyone in America runs it. The all American pass rush stunt”  - god freeman"
"RT @ThatMick_Kray: For as many people who say they don't/stopped eating McDonalds long time ago, their shit damn sho be booming all 24 hour…"
"Chipotle is poo poo https://t.co/BLOSmUfAoH"
"RT @leeejinkis2: taemin: can we stop by McDonalds for dinner\njinki: no kibum is making food at the dorm\ntaemin: i hate this fuckign… "
"RT @KiiiiingTruuuuu: LMFAOOO WHY IS BURGER KING SO PETTY?! https://t.co/Q5qM9aRW6d"
"Coco Dulce de Leche Cupcake at Disney's Hollywood Studios @starbucks Trolley Car Cafe  #coco #pixarcoco #disney… https://t.co/C7W83U5iQE"
"CUTE!!! https://t.co/QUIFYfPn8z"
"@robreiner That's why I mentally ill people in Hollywood should stay out of politics. You're playing Checkers again… https://t.co/91XKXYatFq"
"u all have something to say about mcdonalds workers but u all stay eating there tho?? lmao"
"RT @moegabrielle: dont check my social media for life updates. might tweet niggas aint shit and'll be referring to the mcdonalds worker tha…"
"RT @ryanridley: The joke that shook capitalism. https://t.co/qVkoFmfuD4"
"@ChrisArchieRS @Wendys or SMOrc"
"RT @ItsKickemm: Burger King gotta be the dumbest fast food I've ever seen https://t.co/o9gxKzElbh"
"also i will pay for ur taco bell after the show if u allow me to stay with you"
"Good move. https://t.co/hZPJ41s4FE"
"See our latest #Plainview, NY #job and click to apply: Restaurant Manager-Panera Bread - https://t.co/VtfzLd8miO #Hospitality #Hiring"
"@DrewOnTheRadio pedos have to stay so many yards from public schools. Now Jon Senning will have to stay an equal distance from @Starbucks"
"RT @buck_dewey: is there r34 of the little caesars man"
"Is it too much to ask for a @Whataburger in Gainesville?"
"I'm gonna get married inside of a chipotle"
"I just poured a half bottle of wine into a Chick-fil-A cup cause I didn’t want to do dishes later #lazy"
"conspiracy theory: mcdonalds only did 20 packs per store to ensure publicity in order for people to care abt them again"
"Shoutout the Barista who made my coffee @Starbucks 👌🏽👌🏽 it’s like they knew how much I needed it."
"RT @yeetstille: ah yes finn wolfhard, not as good as kfc but still nice https://t.co/YDjKljfvlk"
"RT @LovelyLoserYo: @ChoueikiAli @dumbfoundead Me calling Little Caesars on your ass after seeing this https://t.co/hqnCjpXRao"
"RT @jsalolhs: Join us tomorrow at Chipotle!! Mention JSA or present this flyer so that we can get 50% of the proceeds. Hope to se… "
"RT @masehealy: PSA: Microwaved Taco Bell is not great."
"I've got #Oklahoma to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/kPGAI4KBx0"
"RT @meechonmars: you busy having rap battles.... YOU NEED TO BRING BACK SPICY NUGGETS @Wendys"
"RT @neonorchid1: After Taco Bell 😂😂 https://t.co/NezZsBYa0c"
"@vonDerpen @lolita108go @JUNIUS_64 sometimes people want to look at a dude spasming screaming IM PICKLE RICK and *n… https://t.co/2nsot905TF"
"10 piece for 1.49? What kinda chicken are y’all using... https://t.co/U7cJtzdtq0"
"So that’s not the glaze from a Krispy Kreme then? #StupidQuestionsAboutSex"
"Support WHS DM at Chipotle on Thursday, October 19th from 5-9 pm!💚💙😺 https://t.co/Q3wi6QL4SM"
"RT @johnsonnn_katie: i can’t wait till weed is legal bc i just walked past someone burning at starbucks and it was the most refreshing smell"
"Tbh I miss working for Starbucks"
"#FiveGuys and #starbucks totally go together.. Right? Cause this is my dinner and I don't care. I do what I want.… https://t.co/TgNu1e8a8U"
"RT @Jbaker1793: 2weeks till Chipotle night for RHS XC @ Port Richey location. Oct 24 4-8pm"
"RT @TODAYshow: Missing Wendy's spicy chicken nuggets? Have it your way at Burger King https://t.co/xZM9IurREi https://t.co/m6od8PY4gH"
"Craving Checkers fries right now so bad.... had to take a nap to prevent poor decisions"
"@Wendys @Color_The_Phone Strawberry vanilla swirl would be cool"
"RT @tacobell: Want a sneak peek at the #F21xTacoBell collection? Watch Taco Bell’s first fashion show with @Forever21 live on Ins… "
"@ me if you have a Dunkin’ Donuts near you and visit it often"
"💜My Lymphoma Warrior!💜 Chipotle is donating proceeds to Leukemia and Lymphoma Society tonight. #cancersucks https://t.co/urXFPs5gNh"
"Keep y'all head up have faith. Be strong.xoxo mwauhz-M$.👑Honesty #ISIDORENATION #BABESCAKES #TEAMHONESTY… https://t.co/nTXEFUM36g"
"Shots fired @Wendys https://t.co/VyJVj7obut"
"RT @TOKYOMi: Arbys just use anime as a promotion with inyuasha! https://t.co/DyL0GahEfR"
"KFC puts food on the table. Quite literally. They don't want to throw it out."
"@miyaonfiya that you? https://t.co/OEPg0zeahf"
"RT @xl1067: Help @KowboyJake win $2500 from @Mcdonalds! Tweet w/ #XLOsceolaHSEntry! Listen to #FootballFridays on @JohnnysHouse… "
"Spending 24$ at burger king on myself 😂😂😂\n#imhighasshell"
"I liked a @YouTube video https://t.co/L7Uv9jkw3z Incident At Starbucks In Chicago"
"Whataburger https://t.co/S6aI40fDDV"
"@VideoDistortion Yeah, YEAH, sure. /I/ have an expired Taco Bell coupon that's been stuck in my wallet for 3 years… https://t.co/Gt5kIcv8C1"
"RT @MediocreGecko: I still wanna try the unicorn frap from Starbucks"
"Happening now!! Spirit Night at ChickFilA on Palm Bay Road! Chick-fil-A at Palm Bay Road"
"I just checked in @SUBWAY with #mPLUSPlaces Download today!  https://t.co/GqlOvtzPPj"
"why am i just now seeing a panda express opening in winter haven?????"
"RT @99_goonsquad: YO WE BACK WITH THE FIRE CONTENT! NEW VLOG IS UP! MCDONALDS ENTIRE MENU! RT FOR A SHOUTOUT! https://t.co/sX5WnNBW2e"
"He threw him onto subway tracks, and kept others from rescuing his screaming victim, police say https://t.co/wKKFJXNVKB"
"salads from Chick-fil-a are liiiifeeeeee"
"RT @itsZACJENKINS: him: get out of my house. we are done\n\nme: *leaves*\n\nhim: *calls 4mins later* babe im sorry where u at\n\nme: https://t.co…"
"RT @danavento: AD-New spin on a Potato Medley. #RediscoverLaMorena https://t.co/PKWAub2nmd #VivaLaMorena @lamorenausa #Chipotle Ga… "
"RT @Serrels: Kylo Ren is the perfect villain for our times: a tantrum throwing, know-it-all standing outside McDonalds screaming for Szechu…"
"@juliashrek I had to google \"timbits\" b/c apparently I'm an uncultured southerner. But, make that one \"HOT\" Krispy… https://t.co/xJ25Flssjb"
"damn... https://t.co/A5TLJ4awRu"
"Got the crib feeling like chipotle https://t.co/oaYVVF1FFy"
"RT @atowwwn: Whataburger https://t.co/S6aI40fDDV"
"@BoyGeorge @McDonalds That bad? I've never had one. Give me Costas or Starbucks any day"
"Panera Bread now delivers in Orlando  @panerabread #happydance https://t.co/qN8llLrfDO"
"@TonyO97 I see the Burger King now"
"Caramel Apple Spice frappuccino from #starbucks 🍎 It tastes like apple pie! https://t.co/DFKsJ4N2XU"
"@Mando_305 You right. I’m out there with my laptop, Starbucks style"
"RT @_jDes: fucking love being from New York. https://t.co/CU2OPzKnYD"
"Mac n' Cheetos moving from Burger King into grocery stores. https://t.co/jwHzCGOvpf #foodandbeverage"
"Lmao facts https://t.co/wlccTel1Hd"
"RT @SocialPowerOne1: A Racist Just Shouted The N-word On The Subway And Immediately Got What He Deserves https://t.co/DFpBKyVEpu"
"More Bucks #starbucks\nAvailable now at https://t.co/3Si8kQhwB5 https://t.co/rau0Yxfcqa"
"RT @indiKEV: free nuggets or I'm taking my appetite to Wendys https://t.co/Y5E9yDGsmw"
"I just got my chipotle for free and if that’s not a blessing I don’t know what is"
"Burger King out here bringing the heat https://t.co/sP8NmHceQI"
"@CBSNews @CBSThisMorning @Starbucks HELLO WORLD! I'M A NEW PICASSO. GIVE ME A MANAGER AND A PRESSCONFERENCE.… https://t.co/kpyScQIe8J"
"RT @toddmillionaire: Welcome to @twitter where the average person doesn't have $1000 saved, but 100k isn't a lot of money https://t.co/HRMY…"
"RT @FloridaMeme: Even bad Moes is better than good chipotle"
"RT @Landof10PSU: PENN STATE FANS: Buy any Papa Johns pizza at regular menu price and get a 2nd of equal or lesser value for FREE starting t…"
"@Kasparov63 He'd spend the whole match asking you the rules &amp; insisting you play him at checkers instead."
"Enter for a chance to win a Starbucks gift card from @cfoblog! #giveaway https://t.co/bpnjgvBxNz"
"@BET @McDonalds NOOOOOO! If ThoseBitches Want VEGAN, Take Their Azz 2 \"Sweet Tomatoes!\" EatBerry&amp;Nutz@Ur DamnHouse!… https://t.co/xkOJzxCSbS"
"Oh shocker the subway is delayed https://t.co/hUdrnQjHUk"
"Passengers forcibly removed a man from the subway who claimed he was a lawyer for repeatedly screaming the n-word.… https://t.co/TE5CZjkmAY"
"I need the Starbucks by my house to open already"
"I want a strawberry milkshake from Chick-fil-A again 😩"
"lol this just came across my feed. @BurgerKing and @wendys about to start WWIII"
"@bklyngirltnj @BET @McDonalds Wendy Said \"We've GotBeef FuckMcDonalds!\" Haaaaa! I'mGoing2Wendy's! TheyGonna MessUp… https://t.co/keOjdukoUD"
"Anyway i want otis spunkmeyer cookies and krispy kreme donuts."
"If anyone is in FIU and can bring me a lattes from Starbucks, I will very much appreciate it 🙃😴"
"RT @orlandopaz_12: ATTENTION! Everyone please come out to Chipotle from 4-8 pm to support you Goleman SGA @GolemanGators https://t.co/mAfvC…"
"Candy canes https://t.co/ZFYVQBuIUB"
"@samanthaa_100 @Wendys Pro tip: you can exchange your fries with a side salad when you order a meal. Delicious and healthy!"
"Lowkey triggered cause I fuck up some taco bell at 3 am after a show or when the squad bugged and we got the munchi… https://t.co/FrXzTKsP63"
"RT @Starbucksnews: #Upstanders, A @Starbucks Original Series: Stories of extraordinary courage in unexpected places… "
"@peytonskeen ole drunk ass https://t.co/Hh8jQ5MzSt"
"RT @ColumbusFtball: Thank you @SFHSSports and @McDonalds for naming us your Team of the Week! Read more ➡️ https://t.co/SCa59nQ3g9 #CPride…"
"Reminded me of when I was a kid I was so obsessed with those Batman cups I mean I was like 11 lol 😂 https://t.co/X04xG03qfh"
"when chipotle knows that their queso is ass so they don't even bother to give it to me when i order it... #triggered @kayla_bowers99"
"RT @829checa: Publix subs are waaay better than subway don't @ me"
"RT @madisonpaige422: when chipotle knows that their queso is ass so they don't even bother to give it to me when i order it... #triggered @…"
"RT @mymixtapez: Passengers forcibly removed a man from the subway who claimed he was a lawyer for repeatedly screaming the n-word.… "
"RT @EhJovan: that wrist flick when she threw her soup 😍 https://t.co/OQ7kdmZ5um"
"@SenSanders How many job ready children are coming out of High schools, 21st Century jobs, not Burger King ready gr… https://t.co/5Wl2MwTSdU"
"RT @mariaaaahlynn: @ThatSavage_Nick its all about del taco 😭"
"🍎Tell my why apple jack is always an afterthought?🍎 #MLP @McDonalds https://t.co/s4toadO0vW"
"How A Szechuan-Flavored Disaster Hurt “Rick And Morty” Way More Than McDonald’s https://t.co/VzFVwT00gs"
"RT @AndrewDEast: A big decision @shawnjohnson recently made #chipotle #burrito #funny #wife #video https://t.co/ni1xwZ5fXh"
