"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"RT @JohnLegere: I think I’d rather have a #TMobileONEsie, @PizzaHut https://t.co/qUPLfns2cI"
"An years supply of Chick-Fil-A sauce would be awesome @ChickfilA :)"
"Join the SONIC Drive-In team! See our latest #job opening here: https://t.co/2A0vEV2IHR #SONIC #Hospitality #Beaufort, SC #Hiring"
"Hey everyone! I’m Krystal tweeting from the Peach State! 🍑 #chatsnap https://t.co/jlnjun0X4A"
"RT @_0utk4st: @_kingzley @julio__5anchez @iitskvsey i wouldn’t be surprised 😂 weirdos https://t.co/vYgpgdouv5"
"RT @7evenSoFuego: Woke up to a racist getting his ass handed. It's a beautiful morning https://t.co/mSOKSI6kp2"
"Omgggg, pleaseee those were bomb https://t.co/jYMf77kyV2"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"RT @NYTHealth: KFC becomes a status symbol in Ghana, with obesity and diabetes rates already soaring. https://t.co/x9NmSHPVZ0"
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"5 Cool Facts About Chick-fil-a https://t.co/WjR9XerC2B"
"#RecallKemp Petition will be at Starbucks at Sandy Plains &amp; Shallowford RD Tonight only from 7 PM to 7:30 PM #GA06 #CobbCountyGA #BrianKemp"
"PAPA JOHNS HAS A FKN PIZZA TRACKER NOW WELCOME BACK TO THE FAMILY PAPA"
"Did you know we are now brewing Starbucks Coffee at our Cyber Cafe? Take a seat and play a game of chess!... https://t.co/kOto43bDS5"
"RT @rackstarminks: LoooooooooooooooooooooooL chick fil a would never do that https://t.co/IvmFy9tfUC"
"Man if you go to Chipotle &amp; get tacos I disown you. Bowl w/ free tortillas all day. https://t.co/QkeKbbr4iv"
"i want starbucks."
"RT @jimpjorps: at Taco Bell; woman ahead of me is trying to order a “chocobo supreme” and will not work with the cashier to figure out what…"
"Oh deer, @Arbys (via @AP) https://t.co/9pzDAFjuWI"
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"The only fake nuggets I ate 🤦🏾‍♂️ https://t.co/t2Dbt05ZNM"
"I'm at Chick-fil-A in Atlanta, GA https://t.co/r0Epr4cR1C"
"Welcome to Trumps America 😪 https://t.co/pdi0p9WaF9"
"RT @McDonalds: You spoke. We’ve listened. Lots more #SzechuanSauce and locations. Details soon. And that’s the wayyy the news goes! https:/…"
"GuyKawasaki-&gt;\n\nHidden life of the Starbucks mermaid https://t.co/wSDTS8inOn\n\n— Guy Kawasaki (GuyKawasaki) October… https://t.co/ELk5h7FQuw"
"RT @callmeshitto: oh my god ansley did u see the taco bell and forever 21 collab i cannot wait to buy a shirt so people know i enjoy eating…"
"RT @NewHampOC: Again...Phoenix are Rising! https://t.co/HTlFaDXoIL"
"RT @RichieIsEvol: @Wendys are spicy nuggets back yet?"
"RT @joefrancis: Taco Bell’s Fashion Collab with Forever 21 Is Here — See the Whole Collection https://t.co/gOLVOMElSc #fashionwee… https://…"
"I liked a @YouTube video https://t.co/AN5rHJO7xO Burger King Chicken Parmesan Sandwich (Combo Meal) | WHAT ARE WE EATING?? | The Wolfe"
"I drew a dog I saw on the sidewalk while waiting for my mcdonalds https://t.co/AexdADS0ux"
"RT @BitchAssBowie: Burger King out here promoting slander LMFAO https://t.co/fNj3kKpi6H"
"RT @AVoiceForAllGA: #RecallKemp Petition will be at Starbucks at Sandy Plains &amp; Shallowford RD Tonight only from 7 PM to 7:30 PM #GA06 #Cob…"
"This is me. I’m the boyfriend. https://t.co/9PMzcsGjAd"
"RT @ps4andchill: bae: why tf pizza hut keep texting you \nme: https://t.co/7upSqUqkl1"
"We gotta go get some Happy Meals for a Litten @BrianMUnderwood ... https://t.co/8fjvpKQDwE"
"RT @isabelzawtun: I walk over a subway grate and my skirt sexily blows up in a gust of wind, revealing my six lanky beetle gams."
"RT @kirbymadyson_: Fact: If you start the day out with Chick-Fil-A it’s proven that you’ll have a better &amp; brighter day"
"RT @childrensatl: Have lunch or dinner plans today? It's Give Back Day at every Chipotle in Georgia, and proceeds benefit us! https://t.co/…"
"RT plz Taco Bell/KFC needs adult brooms for Dothan, AL!!! #badback https://t.co/ilG1AM7fbT"
"Krystal is launching a seven-week-long celebration that will award some lucky buyer of a Coke Zero drink $1 million.\nhttps://t.co/wrC7ZZfXMQ"
"@McDonalds -promo you have on your page and hanging in the window of the drive through is no longer valid and I pd full price..."
"the cutest guy walked into chipotle and i didn't shoot my shot. SMDH why am i like this???"
"RT @kfc: “Would you like to be playable in the WWE 2K18 video game?” they said. “As long as my physique is 100% accurate,” s… "
"Build A Subway Sandwich And We’ll Reveal Your Secret Sexy Talent https://t.co/KIW1FAkkps #found #viewbe.com"
"Perhaps good idea but chick-fil-a is healthier to eat at. https://t.co/H1ceLqTyjb"
"@LivingLocoLive We apologize, Tony. Please email us more details about your visit to socialmedia@arbys.com &amp; we will make it right."
"RT @MetthewJ: GO TO SCHOOL KIDDO https://t.co/R3reAkX6FA"
"Someone come to my job w/ Starbucks pls"
"#AutoFeatures Spied! Mid-Engine Corvette Prototype Caught at McDonald’s https://t.co/nvsDPd3UGV https://t.co/qRDSqrT74v"
"Cookin meals for the rest of the week. Some surprises for the fam...mango chipotle chicken with collard greens and #spanishrice #mixingitup"
"RT @saintdyana: Fuck that white guy for trying to shield him. Y’all literally be protecting racists thinking you’re doing a good th… "
"RT @IPunchTHOTS: Dove &amp; Chick-Fil-A gonna just have to call me a Nigger to my face🤷🏽‍♀️🤷🏽‍♀️😂"
"@1stScottESmith Sorry to hear that, Scott. Please email us more details about your visit to socialmedia@arbys.com &amp; we will address."
"RT @WizMommma: Me : “I had Panda Express for dinner”\nMom twitter : “YOURE NOT EVEN CHINESE” *blocked* *subtweeted*"
"RT @Domyenn: My queen @princessnokia don’t fuckin play that, hope the soup was scorching too! https://t.co/pTMHqGAeI8"
"Forever 21 Thought Outside The Bun And Launched A Collab With Taco Bell https://t.co/ZlZBUa1hQa"
"RT @Caraboooo123: Not only can you get chick-fil-a &amp; Waffle House, but also a comfort colors tshirt?!!! Don’t miss out on this deal!… "
"Starbucks ☕☕☕"
"Anyone else nigga-rig there chunky soup/Progresso?Just made chicken tortilla&amp;put garlic,onion,chilli,chipotle,paprika&amp; cumin powder in mine😋"
"RT @Starbucks: Handcrafted. #MaplePecanLatte https://t.co/89fURSIOvu"
"RT @oraltwjnk: YASSS LADY WITH THE SOUP GO BEST FRIEND THAT’S MY BEST FRIEND https://t.co/lnxF22xPpQ"
"I added a video to a @YouTube playlist https://t.co/BQvNHRHmIA BIG FAT TACO BELL MUKBANG! (Eating Show)"
"RT @ChrisC_Hussle: Never was. Never will be. https://t.co/YNEpy5kCMa"
"RT @TasteThis4You: *NEW* Taco Bell Breakfast Taco (Limited Time) | Review | Mukbang | Eat Breakfast With Me: https://t.co/gjraLVAGrT via @Y…"
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"Get back home to see that a Krispy Kreme is being built 2 minutes from home. Scary."
"RT @Svage2times: Hoodrich \nLil Baby\nFuture\nTI\nLil Boat\n21 Savage... basically the whole industry https://t.co/qtlN7XWMWt"
"RT @YourLifeAfter25: October 13th is National Cheese Curd Day! Celebrate The @culvers Way! + Free Wisconsin Cheese Curd #Giveaway! #ad - ht…"
"Chipotle is donating 50% of the money from every order to Children's Healthcare of Atlanta through the end of the day today! \n#ChoA"
"@pinkharm Wheat bread is horrible and always go with Italian herb and cheese at subway."
"my brother offered to get me starbucks and I got a venti water. cause I’d rather eat my calories then drink them. life sucks :("
"RT @theDirtyVegan: The future is vegan. https://t.co/gfg31wLNW8"
"(2/2) all those people didn’t have my arms, she would’ve got all this work OMM *restore iphone mode* 🖕🏾 Arbys with a wet dick ‼️"
"RT @BigBeard_Ali: Dove &amp; Chick-Fil-a just gone have to call me a nigger to my face 🤷🏽‍♂️"
"RT @CauseWereTexas: Whataburger https://t.co/h3JB1QvQOv"
"Almost all the best fast food is overtly Christian\n\nIn-N-Out\nChick-fil-A\nCook Out\n\nWendys made a deal with the devil, hence the square meat"
"Want to work at Panera Bread? We're #hiring in #Cartersville, GA! Click for details: https://t.co/VkS9aHoHJP #parttime #LineCook #Cook #Job"
"Or chipotle 🤔"
"RT @yazmennia: Chipotle https://t.co/appMYslg0H"
"Can vegans eat Chipotle?"
"I’m in Illinois I can’t wait to eat White Castle"
"This tweet is promoted by Burger King. LMAO https://t.co/OElnP7pyoG"
"Watch. The passengers will be at fault for pushing him off. https://t.co/J86ShcijqE"
"So I I just got some chick-fil-a in Stone Mountain. Shit nasty \nNo salt on fries \nNo lemonade in my Frosted lemonade\n🤦🏿‍♂️🤦🏿‍♂️🤦🏿‍♂️"
"RT @NVmeCV: One time for the kindness of New York subway patrons 👏🏽👏🏽👏🏽 https://t.co/GZEHf0fZei"
"RT @conorpatttt: a crowded subway.\nsomeone licks my arm.\npanic. disgust. fear.\n\nit’s a puppy in a bag.\nwarmth. jubilation. euphoria. \nlady,…"
"AHOOYY pirates and princesses!! Come join us on October 19 for a night of fun, crafts, pirates, princesses and the… https://t.co/ipoBOxgseo"
"I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/e3C3hhcyIz"
"RT @nihilist_arbys: It's Columbus Day, so we're gonna sail over to McDonald's, beat the shit out of everyone, wreck the place &amp; call it arb…"
"Opted to eat a salad at Chipotle instead of In N Out. I've truly matured as a human."
"RT @AR_Era: Yessir fam https://t.co/7Ej3w1uhJq"
"RT @siriusxblvck: The Szechuan sauce fiasco proves Rick and Morty fans don’t understand Rick and Morty https://t.co/tfe0EwpSQ0. I hope yall…"
"RT @_jennydeath_: Damn that's hard. My mind says Tropical Smoothie to switch it up. But my heart says Chipotle https://t.co/WvVlZ0EDro"
"RT @jonnyrocket941: Chipotle queso is awful. Doesn’t even come close to @Moes_HQ"
"RT @Whataburger: I don’t need a curve on a test. I need Whataburger."
"Subway would be so clutch rn"
"RT @adam22: Whataburger will never be the same https://t.co/RpdURRYsH1"
"Chick-Fil-A holds a drumline battle  https://t.co/EBSFUqzRkt emma-barfield"
"That random moment when Tim Kaine is standing in line with you at Starbucks."
"RT @Anncostanza1: I am a New Yorker born, raised and on the city streets for a long time! You couldn't pay me to vote for Bill de Bla… "
"RT @itsabartonthang: This is the Unity we need in American, this should not be tolerated. https://t.co/Iv4letO6Ta"
"RT @Devontooshort: Chipotle trash too https://t.co/OUR9BXqFFU"
"RT @Arbys: We have the Venison. 10-21-2017 https://t.co/sD4rZBOJRb"
"Chipotle/Wingstop https://t.co/uW9rXbHKug"
"RT @JoeHNewYork: #NFL @Kaepernick7 Rev Al has got your First Amendment enjoy working at #starbucks #BoycottNFL #BoycottEminem… "
"Holy shit y’all Burger King is roasting https://t.co/U5ABeTJ3ZB"
"@RealMattCouch I can't believe your own video drinking Starbucks piss.. I'm done I turned you off"
"I just subconsciously talked myself into thinking that I deserve to go get Zaxby’s even though I haven’t done anything today but go shopping"
"Princess Nokia threw the subway soup?! https://t.co/9PkrpBXd7M"
"@Arbys advertisement game is a S+ ranking.\n\nMight need to schedule a visit soon. Subliminal messaging is working 👍"
"❤❤❤❤❤ @subway cookie https://t.co/qm4isPwHkk"
"Dunkin' Donuts is dropping the \"Donuts\" and eliminating some donuts from their menu. Are they crazy?... https://t.co/5CxC43wPT8 via @Inc"
"RT @_raychelmacera: S/o to the random doc in Starbucks who gave me a motivational talk to hang in there with school and don’t give up. So k…"
"RT @AgendaOfEvil: #Muslim Migrants #Attack old man on German subway who came to defense of young girl https://t.co/ucvfsO5wW0"
"RT @1Kidrauhl_Biebz: WHILE WE WERE ALL WORRIED ABOUT JUSTIN HE WAS IN STARBUCKS DOING HIS COLLEGE COURSE WORK &amp; MEETING FANS. I'M HAPPY"
"RT @AMike4761: McDonald's employee fired for refusing service to police officer. GOOD for McDonalds!    #ma4t  https://t.co/MiFmyYgDC2"
"@jamiegraceh WHATABURGER ALL THE WAY!"
"RT @Chicago_Styles: So I went to @Whataburger  and I just had to rap my order cuz I was mad hungry!! https://t.co/1AAwL2wa6h"
"RT @ITweetThroughIt: First time having Panda Express and @TayLAnotTayLOR_ and @Ellebesharp was NO HELP"
"\"He can be famous or cut up into pieces.” https://t.co/yZqVXmEzdo"
"This is freedom of speech? 🤔 https://t.co/EB2NRERHQf"
"RT @gabbthegreat_: can we stop calling McDonalds employees \"unskilled workers\" because they seem extremely skilled at dealing with your bul…"
"RT @danavento: AD-New spin on a Potato Medley. #RediscoverLaMorena https://t.co/PKWAub2nmd #VivaLaMorena @lamorenausa #Chipotle Ga… "
"A Chick-Fil-A trainee watching the “My Pleasure!” video: https://t.co/l8C5vIN1Sd"
"RT @redhead_ty: A burrito with brown rice, chicken, black beans, corn, and sour cream would be sooooooooooooooooooooooooooooooooooo… "
"Taco Bell Has Low Key Become One of America's Healthiest Fast Food Chains https://t.co/cwCKsfDnw9"
"They put fake semen in Starbucks coffee"
"Paulding County Restaurant Inspections: Chick-Fil-A, Starbucks, Waffle House, Asian Express https://t.co/GkkAyz9War https://t.co/KmNuRRUGLy"
"Just ordered Jimmy Johns for the first time and according to the commercial it should be here"
"The line at Starbucks is like 50 ft printer cable https://t.co/xwcdTaOG5O"
"Visit Chick-fil-A  during Pink Day, Oct. 20. Stop by our photo booth. Get free Paper Doll magnets. T-shirts and cal… https://t.co/4DrvolVkHQ"
"RT @TheComedyHumor: The time when McDonalds gave out good toys... https://t.co/VDD273ZWi8"
"Relax with the facts B. https://t.co/XWsXMd1tXx"
"RT @x_FreshStart: Dove and Chick-fil-A going just have to call me a nigger to my face."
"Zaxby’s cookies are so slept on"
"RT @panerabread: I’m eating lunch from our kids menu. @Wendys @McDonalds @BurgerKing Will you eat from yours? - Ron… "
"So when Pizza Hut start making apple pies?"
"RT @TheDweck: Why has Hillary stayed silent about this??? https://t.co/A8BR3J1lLe"
"You too pretty to have these shitty tweets babe https://t.co/bWpyVAgMUR"
"Cars of the Future defined Mid-Engine Chevrolet Corvette Prototype Spied Near the Drive-Thru https://t.co/OENd5lnNsU https://t.co/9UXY4BYIZa"
"damn i really cannot listen to @internetsyd in public unless i'm tryna be That Bitch™ crying on the subway"
"@YesImfromDC At least a Krispy Kreme cats"
"blackvoices: Princess Nokia reveals she threw soup on racist subway rider in viral video https://t.co/tzdO4NbvCg https://t.co/8MFlCGLrma"
"RT @andrew1k_: zaxbys &gt;&gt;&gt; chick-fil-a 🤷🏾‍♂️"
"@AdobeExpCloud Chipotle! #AdobeChat https://t.co/zFS60Xqpbb"
"RT @Simpboyz: the race turned into a triathlon https://t.co/OzivbGhRWV"
"@CillizzaCNN @CillizzaCNN And I’m sure all these “fact checkers” have ZERO biases toward our president"
"RT @olanewsadviser: Chick-Fil-A holds a drumline battle  https://t.co/EBSFUqzRkt emma-barfield"
"I love Starbucks"
"RT @yashar: I love this - Burger King doing sponsored tweets of people complaining about Wendy's https://t.co/TqUR15XfKH"
"RT @meechonmars: BRING BACK MY BELOVED SPICY NUGGETS @Wendys"
"Thank you to Martha Berry McDonalds and Jim Aaron for supplying milkshakes to the AHS faculty and staff today!… https://t.co/9yuLOBKvL2"
"\"openly drinking a Lime-a-Rita at 2pm\" boy... is you good https://t.co/9kzooOXwvb"
"@BPSnow11 I’ll never understand why people like Papa Johns."
"RT @jas_renae: that dollar menu aint gross when u got $2.13 in ur bank account thats all im sayin https://t.co/oNBOkHlYrb"
"#McTober2k17 just keeps getting better and better 👌 https://t.co/J8zbF5dBqm"
"RT @HenryMakow: Poster at downtown Toronto subway station. Society has embraced decadence/Satanism. https://t.co/O0mYYbqG7s"
"At Chipotle supporting Children’s healthcare of Atlanta!! @codyhaskins2 https://t.co/oWqJdK9ByS"
"#mcdonalds is extra slow in the #lehighvalley"
"RT @tonyposnanski: Scott Baio is so mad about the Boy Scouts so he is boycotting them by not allowing them to fundraise in front of the Sub…"
"I just got a great SUBWAY offer, join their text club now 2 get ur FREE 6\" w/30oz drink purchase! Click link: https://t.co/dVRhmQkCna"
"Who trying to go to chipotle ? 🤔.. on me 😎"
"RT @NinWire: Pokémon Sun &amp; Moon toys are coming to McDonald’s Happy Meals soon. https://t.co/c5KX2TNWQP https://t.co/a4GjX4f2tb"
"I ain't eat subway in like 2 weeks, it's lit"
"Oh deer 🦌! (Sorry for the 🧀) #Arbys will soon serve #venison sandwiches nationwide 👀 &gt;&gt; https://t.co/VMYcgItdGs https://t.co/Wwd4De7uzY"
"Don't kill nature! but also lemme eat burger king at 4pm im starving https://t.co/x8WvOIizjv"
"Real love is when you know your boyfriends Taco Bell order by heart"
"RT @FatKidDeals: @OGBEARD i got you. Do you accept Chipotle giftcards?"
"RT @JayNoHoes: \"Yea lemme get uh number 5 with a large COKE” https://t.co/zJvr3zN7Bj"
"I just checked in at Little Caesars with #mPLUSPlaces Download today!  https://t.co/ULUuEGAf0X"
"RT @MiiToons: Mulan didn’t deserve any of this. \n\nHope y’all  enjoy this piece I came up with in the midst of all the chaos!… "
"Burger King tried to use influencer marketing to war on Wendy's, but Twitter's ad interface spoiled that lil party."
"RT @ArmucheeHigh: Thank you to Martha Berry McDonalds and Jim Aaron for supplying milkshakes to the AHS faculty and staff today!… "
"Douglas County Restaurant Inspections: Dunkin Donuts, Waffle House, Zaxby's, McDonald's https://t.co/imnxmn3biD"
"RT @PureMichGirl: I wonder what the “UPROAR” will consist of? Rush’s analogy: you go to McDonalds to buy a Happy Meal and have to lis… "
"#McDonalds #publicrelations #szechuan #McNugget #RickandMorty\nMcDonald's made a huge mess of a #marketing stunt\nhttps://t.co/nqhGkTZOG8"
"Forrreal https://t.co/QcPlLQ14Oy"
"@JadaPollett What do you want from subway or sonic?"
"@gimmespaghetti I mean you cant really have an opinion on that while youre stuffing your face with burger king do you see the problem"
"RT @blowticious: Y’all try to cancel Cardi at every turn but still out here eating Chipotle."
"Omg me rn https://t.co/xbuHdiXJdg"
"Lmao I can’t be fucked up wit you 😂😂😂 https://t.co/XqNcgOVR5f"
"Why people don't beat the fuck out of someone like that idk https://t.co/63b3a314ME"
"RT @nxidentity: so these two army guys walk in the starbucks im at n say dam this place dead n my first thought was just like ur homies..y…"
"Spied! Mid-Engine Corvette Prototype Caught at McDonald’s https://t.co/TF3SaP1vH0 via @motortrend"
"My team Dunkin'Donuts 🍩🍓🎈❤️🎉 https://t.co/OIbrjX7Ktf"
"Good🤷🏽‍♀️ https://t.co/h8VW1dGkXE"
"Luke Wolverton Princess Nokia Reveals She Threw Soup On Racist Subway Rider In Viral Video https://t.co/t3YW7AEj4B"
"Haha... yeah! Wendy’s you suck where are the spicy nuggets\n\n(Patiently waits for Burger King to promote this tweet)"
"Have any of y'all tried Chipotle's queso yet? I'm a little concerned that I haven't heard anything about it, good or bad."
"RT @UglyBoyLD: Yo WCW said she will never work at mcdonalds. She got 6 children and finna be evicted from her cardboard box. She 27"
"Only one pickle , and on top...?? @ Dairy Queen https://t.co/1iMpdgmqpv"
"Peach chipotle wings https://t.co/jpMeqA77Cs"
"@CPatrickWalsh so caught up in their phones they occasionally even leave their frontman in a random mcdonalds"
"This is news. I thought he was a Big Mac guy. https://t.co/JorKWVt5na"
"@Wheeler_High: Come by our tent Friday Night before the game to enter for your chance to kick a field goal for FREE… https://t.co/U0jGLs6IoV"
"RT @bornflawless: can’t see myself eating Pizza Hut ever again in life"
"Quesadillas and Chipotle Ranch are a must try. Trust us, you need this deliciousness in your life. 📷 :… https://t.co/9D7gomcYvI"
"@fastbreakbreak who is the person who said they like checkers better than cookout why do you talk to them"
"Just made eye contact with a Burger King employee in the back of the room while in the drive thru. That was very intense"
"He pick up line is his face. Anything after that is glaze on the Krispy Kreme donut. https://t.co/jpbcfphqvC"
"@bclifton6170 Shit we going to taco bell or something"
"RT @AsiaChloeBrown: In the Walmart nail shop, Walmart optometry, Walmart hair salon, Walmart Subway or McDonald’s, in layaway, the bath… "
"RT @CruzanChoklate: The best one is them standing by the registers watching the Long ass lines. https://t.co/5CcBmHBe0S"
"@Wendys I would like a case of your hot chili seasoning. Will that be a manager’s discretion? How much would it cost me?"
"Would kill for a Pizza Hut cheese pizza or Which Wich 😫"
"RT @BurgerKing: @RichieIsEvol @Wendys we resurrected the spice. 10-piece spicy nuggets are here at BK starting 10/12 for $1.49."
"RT @EveSkeptic: Tonight on #VirtualSkeptics, maybe the diplomats at the US embassy in Havana are just sick of Sonic Drive-In commercials."
"RT @K1NGR1ZZY: @BurgerKing Girlfriend: I wonder if he’s thinking what I’m thinking. \n\nBoyfriend: I still can’t believe @Wendys doe… "
"Rapper takes credit for dumping hot soup on racist subway rider: https://t.co/GHfXzIRsRN\n\nGood! Stay strong Chickie Poo. Love you 😘"
"So nice to see people of all races standing up to this piece of shit. United together, shoved his ass on the ground… https://t.co/H3moplVM7V"
"RT @Mumbology: Ok folk's this one is for all the marbles... When you eat a Meal from Mcdonald's/Burger King/What have you, what order do yo…"
"RT @JeffersonObama: I'm seriously hoping this girl at Starbucks preparing my Americano could rap Eminem's catchy Trump diatribe!?"
"RT @SuperiorArtemis: @RichieIsEvol @BurgerKing @Wendys Why the fucking is Burger King promoting this?\nThey paid for this https://t.co/JhcGW…"
"😂😂 I’m saying. https://t.co/wNcgoAvZWs"
"When you say “jalapeños” at Subway https://t.co/DnF18JvxKu"
"RT @KobeJordanJabar: What y’all know about Inuyasha https://t.co/OdsEWMivAE"
"MY WARRIOR GODDESS @princess nokia ///// Princess Nokia Throws Hot Soup at Subway Racist: Video https://t.co/0VKwZC4jPp via @pitchfork"
"RT @LILBATRI: might fuck around and buy happy meals all month https://t.co/nrW9DrOVpC"
"Just swiped a $10 gift card from Chick-fil-A 🤗😊"
"@NovemberBrav0 It gets bike lane and Starbucks white really fast"
"Show at StarBucks Sandy Plains\nSee J.A. Etchison at StarBucks Sandy Plains on October 28th. https://t.co/3icoHym6pi"
"RT @scott2h2o: why can't Panera Bread be a 24 hour thing?"
"RT @Ludaliciousness: Days when misery and stress were at an all time low https://t.co/nVCLVi7kcE"
"\"A woman threw soup at him\" was my favorite part https://t.co/GEfXJwMZDI"
"RT @jmsker: Great to see #TTC new bike storage @yorkuniversity station in use! #Line1 extension #TYSSE #subway @TTCStuart https://t.co/9wSx…"
"Chick-fil-A wants to know...which team has the most spirit - Northside High School or Hardaway High School? The... https://t.co/tVqUFMnXFI"
"Wisdom tooth out and all I want to eat is what I can't eat. Anybody got some chick-fil-A flavored soup"
"J.A. Etchison has a show on 10/28/2017 at 07:00 PM @ StarBucks Sandy Plains in Marietta, GA  #concert https://t.co/3icoHym6pi"
"@its_sydneybrown @morgantaylorrr1 @EHSNerfWars1 \"i'm going to mcdonalds after practice and getting some nuggets\"😂😂"
"@schamuel @Starbucks That's impossible because I wasn't there"
"RT @GirlThatsKembe: Dove and Chick-fil-A going just have to call me a nigger to my face 🤷🏾‍♂️🤷🏾‍♂️😭"
"Cuz I'm too faithful https://t.co/gCAiUBMPhc"
"Omg story of my life just not Taco Bell https://t.co/tATfNLlQDF"
"@PsyQo_Ved Eating pizza fam @dominos https://t.co/ZRsLFwDfpc"
"Hey @SebastianComedy Coca Cola in the see-thru glass. Glad it wasn't at Chipotle. https://t.co/g7YoFPUgZ2"
"@swaggyash369 jimmy johns in augusta is hiring &amp; they start at $7.25, but i made it to $8 an hour within the first month!!!"
"When your lil brother is just so excited to hang out with big sister @SashaJ_Diva random #McDonalds #everyday people https://t.co/CFrpYWB13l"
"BuzzFeed: Forever 21 thought outside the bun and launched a collab with Taco Bell \nhttps://t.co/T2Sxfyq0Nx https://t.co/yFN3IUc6Yb"
"@anmzg Same for me with sugar craving &amp; hot Krispy Kreme Doughnuts!"
"When there's Chick-Fil-A in the newsroom.. https://t.co/9yLF443PPT"
"I just found out @McDonalds no longer sells Hi-C Orange soda :("
"RT @BAC_UGA: In one hour! We look forward to seeing you all! Heard there was Papa Johns too 👀 https://t.co/svUHAYNCQB"
"@Mikoooouu Hey did that subway coupon work 👀😂"
"@6321Three5 @Blavity @McDonalds It is actually a good article tho that could give young ppl a better perspective on dead end jobs."
"RT @chrissyteigen: It's in the first one dammit jorden https://t.co/E08E7KagZW"
"RT @Mr_Han_SoloDolo: Forever 21 came out with a Taco Bell inspired line of clothes for guys and girls. 🔥 https://t.co/l9VqXX2FnP"
"ON GOD https://t.co/ops5xsvwJT"
"🎶 rassilonwatchathon: Episode 65: The Three Doctors (The Time Lords’ Taco Bell) Toni and Joe are joined... https://t.co/FcGWH0M7mB"
"@TheFixerESQ @MarkArum @johnnykielbasa I can't wait. I wonder how much it'll cost. 4? Maybe 5 bucks? @Arbys https://t.co/FSqwOjsv0s"
"RT @ExPlaceTO: The main flag at #ExPlaceTO is at half-mast in honour of Tom Dedes, TTC subway track maintenance employee who passe… "
"Air Jordan 12 “Bordeaux“ is now available on @stadiumgoods for RETAIL + SHIPPING —&gt; https://t.co/AD7Bcwzzit\n\nTry co… https://t.co/gAXOimCFbc"
"RT @SnkrDropsWW: Air Jordan 12 “Bordeaux“ is now available on @stadiumgoods for RETAIL + SHIPPING —&gt; https://t.co/AD7Bcwzzit\n\nTry co… "
"RT @Wendys: We know why the chicken crossed the road\nBut you crossed the boss and straight got told\n\nWe had some fun, but yeah… "
"CAIRO NEEDS A WHATABURGER."
"@MyTweetsTrash Maybe next time you should skip out on chick-fil-a because they're shit is trash"
"I don’t know how to feel https://t.co/kzcxvoamSI"
"RT @mo_amoree: What Chick-Fil-A do? https://t.co/LwOp09Fd34"
"I literally ate subway all this week 🤷🏾‍♀️😍"
"I like Chick-fil-A sauce more than I like most people."
"@LiaPicard I also love the lettuce wrap at Jimmy Johns! They wrap it so tight - like a great burrito. And they deliver for freeeeeee 😍😍😍"
"ONLY $171 + FREE SHIPPING w/ code “KFC” at checkout https://t.co/WjuBo4gEvZ"
"RT @apurposefulwife: This is unreal! 😮 https://t.co/GPoIzlH18t"
"RT @QueenChanteee: * eats chicken sandwiches * \n\nperson: YOU KNOW CHICK-FIL-A IS RACIST! \n\nMe: oh forreal? Damn thats crazy\n\n*dips in polyn…"
"bitch fuck me up https://t.co/TtIE4LaaYg"
"RT @HuevosDeChivo: Harvey Weinstein is now to Hollywood and the Democrats what Jared Folgle is to Subway:  \nA Permanent 💩-Stain!… "
"Check out @subway Share the Color Event Giveaway @mommybknowsbest https://t.co/GhKQornUzm #giveaway #spon #charlotte https://t.co/iwmZBqaDU7"
"@Starbucks I got an email about Starbucks Bingo but when I click to join, it says the offer was meant for someone else :( How can I fix it?"
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"That’s what I like to see! Black fucking power,finally we get to kick instead of being kicked🤷🏾‍♀️ https://t.co/QyNHwNuw5j"
"@Kathbum there’s a taco bell coming to glasgow, we should hit it up before ur show x"
"Missed my subway stop and ended up in Brooklyn. Had to happen eventually.\n😕 (@ MTA Subway - DeKalb Ave (B/Q/R)) https://t.co/zowfuE7kB0"
"I have never once seen a Dominos pizza look anything like this https://t.co/nrkW7y0bCI"
"Don’t know if I want Pizza Hut or Subway"
"RT @pumpkinxpatch: him: yeah, I love taco bell \n\nme: https://t.co/gP6sR6BRkA"
"NFL reports Top NFLfantasy performers from Week 5! (pres. by kfc) https://t.co/MSxxpuhB7z"
"I took a thrifting break to do some writing. I churned out 1,800 words after midnight last night. #amwriting #wip… https://t.co/aXjzoBfmCo"
"RT @RebeccaJarvis: Starbucks Howard Schultz: Cutting the corporate tax rate would be 'a mistake' https://t.co/fiAk4aKAKH"
"RT @misskat_rina: Agreet https://t.co/BWYovWTjDP"
"Panda Express is garbage"
"“We’re playing chess, not checkers.” @LeanAgility \n\n#BRM Cafe Podcast at #BRMConnect @LTP_Consulting https://t.co/VIDerGBKZR"
"10.11.17 @ Chick-fil-A of Clayton, GA https://t.co/rngPtmRweH"
"RT @WhoIsHeReally: Happy born day to the homie @LordDerrick hope you get everything you want bro. A clingy Bambii with Chick-fil-A 😂. Stay…"
"#reup (@ Taco Bell / Long John Silvers in Acworth, GA) https://t.co/ORfdPX3rA5"
"#CityNewsToronto 👉 37-year-old woman accused of abusing a dog aboard a TTC subway in August appears in court … https://t.co/EMoLZOL2Wh"
"RT @Diamonndddd_: She's only ONE YEARS OLD TRYING TO ORDER MCDONALDS https://t.co/uDvWuWQS2T"
"Serious gang activity - @McDonalds  Police: Man arrested after putting soda in water cup https://t.co/toD5mXaSsS via @abc11_wtvd"
"@wingstop won against @Wendys in that rap battle now wendys done took they spicy nuggets off the menu 😂👀"
"RT @ClickHole: Still Human: 5 Times Nelson Mandela Got Stuck On The Roof Of A Pizza Hut https://t.co/Y1NlmjtPgm https://t.co/xdgeTqfK04"
"It’s a @starbucks working type of evening #coffee #starbucks #working https://t.co/uCrbxDQLFR"
"Y’all out here telling black women to settle and be lucky cause a nigga offering them McDonalds?"
"Pizza Hut Just Added Something To Its Pizza Offerings That's Going To Be Very Hot: https://t.co/WcjHzKVhBU https://t.co/mkMW9gT3ND"
"RT @DontCallMeCorey: @BurgerKing @RichieIsEvol @Wendys Your nuggets are nothing compared to Wendy’s nuggets how dare you try and compare"
"RT @vadreamcatcher: Why the Chipotle hype? Moe's has more topping options, gives free chips, &amp; tastes better. It's like iphone vs android.…"
"RT @itsZACJENKINS: him: get out of my house. we are done\n\nme: *leaves*\n\nhim: *calls 4mins later* babe im sorry where u at\n\nme: https://t.co…"
"I heard this guy is doing Fourth meal at Taco bell... What? Oh. Fortnite. My bad.\n\nGo hangout my dudes. https://t.co/tNZEF3ynmR"
"I want a whole papa Johns pizza 😩"
"RT @SneakerShouts: Dropped Early! \n\nAir Jordan 12 Retro \"Bordeaux\" for only $171 (Retail $190) + FREE shipping with code \"KFC\" -&gt;… "
"i want a taco salad from wendys. 😶"
"RT @LimitedRunGames: Our physical release of Skullgirls on PS4 has arrived! @Skullgirls @Arbys https://t.co/gZ5J5PZERA"
"RT @captaintrash: remember on coming out day that LGBTQIA stands for Lets Go Buy Taco (Bell) Quesadillas, It's A (good meal)"
"@RetroBerner @FoxNews @POTUS bernie lost bub. time to stop living in the past and respect our leader. you still hav… https://t.co/KTvnYfeE9c"
"I checked in at Subway on #Yelp https://t.co/bVKywWbf8P"
"Get these subway promoted ads off my timeline"
"Damn..... @JulieannaSewell https://t.co/NbRG5HRO9b"
"RT @Hardees: If a burger needs anything but meat and fire, it's not our kind of burger. https://t.co/rPabUrJ1TT"
"PDA on the subway is probably my least favorite type of PDA"
"RT @rollieghost: i know a Vegan who get they food from Wal mart. i told shorty she better off eating a jr bacon cheeseburger from wendys"
"She is the entire world I love her so much 😍 https://t.co/Y7GDYF8JlO"
"#fail @mcdonalds People, including us, were completely ignored. Not a word. We all walked out. Douglasville location. Sorry service. 😠"
"@Beastlychuk I like to eat my Taco Bell not wear it!"
"chipotle sounds good"
"RT @IVPvideos: If Burger King employees invaded outside of the McDonalds I worked at,and I went out and took a pic with them and tweeted it…"
"see u tomorrow BK!!!😍 https://t.co/4igcva2WJC"
"RT @yerpalmildsauce: PENNYWISE: Taco Bell never stopped serving the chili-cheese burrito down here.\nME: https://t.co/s3fJT6RESN"
"I'm looking at the most gorgeous girl in a Burger King"
"Is it bad that I really want some of the forever 21 Taco Bell collection... 😅😂"
"Setting: subway and im sitting in the floor \nMe: why cant anything… https://t.co/cb6KYh8pkT"
"RT @daniecal: Sometimes I just have cravings for trash. Like Jimmy John's or Hamburger Helper , or Taco Bell 😔"
"RT @JedStruts: What're you saying JT? @LittleMix https://t.co/8WgcTzPkUS"
"Who really got the best cookies @SUBWAY  or @McDonalds 🤔 #themcookies #forrealtho #cookies #food #ineedanswers"
"#NowPlaying Unknown - KFC Radio Spot Unknown"
"RT @RealLifeKaz: Pusha T writing the McDonalds jingle always gets me https://t.co/Ck5IBXf1tq"
"RT @LoCuStudios: $5 Footlongs at subway been dead BUT it's $5 ALL NIGHT #Killuminati SLIDE!! https://t.co/lMV5r3KnyO"
"@OutofPrintTees @modcloth @thinkgeek @Starbucks @SimplySouthernT @littlecaesars @buyolympia @target omg..  I've become spammy 😱😢😰"
"RT @LordeDaily: Lorde getting some McDonalds in Munich https://t.co/4UqC4mclaY"
"RT @USFreedomArmy: Perhaps the CEO of Starbucks needs to get out of politics. Enlist at https://t.co/oSPeY3QMpH. Our patriot recruitin… "
"Just saw a Krystal’s commercial for the first time...."
"RT @BuzzFeed: Forever 21 thought outside the bun and launched a collab with Taco Bell \nhttps://t.co/gDwuaCeZA1 https://t.co/Cb63ddrtJr"
"I'm here in chipotle O.J Simpsoning a bowl..and so I look next to me and this guys is just staring and says\"wow that's a girl that can eat\""
"RT @allanimalrights: Please take part in our new POLL then RT it TY:  https://t.co/Fbd5cua9gY\n#vegan #govegan #vegetarian #animalrights… "
"RT @YaBoyMitchellB: Burger King shows no mercy https://t.co/Eui3UOvCOY"
"RT @homegworl: I have a subway bread knife but that was because they left it in my sandwich. https://t.co/bKZdaHq2dH"
"Yoooooooooo papa johns on the titties https://t.co/x4rg2K1F1U"
"Lmfaooo this guh told this boy she went to Dairy Queen to get a blizzard because she blizzard 😂😂😂"
"@abrigg @WallyAction I love fried chicken, but KFC leaves my puking. Just a mouthful of hot grease. No flavor! Thin… https://t.co/W2AlnV0Zp2"
"RT @myjoe_: Buy one free one Starbucks promo til 12 Oct 2017 (with Mobile App). \n\n#PromoJoeMY https://t.co/K6pEJJk2E0"
"RT @CELEGlRl: you guys have no schezwan sauce? no- i want schezwan sauce! \nwhere's! my! schezwan! sauce! im PICKLE RICKKKKK, WUBB… "
"RT @nigglysaurus: You brought her subway. You deserved this https://t.co/0wEbQyfZyV"
"RT @ChipotleTweets: @JLsPerspective Tweet back and forth with my people. All of our meat fits our Food With Integrity standards: https://t.…"
"Think I want Chipotle."
"Tonight the cashier at @Wendys told me I have a lovely voice. Guess that \"customer service voice\" was in full effect! 😂"
"Shut up goose https://t.co/qSkNrqjRfk"
"Here’s the real reason why Chick-fil-A is closed on Sundays https://t.co/WjUV5yjBTP https://t.co/JAZxYGsqKd"
"the turkey sub that subway keeps promoting looks so @$$"
"RT @bobinglis: Changing minds starts with opening minds, and overcoming disrespect is what starts the opening. Tangier teaches!  https://t.…"
"KFC Open Interviews Wednesdays &amp; Thursdays 3-5 PM! Multiple Locations! #Atlanta #Jobs https://t.co/H35XD3JgzZ"
"I really want a steak but then again I want chipotle"
"Lol aye man the one on the right hot 😂 https://t.co/KTbNZSm5Dp"
"RT @Ashncoll: I haven't even tried Chipotle's new queso because Chipotle is known for 2 things: Causing diarrhea and being inferior to Moe'…"
"RT @sassygayrepub: Please always ask your parents for financial advice or what they could've  done better. Stop wasting your money on… "
"RT @WSAVRexC: WATCH: Another Subway Top Performer is @NEWHAMPSTEADFB @3lite_J3rry @KDSportsReport @jaudonsports… "
"@Arbys lemme be your fry &amp; Shake spokespersons https://t.co/25o32xoazC"
"RT @danguterman: .@mcdonalds @gop heads up, we're gonna have rick yell about birth control in season 4, start stocking up now"
"@KatyTurNBC I once sat hung over on a Sunday morning at a taco Bell eating while \"Had a bad day\" BLARED.\n\n#simplertimes"
"RT @BieberBonerz: My mom won't even buy me McDonalds https://t.co/PcTP5rozbK"
"RT @TheCubicleChick: Cheese lovers unite! National Cheese Curd Day is 10/15. Read how to celebrate at @culvers! https://t.co/U7dZGgxAPs #Ch…"
"I've been eating subway everyday 🤦🏾‍♀️"
"Just so everyone knows #jolirestudios is teaming up with #starbucks for donations to #puertorico bring donation $10 OFF any service"
"RT @365DaysofBaking: #ad Celebrate National #CheeseCurdDay by visiting @culvers with a friend and you could get some Cheese Curds FREE!… "
"This is any hair service by #jolirestudios donations will go straight to #starbucks relief campaign"
"RT @IcySoleOnline: Retro Air Jordan 12 ‘BORDEAUX’ available EARLY for only $171 shipped with code KFC\nLINK:https://t.co/fGzwmoWZOC https://…"
"@pizzahut the Pizza Hut on Bolton Rd is refusing to answer their phone and we ordered over 1 and 1/2 hours ago! Help!"
"News_CUInsight-&gt;\n\nData is the secret sauce for dominos pizza… and #creditunions :: https://t.co/0uLjwI6naf COOPFS https://t.co/GikTnCltr4…"
"WOW @BurgerKing is on a SAVAGE tip rn, @Wendys just got served https://t.co/6feCa3rYX0"
"That Hardees $5 all-star meal box thingy is by far the best $5 deal out there."
"Deer meat sandwiches return to Arby’s locations nationwide https://t.co/FWMEFZOY4z"
"RT @notalogin: Friend [dying]: I don't think I'm gonna make it\nMe [thinking about how tomorrow is 2-for-1 day at Dunkin Donuts]: I'm not le…"
"RT @_damnhoe: nope. i love their crunchy tacos. https://t.co/O3TgdUnyoH"
"RT @jessismiles__: The barista at Starbucks actually thought I was Jennifer Lawrence so I guess today won't be so shitty after all"
"RT @CroweYvette: @DebiMcNeal Thank you to McDonalds for presenting at the RHHS Career Fair #BTH #WeareRH #rhhscareerfair17 https://t.co/2jH…"
"Not saying I agree w what he is saying but he has freedom of speech and I hope he presses charges on each one of th… https://t.co/f5iISuNUwd"
"I need a Dunkin' Donuts strawberry tropical smoothie daily. Shit too fye"
"@ShaunaJ1776 @ncarolinapirate @benshapiro Google “Krispy Kreme near Ben Shapiro”"
"I could really love a blue raspberry freeze from Taco Bell but I live to far out and to broke for that🤦🏼‍♀️"
"@Deposco @LookFar_Ideas Thank you @Deposco. I enjoyed leading the RFP and setting the ground work for the implement… https://t.co/aGGoUIwaY9"
"Dove not racist people are just sensitive https://t.co/5bi2MszMcH"
"This song they’re playing at Zaxby’s is called “You Had Me at Jesus” LMFAAAOO"
"What’s NEW At Disney’s Hollywood Studios: Grand Avenue, New Starbucks Mugs, Coco Cupcakes, and MORE https://t.co/apMAIMcQHx"
"@YasmineReneXo Like real shit I’m frugal asf with money like I don’t waste it on nothing. No big purchases NOTHINNN… https://t.co/Yt93kXpv40"
"Me every time I get Tacobell https://t.co/2XVXvcnse4"
"one like and i'll get chipotle for dinner"
"RT @CFAEastLake: @Wheeler_High: Come by our tent Friday Night before the game to enter for a chance to kick a field goal for FREE Ch… "
"They also be like dont eat McDonalds but finsih more bottles of henny in a month then they do water https://t.co/Bjku7DptcD"
"Can you recommend anyone for this #job? Restaurant Manager-Panera Bread - https://t.co/QdmwIvZK8L #Hospitality #StatenIsland, NY #Hiring"
"RT @steenfox: If I wanted fake beef, I'd go to McDonalds. https://t.co/JgwnENt94D"
"papa johns https://t.co/LzN1dkEdGF"
"Inc: Pizza Hut Just Added Something To Its Pizza Offerings That's Sure To Become Hot ChrisMatyszczyk https://t.co/3sGa0P3lkV"
"@CamStuartSmith @McDonalds That's mickie ds for ya"
"PANDA EXPRESS OPEN NEXT WEEk!!!! IM TOO FUCKING EXCITED! OMFG!😩😩😩💕💕💕"
"aint have burger king in a minute 🤔"
"HOW SHE THREW HER SOUP AT HIM LMAOO I LOVE THIS SONG https://t.co/CMFwy0ekgJ"
"RT @PkTHUNDER_: @pizzahut need this pizza hut. pizza. pizza. https://t.co/H2QigAFyyS"
"@ColeLedford11 @BurgerKing @Wendys That happened almost years ago in the south. Talk about pissed."
"RT @AVATARCM0NEY_: Nigga when did Chick-Fil-A get this fancy??? https://t.co/Bty5iie74k"
"This take, it is bad. https://t.co/HqlNn42h3m"
"You playing checkers this is chest and Hakeem is lit!!! #Empire"
"RT @xavierlur: Only $12 for 12 Krispy Kreme Original Glazed doughnuts on 12 Oct (Thurs) at all Krispy Kreme outlets!!! https://t.co/02bMk5V…"
"Ok, so the overall consensus is that @Chipotle's queso is muy wack. Trying to understand how they dropped the ball with this."
"RT @amomontheside: Get ready for National #CheeseCurdDay at @culvers with the chance to WIN FREE cheese curds! 🧀😍 #ad… "
"Old Food Debris, Dirty Ice Machine: Douglas County McDonalds Fails Inspection https://t.co/ZdEyG0QnF4"
"@Whataburger Oh Whataburger my Whataburger!  I luv you so. Can't wait to get back to Houston!"
"\"Man look ... just listen .... Uhhh ... hear me out...Burger King has some fire ass chicken nuggets. \" https://t.co/6C9emlMLZN"
"And now I want some Burger King chicken nuggets. Fuck"
"RT @mrmedina: Dominos &gt; Papa Johns, Pizza Hut, Little Caesars\n\nGlad we settled that."
"WTF are they thinking over at @Arbys 😕 https://t.co/FfrvzLzNbw"
"RT @Akil_SNRS: Chipotle https://t.co/OSVSIpd6gE"
"RT @Natire2u: #CA Hepatitis A:\n#Diseases of Refugees &amp; #Illegals►https://t.co/IGlcPkGWPQ\nTB at #Starbucks?►https://t.co/8fBeQNkZZh https://…"
"RT @SMOKEDOUTOG: I've seen raider klan when they did there first tour and I met purrp in mcdonalds randomly after the concert 😂😂💯"
"Bet the ice cream machine is still broke https://t.co/vujsG1zuO7"
"I would cry https://t.co/LeggbEc5Vg"
"“promoted by Burger King” https://t.co/CwAvzFXoeR"
"Major food chains are trash anyway. I only eat at local mom &amp; pop spots. https://t.co/yKkGrbYtOa"
"Arby's venison sandwich available nationwide this year 🦌😳https://t.co/lnYSri5O3k"
"Hey, @Wendys I'm at Dairy Queen and I'm having a hard time picking what to eat. What should I get?"
"RT @CptnClout: The way my bank account looking rn, Taco Bell too good for me. https://t.co/5zVEUMBScf"
"\"Hold on swiper\" 😂😂😂😂😂😂😂 https://t.co/BOAe5NYQ3n"
"RT @sophiemturcotte: Amazing https://t.co/03iKWRSrYm"
"@HungryCody @BurgerKing @Wendys @ColeLedford11 it's insane right"
"How much can I put on this  and what my credit score do I need? https://t.co/C5wACDhgfZ"
"I gotta taste for Papa Johns"
"Tips &amp; tricks for installing #marble subway #tile: https://t.co/46M6W2LZhO #diy"
"Sea-view subway completes 6-day test runs in Xiamen, a coastal city in SE #China's Fujian Province https://t.co/s458Rryhu2 CGTNOfficial"
"RT @YourGfAdmireMe: I love a nigga that take his time instead of 2 kisses n now your dick out😂😂 like holdon swiper put jack back in the fuc…"
"RT @KazeemComedy: If you work for @Whataburger, you're an American hero. https://t.co/pKo7v1p8VW"
"@WORLDSTAR Subway stop talking"
"@ChrisdyannUribe @Whataburger Stuck in GA can't wait to visit TX and try!"
"Police Looking For Man Who Pleasured Himself At Florida Panera Bread https://t.co/s05jriOaAg"
"RT @Alexy_strong_: ehhh not too good I just prefer real tacos, I gotta be real desperate nd highhhh to eat taco bell😭 https://t.co/5IJPbyuX…"
"RT @BopMisha: Nope. Never too good for Taco Bell. https://t.co/qp1VXqoghm"
"RT @FxckThisShxt8: Hell no https://t.co/3ykKBQ3cGq"
"is it bad that i think some clothes from the taco bell line at forever 21 are cute"
"What kind of question?  Subway https://t.co/rSMvtfFpJr"
"RT @55mmbae: Way too good https://t.co/YB0fKrgmeF"
"I need some large fries and a large strawberry milkshake from checkers RN"
"Subway and it’s not even close https://t.co/IKmS7tTEY9"
"subway and if you disagree i don’t fw you https://t.co/6XC1LI97Nu"
"@Bsutton55 @Wendys Fuck ya B"
"RT @ScotLouie: That audience was accurate. If I saw them outfits/ heard that remix I would've been down to the Chipotle until it w… "
"RT @transgirlsonic: you guys have no schezwan sauce? no- i want schezwan sauce! \nwhere's! my! schezwan! sauce! im PICKLE RICKKKKK, WUBB… "
"@CoachWilliams43 @WORLDSTAR @Negrodamus2121 @leeweatherholt @powderhokie Shit. Them Fresh ass cookies from McDonalds in that 10 pack tho"
"Irony is eating White Castle cheeseburgers and cookies at 9:00 pm the same night you buy your neighbor’s treadmill."
"I want some subway or Taco Bell... 😩😭"
"RT @officerjeon: \"yes this is mcdonalds how can i take your fuckin order\" https://t.co/lJjSWbjbea"
"\"sorry, our fukin concert ticket machine broke\" https://t.co/lb2AZwnZUK"
"I eat way too much chipotle"
"Actress arrested for trying to push random woman off subway platform https://t.co/oY4aJAez4O via @nypmetro #KeiraKeeley"
"RT @jedmcfarlane: beautifully done https://t.co/EFyp3pDHEG"
"RT @colleenwalden_: Highly recommend making Chick-fil-A pizza https://t.co/deWiLzfJyF"
"RT @idoughnutcareee: How to make wendys mango peach chiller @ home https://t.co/jTohqDUmnj"
"#ILookAtTheWorld Through a Starbucks cup of pumpkin spice ."
"RT @espn: It doesn't get much better than this!\n\nVote for the winner of this week's @Wendys #RivalryBeef matchup below:   https://t.co/BcXe…"
"RT @Gaines11k: all i want is Chick-fil-A breakfast 😩"
"Whataburger and Whataburger https://t.co/oj9Te2tirT"
"idk 😩 i feel disgusted to be apart of this https://t.co/71GGAUet1q"
"this is the best thing I've seen all day I'm literally in a good mood bc of this. https://t.co/J6qzmAbMUh"
"That hair pulling is some weak shit. Krystal needed fade that hoe.  #Dynasty"
"Papa Johns taste like cardboard"
"@HJBenjamin @mradamscott Can they be paper towels that I already used to wipe this 7 layer burrito shit from Taco Bell?"
"RT @HoodJesusYo: Live by the 5 C’s and you’ll be alright:\n\n1. Christ \n2. Coffee \n3. Chick-Fil-A \n4. Chipotle \n5. Canes"
"My love for Taco Bell is something serious 🌮🔔 One of the many reasons I will never be skinny. Don't even care though."
"I WOULD FREAKING CRY!! https://t.co/MU02Y3i98T"
"RT @paivathewayCTV: #RedWings fan from Windsor finds out he is not banned for throwing octopus onto the ice at Little Caesars Arena https:/…"
"RT @_richardvazquez: Man I love Starbucks"
"RT @flyazzcaddy: hell yea I ain’t. https://t.co/PW41iIBaTj"
"RT @SayyCheesey: I’m going to always be “too good” for anything that will give me diarrhea https://t.co/wBEhsgSxMR"
"RT @lilyakamein: Love yourself https://t.co/xqXVAK69tc"
"RT @__WhoIsShe: Too sober https://t.co/wgO5N9dq4b"
"RT @_BriaPlease: While sober? Yes. https://t.co/bpAtPNcKsL"
"RT @delstateking: Nope RT @HELLonDAscale: Y’all too good for Taco Bell ?"
"RT @Jaroc93: I eat it every now and then https://t.co/FSFBv7ZNy8"
"Damn dude did you beasted those Chipotle toilets? https://t.co/YiO0if4FcB"
"Waiting on Moms!!! #Airport #SouthWestAirLines #ATL #Starbucks #HartsfieldInternational @… https://t.co/W9uSdGykqX"
"I watched the @Wendys training video 👀 Why can't you ever get enough ice in sweet teas? It says \"top of the cup\"… https://t.co/sjrsUc2M9F"
"Truth https://t.co/58oho5JEGh"
"I'm not watching Trump on Hannity, but based of the exploding heads of the fact checkers I follow, I assume it's cool to skip this one."
"The Starbucks lady saw me come in for some coffee for a whole week stressed asf and gave one to me for free today to make me happy😩❤️"
"RT @MartyMarrr__: This ain’t even a Papa Johns pizza, she should be ashamed . https://t.co/lPufAUBjTf"
"RT @mrdaddymanphd: at cicis pizza with my boy and the only way i'm leaving the all you can eat buffet is in a god dam ambulance"
"@itsmaryk @BurgerKing @Wendys I've seen multiple promoted tweets from them, re: the disappearance of spicy nugs"
"@princesssdmy Just had taco bell https://t.co/Sci5B69Gm3"
"RT @ChVckEatsAhh: Nah thats used to be my go to for munchies https://t.co/eVq865vlS4"
"*googles how many pounds of potatoes are produced in the US    p/yr* ...42.7 billion pounds https://t.co/MQGCx2FBXS"
"SUBWAY https://t.co/dNXvw7a3Pa"
"Benefit concert in memory of Macy Purvis, the officer killed in the Taco Bell  crash in Swainsboro. https://t.co/kT3UsJeIRp"
"Never EVER go to a Whataburger outside of Texas.. Florida is trash"
"RT @babycaitttt: truly https://t.co/9wKIRgSkFw"
"when did subway get ice cream???"
"RT @Jay_Piff: 2013 me wasn't. wouldn't touch that shit now https://t.co/gwXBjGv47T"
"RT @mjw_20: SUBWAY https://t.co/dNXvw7a3Pa"
"RT @DoloRickFlair: Y’all did good but im sorry but I would’ve been slapping bro around like he was a bitch https://t.co/VbArjuaj94"
"@Staraptorite god if there was a taco bell nearby i would nut"
"@sqiouyilu I thought you were about to say smoke weed\n\nfic idea: hanzo and mcree get stoned and go to white castle"
"RT @kamgriffin13: Accidentally said 'fuck' to a worker at Chick-fil-A today and I think that topped every sin I've ever committed."
"@SLMG_NIC I love chipotle too babe"
"RT @carterjwm: Yo @Wendys how many retweets for a year of free chicken nuggets?"
"RT @itsCheesi: riding past Krispy Kreme when the hot sign is on, is not the kind of activity i entertain."
"Hey @safiyajn!! I vote you wear Taco Bell fashion for a week. https://t.co/BBzTwbe9DO?"
"Retweeted Krystal (@SunnySweetDays):\n\nYour pup is going to LOVE this! 🐾 https://t.co/Kyz2MdJuqN #AD https://t.co/qmWhAkUOJU"
"RT @ParrKelsey: Subway is wayyyy better than Jimmy Johns"
"Everything at McDonald’s is gross, but I’m not finna let you come for their cookies. you’re TRIPPING https://t.co/olS4Ua3FDf"
"RT @KimBhasin: Behold, the Taco Bell x Forever 21 fashion collection. https://t.co/kE6SAPV7ho https://t.co/bkIabsfRTe"
"Subway all day https://t.co/6cQrdfhb0t"
"Sometimes I wish I didn't know all I know about food and health so I could just eat Taco Bell with no remorse."
"RT @WaynePerry_: Wendys 4 for 4 #Filayyyy 😂 https://t.co/ooHGeNl0Db"
"@bretanaj I love you dearly but both statements are incorrect and blasphemous.... Everything at McDonald's is great… https://t.co/wUupB7Gbq9"
"RT @_____niquenique: subway https://t.co/a2D3tm1TV0"
"RT @GreenEyezX_x: My alcoholic ass immediately thought of what liquor I’d mix with this. 🤔 https://t.co/qjjMlD75yt"
"GIVEAWAY - Enter to win a $15 Starbucks gift card! Easy entry &amp; open worldwide! #win @ahelicoptermom  https://t.co/CSgSHPNbw3"
"Was literally the only thing I ate there. https://t.co/nXVJVD4RGR"
"#Indiana man accused of impersonating officer to get free Taco Bell\n\nMore on this odd story &gt;&gt;&gt;… https://t.co/ts7pBNY2st"
