"NYC is:  sitting on the subway, just trying to get home, as the man next to you rests his head on your shoulder"
"@elfundacion TACO BELL MADE A FRIED CHICKEN SKIN CHALUPA NOT SURE IF IT WAS AVAILABLE HERE THOUGH"
"RT @TheOneLadyEagle: NFL Logo No Longer Shown On NFL Sponsor Papa John's Website https://t.co/IjMz2SRXiq via @JonathanTurley"
"The CEO of Panera just called out and challenged the CEO of McDonald's to eat his own Happy Meals for a week.  https://t.co/AeEWil4aUm"
"RT @Lin_Manuel: Good morning.\nI believe in you.\nNot always in our leaders, not always in the subway schedules, \nbut always in you.\nYou, unw…"
"RT @tweetpromo17: Buy 1 Free 1 from Starbucks\nLets grab it now 😋 https://t.co/PZmNA8PZJN"
"NOT CARLS JR! ANYTHING BUT HIM!"
"There must be something in the coffee...😁\n#Starbucks #NuttyAlmondMilkLatte #CaramelPudding… https://t.co/CVv1sJBO8S"
"#PacDigitalSigns Pizza Hut Made a Heat-Insulated Parka Out of Delivery Pouches to Keep You Warm All Winter https://t.co/vWY3lWTcRy"
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"Ok but have y’all had KFC cookies? Dat shit hits"
"RT @Tanuanai: Ok but have y’all had KFC cookies? Dat shit hits"
"This bitch at Starbucks finished smoking and didn't even mind putting some cologne or chew some gum, he stinks likkeeee deadass."
"I got a lot of respect for the dude who just used eye drops in this crowded subway car. Gotta be honest. He did it the right way"
"RT @shineebeinextra: who's better KFC or McDonalds https://t.co/EZECNxdc1H"
"@Wendys fries are beautiful creatures from another  planet"
"RT @TMZ: Princess Nokia Hurls Hot Soup in Racist’s Face, Kicks Him Off NYC Subway – WATCH (via @PopCrush) https://t.co/LDkFpSyupe"
"RT @MaryJaneBaby98: hits the back of the wall and straight into the trash ya heard https://t.co/wiBxW0Jomo"
"RT @WannaDebut_twt: Hi PH Wannables! I'm at Starbucks Coffee at Araneta Area. I might be roaming around too. Just ask nicely for your p… "
"RT @Anti: Burger King petty lmaoooo https://t.co/4G5eJ7afEf"
"RT @StevStiffler: His pet chicken pecked him and he took it to McDonalds 😂😂😭 https://t.co/ptLaPFFeHQ"
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"It's so serious BURGER KING is promoting it! https://t.co/4PvYzPHVe1"
"I really want Starbucks but I don’t wanna walk to kams alone ):"
"RT @jungcula: what's krystal birthname?? is it chrystal soo jung? — Yesss 💕 https://t.co/GyuQsLeQYU"
"Lol big mild https://t.co/jj2rmgNHJD"
"RT @kfc: $10 Chicken Share, because chicken tastes better together. https://t.co/DmLP40AnEH"
"ladies 🗣🗣🗣 https://t.co/YPTa271DOk"
"RT @Looseleeaf: You mcm takes selfies in the starbucks restroom, he is almost 21 n tryna mingle 👀🌹 https://t.co/KhLjEZ3LYm"
"RT @roywoodjr: They look like an ad for a terrible Karate Academy that's next door to a Little Caesars https://t.co/NIS91UqueI"
"@TulsiGabbard No it wouldn’t. Been to McDonalds lately! Prices are sky high! And you want to make prices even highe… https://t.co/NgsPvbvOIN"
"RT @jessesapolu: Starbucks at 5:30 am and saw this on the front of Honolulu Advertiser Sports page. Proud of the PFHOF Class of 2018… "
"RT @JackPosobiec: Northern Wall Now https://t.co/TGiR8xqHJ7"
"RT @KhadiDon: Eat enough Krispy Kreme donuts and you'll glow like one. ✨ https://t.co/vZOF5aiJo0"
"Out of chaos find simplicity 🌸 \n.\n#oceansendco #naturelover #beauty #hawaii @ Starbucks https://t.co/S4OZxD7xy4"
"RT @LG_Abadango: &gt;I was starving\n&gt;Ordered UberEATS McDonalds, BigMac Meal with Iced tea\n&gt;somehow Quarter Pounder meal with Coke arrived\n\nfu…"
"KRISPY KREME ISNT ALL THAT GREAT"
