"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"RT @ps4andchill: bae: why tf pizza hut keep texting you \nme: https://t.co/7upSqUqkl1"
"@KaylieJacobson @K1NGR1ZZY @BurgerKing @Wendys I still can’t believe they got rid of them💔"
"RT @faaaactt: Robert Downey Jr. has a Burger King crown card that gets him free food for life."
"I am the boyfriend https://t.co/isCWNYR3ww"
"♥️Award w/ @cstoll0307. ♥️Dinner w/ @qmstitt &amp; @LibCatEmeB. Amazing...then the @Starbucks barista bought me my late… https://t.co/o8W3Yo6MgI"
"@BurgerKing @Wendys i see.......... i guess imma have to go to BK now"
"Got a treat at Starbucks, walk a mile home in the rain, go to sit down to enjoy it... trip and have it explode everywhere before 1 sip 🙃😭"
"RT @Whoa_Kimbosabe: 😭😭😭😭😭😭😭😭😭 RT @_crownxroyal: How the fuck McDonalds IN WALMART don’t have caramel???? Bitch go get it"
"A McDonalds employee telling a disgruntled Rick and Morty fan they can have their Szechuan Sauce for the 100th time… https://t.co/x5XD7wZVkN"
"RT @Simpboyz: yall see a criminal I see a entrepreneur https://t.co/1rjMo75vgd"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"I want Starbucks..."
"RT @Braveheart_USA: Government owned aircraft use is being scrutinized, so @NancyPelosi flights will all be reviewed? \n@realDonaldTrump… "
"RT @JoeyKeigher: ive never wanted chick-fil-a so bad"
"RT @oraltwjnk: YASSS LADY WITH THE SOUP GO BEST FRIEND THAT’S MY BEST FRIEND https://t.co/lnxF22xPpQ"
"I live in chicago area 8min away from @dominos 's Pizza,@ 143 W Division St,Chicago,IL 60610- took 2 plus hours, w/ wrong order&amp;a cold pizza"
"I've got #Oklahoma to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/ni7Fzc7Ta1"
"RT @JulienSolomita: when your dad supports you 😍 https://t.co/YCONRR9yXy"
"RT @downlinkmusic: Free VIP guest list and meet n greet to anyone that can offer me a pack of McDonalds Szechuan sauce"
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"RT @oldmanebro: Welp. NYC doesn’t really go for your “hate speech” shenanigans..\n\nKeep that in (insert NYC neighborhood where the r… "
"RT @OkigboHTX: This is literally the same burger that killed spongebobs health inspector https://t.co/MS4obmvCA9"
"RT @adileneeee_: REPRESENT 😤😤☝🏽 https://t.co/K8rVkICMWU"
"RT @patcain: @ClassicDadMoves There is also a town in IL named Sandwich, and a Subway near the station house. https://t.co/DVccCncfcE"
"@SmoshIan It's the Idea of it... This was only sold once (twice now) and now the opportunity's gone... the mcdonald… https://t.co/5wwS6jUlBn"
"RT @debsuniqueshop: Check out Starbucks snack tray espresso bean picture 2007 platter coffee #Starbucks https://t.co/lURXMmTFlx via @eBay #…"
"We call this a parenting win 👍🏼🍦#frenchfriesandicecream #bestcomboever @ Dairy Queen https://t.co/p6gPTVlLam"
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"lol as if being an nyu lawyer meant hate speech is alright. bye boi https://t.co/u8bQnIdkgJ"
"RT @EPCHSFineArts: Band and Color Guard are on the road again. Grand opening of the Krispy Kreme on Western Avenue https://t.co/HgfZMQFFq5"
"RT @YourGfAdmireMe: I love a nigga that take his time instead of 2 kisses n now your dick out😂😂 like holdon swiper put jack back in the fuc…"
"Imma need Mcdonalds to bring back the Hi-C Orange juice 😡"
"RT @egavactip: Drunk racist lawyer on NYC subway yelled \"First Amendment! First Amendment! N*****, n*****, n*****, n*****, n*****.\"\nhttps:/…"
"Scientists discover the secret of durian's pungent smell: Banned on the city's subway and… https://t.co/fK0gQ1MZvh"
"Hey, check out my review of the @Arbys Chicken Pepperoni Parm. \nhttps://t.co/3tavyruwOB #fastfood #foodporn #arbys https://t.co/33WamjT2ms"
"@kaylee_008 taco 12 pack? https://t.co/nDYnlxiJGl"
"RT @xarantxareyes: all I'm saying is that wendys had spicy chicken nuggets when Obama was president"
"Spicy Nuggets are back and #BurgerKing has saved #America https://t.co/Z6a04EoOqk"
"RT @KaylaJ67: @PeteBlackburn JAMES \"KFC BIG MEAL DEAL\" NEAL! would be a solid sponsor"
"@McDonalds  tries to set things right with ‘Rick and Morty’ fans https://t.co/LwPIcFapbZ https://t.co/5IGgFjIVDz"
"RT @MannieLpz: Thotaritas do that to you. https://t.co/eECHzSKlP2"
"@Wendys Bring back spicy nuggs please"
"@BWWings Chipotle BBQ rub or no dice."
"@Mikey_Ordonez @culvers you should go rn, their custard smacks"
"RT @AkilahObviously: He deserves every punch, every soup, every kick. Every push. Fuck him. https://t.co/NSG4fjUo8G"
"I'm crying when she throws the soup LMAO https://t.co/9T0XGuI3Vl"
"so arbys is getting coke products starting in January and I’m really upset.."
"This is amazing. Blocking the men from eachother. Calling him a racist, calling it hate speech. Kicking him out. Th… https://t.co/rZj3UZedVn"
"RT @ravercabbie: I checked in at Starbucks on #Yelp https://t.co/6U7mmbn06R"
"@isa_camisa I had a Kanye lookalike in chipotle tonight"
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"12 yr old Tamir Rice was executed within seconds...🤔🤔🤔 https://t.co/Ujjdyvow9b"
"RT @Roxane504: I've got #Texas to take the W in this week's @Wendys #RivalryBee! Who's got your vote? https://t.co/OgNj4Wg3tX"
"And I'd like you have money I'm not buying everything for you. Like ok but I've bought you Portillos, Burger King ,… https://t.co/4SvPrT1Eet"
"Cuz chick-fil-a don’t get your order wrong... u just ordered the wrong thing n they corrected it for u"
"And she over here talking about watch what I buy like wtf you talking about I do watch what I buy and don't spend m… https://t.co/711GVvFUZx"
"@Risa_Mang I haven’t had Chick-fil-A in so long and I have not entered a Target in ages IM GOING CRazy!!!!!!!"
"RT @destructoid: KFC's Colonel Sanders is in WWE 2K18...this is not a joke https://t.co/W8J344g0JN https://t.co/35ymeEH3bV"
"RT @tonyposnanski: Scott Baio is boycotting Eminem by refusing to turn the radio to Shade 45 in the break room at Subway."
"@DaveStroup So Burger King is promoting false information (aka fake news) about its competitor?"
"RT @nihilist_arbys: It's Columbus Day, so we're gonna sail over to McDonald's, beat the shit out of everyone, wreck the place &amp; call it arb…"
"I LOST MY STARBUCKS GIFT CARD AND I AM SAD"
"RT @hamzahussain40: Welcome https://t.co/DSZBhSX57S"
"RT @Wendys: Please\nThey eat us now, they eat us later\nAdding up our Wins on a calculator\n\nYou're a laughless clown, or a king t… "
"RT @TinyMontanaa: I don’t do first time meetings at houses. Sorry. Meet me at the nearest Starbucks nigga"
"RT @wingstop: Add 'em up, add 'em up.\nAin't nothin' like Wingstop ranch in a cup.\nNot here to throw shade, just spittin' some hea… "
"Who knows someone who works at Starbucks?"
"Walking through this w/o jacket ✔️ drive to Taco Bell ✔️ Home N/A #IsItRaining? https://t.co/oa96XX98gh"
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"Hello @dominos we ordered a pizza from a location half a mile away at 8:50 and it’s now 10:43 and it’s still not here. How is that possible"
"‘Google, ask Panera for delivery’: Panera Bread offers voice-ordering through Google Assistant https://t.co/NJsvvbsCNU"
"RT @xdcunt: Only a man of true class would get on a subway to Brooklyn and scream the n-word while drinking a lime-a-rita at 2p… "
"I'm looking for a roommate in Toronto Canada. If anyone wants to make $95,000 go to https://t.co/XprLONzBcY im hiring at Subway Astoria OR."
"RT @DontCallMeCorey: @BurgerKing @RichieIsEvol @Wendys Your nuggets are nothing compared to Wendy’s nuggets how dare you try and compare"
"YAS👏🏻 BITCH👏🏻 (by the way I fucking love the girl who threw her soup at him lmaoo) https://t.co/pEZiZTGYvb"
"RT @ohmyyymanda: 🍃 Starbucks, fall scented candles, Halloween movies, fuzzy socks &amp; cuddles. Nuff said. 🍂🍁"
"RT @Anncostanza1: I am a New Yorker born, raised and on the city streets for a long time! You couldn't pay me to vote for Bill de Bla… "
"Pizza Hut delivery is getting hotter ... 15 degrees hotter https://t.co/pqz7zZtEGt via @CNNMoney"
"RT @DobreMarcus: Are you from starbucks because i like you a latte 😂"
"RT @neonorchid1: After Taco Bell 😂😂 https://t.co/NezZsBYa0c"
"RT @BurgerKing: @RichieIsEvol @Wendys we resurrected the spice. 10-piece spicy nuggets are here at BK starting 10/12 for $1.49."
"RT @RichieIsEvol: @Wendys are spicy nuggets back yet?"
"I'm hiring someone to work at Astoria Oregon Burger King restaurant. You would make $95,000"
"RT @Rbg_BanditBoy: I fuck wit Chick-Fil-A heavy g"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"RT @yashar: I love this - Burger King doing sponsored tweets of people complaining about Wendy's https://t.co/TqUR15XfKH"
"RT @dumptrump33: You are killing me. https://t.co/BPJCiy9vin"
"RT @_oneofakindsag: I want some chipotle"
"@jamiee259 and I just went to dunkin and the lady gave us an entire box of donuts and a bag of muffins for free. god bless😭😭😭❤️❤️❤️"
"RT @Eater: Behold Taco Bell’s collaboration with Forever 21 https://t.co/8PCOF8Y1uj https://t.co/duQOqoggb9"
"You can tell he’s an asshole at first glance because his drink of choice, as a grown man, is a Lime-a-Rita... https://t.co/Bp6PONh7YS"
"$10 and a large drink of your choice from Starbucks to anyone who will fix my door thank u"
"RT @BlvckGrip: you should probably shut the fuck up https://t.co/fP89T8HVWT"
"Why is Burger King promoting this tweet lmao https://t.co/jkYtiMhDg6"
"Every time I go to Taco Bell they always get my order wrong like bitch wtf but it's my fault for thinking they won't fuck it up EVERY TIME"
"RT @lisacrost: I just found this beauty at a U-Bahn station in Berlin: A subway map that shows the amount of passengers with line… "
"@hateweed I practically have those hands from the Burger King commercial with little hands and a big whopper :("
"i love how you never question whether @McDonalds is open. you just go and they're always there for you."
"RT @mickeyhanbinee: Hanbin's birthday subway advertisement can literally be spotted at everywhere 😍😍💓 so beautiful 😍😍💓 https://t.co/Zt1zLIy…"
"Photo from corner of Verano and hwy 12 about 15 min ago.  Subway restaurant area. @cityofsonoma #sonoma #sonomafires https://t.co/Hnu0ddaIvU"
"RT @teapartylive: @HHSGov = $500bil+ biz, 5X @IBM. Every CEO min. counts. &gt;$10m per work hour.  Ex CEO Tom Price sit in traffic, or b… "
"RT @EmiilyBiishop: White Castle is fuckin good as fuck, don't @ me"
"Union Station to Lincoln Memorial by Subway, Line 80 bus, Bus, Taxi, Uber, Foot, Bikeshare https://t.co/WiOer6Dj87"
"Nothing but respect for MY presidents https://t.co/S9QUl6JTj8"
"RT @boonktweets: @Fatboy_sse was right when he said dem Subway cookies was cookies 😊🍪🥛 https://t.co/3SbTC2r7wc"
"Hate winter but I’m totally ready for peppermint everything at Starbucks"
"My kind of peeps ❤❤ https://t.co/66cROFiYPz"
"RT @Arbys: Sit boy! https://t.co/rwUIkYZ9bF"
"in bed thinkin bout wendys"
"RT @chrissssgarcia: If I aint rap 'cause I Flip burgers at Burger King... Would you be ashamed to tell your friends yuh feelin' me?"
"RT @k_carzz: @Wendys @Wendys I have just been informed that @BurgerKing has released spicy nuggets... touché BK"
"I want a chipotle burrito stat"
"RT @dconners15: at culvers just opened"
"Spin zone: feel like I have to try chipotle queso now to see how bad it is... bad product=good marketing??👀 stay woke"
"Me: Can I have guacamole please\nChipotle: \nMe: https://t.co/QBAm2pU8ox"
"👏🏾👏🏾👏🏾 THESE ARE THE AMERICANS I LOVE https://t.co/AVz0p0SFia"
"@cdbrzezinski @CrainsChicago @CookCountyBoard Then why isn't sugar taxed? Why isn't Starbucks being taxed?  Cookies… https://t.co/Wss9ObCgob"
"I'm at Starbucks in Chicago, IL https://t.co/rPeRACsV72 https://t.co/UiC5cbRahT"
"#SamsungPay simplifies life at checkout from the Grocery store 2 Starbucks. Here's a invite code to ✔it out 4 free. Use code: E61E7B #money"
"RT @jimpjorps: at Taco Bell; woman ahead of me is trying to order a “chocobo supreme” and will not work with the cashier to figure out what…"
"@mykkelwilke @McDonalds get your shit together"
"RT @Adweek: .@McDonalds made ridiculously groovy posters for its chicken tenders dipping sauces: https://t.co/JhphEedi7s https://t.co/eityF…"
"RT @ChocoLatino_: @BurgerKing @taytaytayallen Before you \"bring spice back\" how about y'all add flavor first?? I'll stick with my bae @Wend…"
"“Starbucks” “Coffee” https://t.co/nnljSkzbfu"
"RT @ColeDavid: @KamalaHarris That’s not the purpose of a minim wage job!  Working at McDonalds isn’t suppose to be a career."
"Let's not overlook how beautiful the Little Caesars Arena is. #HIAC"
"@Swandre3000 HOW HAS MCDONALDS NOT BROUGHT BACK HOT MUSTARD!?!?!? \n\nThat was my JAM"
"RT @AnaheimSigns: Checkout Taco Bell’s Forever 21 clothing collection of tanks, hoodies and graphic shirts https://t.co/6MTP7TVWxZ … https:…"
"@Diego3hunna @BRob2016 if y'all pulled some crap like this on me we done lol https://t.co/0gLOjyyh7j"
"@koreankamakazi If I had a kid and had nothing better to do like KFC, I'd own Twitter also lol"
"@k_carzz @Wendys IVE BEEN SAYING THIS FOR MONTHS, I'm still upset about it ☹️"
"Doctor's note for food poisoning? : Chipotle https://t.co/g1wzwxTGgi"
"RT @Mag_s21: I just want portillos, pappys, Andy’s, el Gallo, Jrs, Krispy Kreme, insomnia and just a damn good slice of real pizza please 😩🏠"
"We all know @McDonalds  has all real beef @Wendys @wingstop"
"RT @tacobell: I don't want feelings. I want Taco Bell."
"RT @OptimusGrind__: Look, Chick-Fil-A is going to have to hand me my food in a full Klansman outfit and call a nigga in my face ."
"RT @LosLos__: Walking out of a Taco Bell bathroom like... https://t.co/M6QLLvImMd"
"I WILL FOREVER LOVE MY FELLOW NEW YORKERS ✊🏻✊🏽✊🏾 https://t.co/zmyVYChDzM"
"RT @Inc: Dunkin' Donuts is dropping the \"Donuts\" and eliminating some donuts from their menu. Are they crazy? @Sales_Source https://t.co/8e…"
"@KhalillfrmLCB Na don't, Ima go steal my little brothers Burger King rn 🍟"
"ugh i wish i had taco bell rn or a 4 for $4"
"RT @K1NGR1ZZY: @BurgerKing Girlfriend: I wonder if he’s thinking what I’m thinking. \n\nBoyfriend: I still can’t believe @Wendys doe… "
"But Burger King just got spicy nuggets incase y'all didn't knowwww😋😋 https://t.co/hCdHT9WuvB"
"@Inc @Sales_Source Interesting. I never go to Starbucks, but Dunkin' is def competing with Starbucks in retail (RTD… https://t.co/IighRqQIb2"
"Quinn: Wanna go to Grill?\n\nMe: Nah, trying to eat healthy \n\nQuinn: Taco Bell has a new chicken quesadilla $5 box\n\n*Goes to Taco Bell*"
"@_CruzVictor @Inc @Sales_Source @DunkinDonuts I like McDonalds way more than Starbucks. Starbucks is a full of mega dorks."
"RT @MiiToons: Mulan didn’t deserve any of this. \n\nHope y’all  enjoy this piece I came up with in the midst of all the chaos!… "
"One of my favorite classic animes 😍 #inuyasha https://t.co/iOHJIJdt5P"
"RT @lmCardiB: If you wanna impress me, bring me Chick-Fil-A on a Sunday"
"RT @JUSTIN_TH0MPS0N: @McDonalds can you please explain to me why I only got 9 nuggets with my 10 piece nugget meal? I don't understand http…"
"RT @SlNFULBRAT: Frappes from mcdonalds is like crack to me. 🤤😩"
"Christopher Columbus is secretly behind every Starbucks that pops up in a community of color."
"What I want in a guy - someone to eat the burrito from the 5$ Taco Bell craving box while I eat everything else.."
"RT @TwitterMoments: This week in weird dreams: Ominous clocks, meeting Zac Efron at El Pollo Loco and naming your son Barnacle Boy. https:/…"
"RT @_crownxroyal: How the fuck McDonalds IN WALMART don’t have caramel???? Bitch go get it"
"This is the future millennials want https://t.co/tXBq6p6B5L"
"Taco Bell or no Taco Bell? That is the question. Aka to be a fatass or not to be a fatass?? 🌮😆"
"RT @vevian_kp: #GOT7 #7for7 #YouAre comeback fan support by 11 Fansites Union at Hyehwa Station, Seoul Subway Line 4\nCredit: GOT7吧… "
"RT @iAmMasonLevi: just had the best taco bell experience of my life and then a small asian man flipped james off"
"I love this song. https://t.co/47FvDNA7ZM"
"RT @solornbalbum: suho:one subway club for my baekhyun pls\nstaff:[is reaching for cucumber]\nsuho:PUT UR TONGS DOWN\nsuho:ANY VEGGIES I… "
"RT @lukeoxendale: we have a 16 hour drive today and guess who instead of sleeping stayed up all night talking to an arbys employee on tinder"
"RT @roywoodjr: McDonalds- McDowells https://t.co/s8kGo66JAd"
