"https://t.co/VrBbsp4mhT Taco Bell’s Fashion Collab with Forever 21 Is Here — See the Whole Collection https://t.co/P5imXhFo04 #SocialMedia"
"Princess Nokia Dumps Hot Soup on Man Yelling N-Word in New York Subway  https://t.co/5IpQeUv43r"
"RT @ZeddRebel: If I ever describe a serial abuser/accused rapist as a 'libidinous cad' you all have permission to feed my forearms through…"
"I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/hANYkRRrfk"
"RT @McDonalds: You spoke. We’ve listened. Lots more #SzechuanSauce and locations. Details soon. And that’s the wayyy the news goes! https:/…"
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"LMAO - “I went to NYU law! I went to NYU Law!” https://t.co/KVTjPZCDtz"
"I'm hungry but I don't want whataburger nor Waffle House"
"RT @flawlessk_: mcdonalds be acting so fucking stingy with they sauce."
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"It's almost 3 AM and I am genuinely tempted to sneak out of the house and drive to Whataburger in my pajamas."
"Starbucks Pike Place, LA"
"RT @hanbin_zuzu: More subway advertising picture release today ~Thanks for everthing 😘❤️합정역 인증해 ！\n#한빈 #iKON #아이콘 #비아이 #BI  #김한빈 \n#ハン… "
"RT @The_RapGirl: A guy just slid in my dm’s with the link to a coupon for a free Chick-fil-a nuggets...thats how you do it y’all."
"RT @GLOCOgaming: When Gaming is life, but you have to go out and eat...\n#NewVideo #WarLords #mcdonalds https://t.co/LgGOIXnFRh"
"This is basically what it’ll have to come to https://t.co/ElfFpRsX56"
"BLACK STARBUCKS” OF CHICAGO! BLACK OWNED AND DELICIOUS https://t.co/ueelen4Dww https://t.co/jHP9BWAetv"
"@lukeoneil47 Btw my favorite Berlin thing is people bring their dogs on the subway and also drink giant bottles of beer on the subway."
"Gotta throw the whole girl and Wednesday away. https://t.co/lPOXfmEdAu"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"I hope @twat_boy grandma enjoyed her subway"
"\"Democrats Are Playing Checkers While Trump Is Playing Chess\" by THOMAS B. EDSALL via NYT https://t.co/YknkFYslV2"
"@Whataburger I think I deserve this https://t.co/YZodiXCYCf"
"THAT IS A FUCKING ARCH THAT WOULD MAKE RONALD MCDONALD CUM IN THA BURGER KING’S MOUTH!! https://t.co/Mc3trTJ93E"
"RT @fkahoda: Burger King is so petty https://t.co/85VbE5QATu"
"RT @tweetpromo17: Buy 1 Free 1 from Starbucks\nLets grab it now 😋 https://t.co/PZmNA8PZJN"
"MF I WANT TACO BELL"
"Lock this psycho up!! https://t.co/U2Iic0PcQ0"
"@stubacat The acceptability depends entirely on what type of Subway it was. Southwest sauce before 10am is not a good way to live your life."
"RT @hannahnr_: MF I WANT TACO BELL"
"With Jupal Krystal Yoong Jon9alay ( •̅_•̅)"
"RT @LadyKrimZen: Time to start ordering kids meals again https://t.co/JVdq3xMUrx"
"AWU NEW SONG COMING SOON FROM FIREMAN KING SONGO #fireman #firemankingsongo #satranç #starbucks… https://t.co/QAdE83vtXF"
"⚡ Pizza Hut wants to keep your body as warm as their pies\n\nhttps://t.co/azrfkbe8wm"
"I'm at Starbucks w/ @mmadwanii https://t.co/m0iq85uiSJ"
"RT @FrenchCalhoun: Play Chess Not Checkers https://t.co/W9nOLrDcY0"
"RT @SherriSaum1: Shit! https://t.co/xSQP5Py29u"
"Damn https://t.co/8d4KLmM67d"
"RT @HenryMakow: Poster at downtown Toronto subway station. Society has embraced decadence/Satanism. https://t.co/O0mYYbqG7s"
"Ugh I want coffee but by the time I get to work Starbucks won't be open yet:("
"Savage lol https://t.co/uLzmMrxpEY"
"RT @ChrisMWolfe: @h3h3productions @HilaKleinH3 \nAt Starbucks near DntwnLA; Barista: \"Hey, you're that guy!! You're that guy!! You we… "
"@fitnessleeds Costa, intelligentsia and Tim hortons"
"I knew Taco Bell wasn't good for you for many reasons.... Too much Sauce? #roughblowjob #gags #pukes #throatfucked… https://t.co/pUb7yAa4NX"
"Fans voted Cedar Creek the Little Caesars team of the week after the Cougars trounced OCS Thursday. https://t.co/1IxOhMHCbG"
"RT @CauseWereTexas: Whataburger https://t.co/h3JB1QvQOv"
"WTF WHERE IS MY KRISPY KREME COUPON?!?! I’m hoping it’s in Haley’s wallet or in my car cause bitch I was going to g… https://t.co/2xD3mOfuOP"
"RT @tonyposnanski: Scott Baio is so mad about the Boy Scouts so he is boycotting them by not allowing them to fundraise in front of the Sub…"
"eating burgers at KFC Johar Town https://t.co/5dUDY4BV1S"
"I could really use some Starbucks but that would be going against my diet &amp; I’m not doing it 🤦🏼‍♀️"
"@STN_Airport and £6.50 for some chips, chilli bites and a 500ml bottle of water from burger king is steep, even for airport prices."
"/ MY WORK ARE SELLING KRISPY KREME IM YELLING"
"The Trump Presidential Library is just going to be row after row of empty KFC boxes and soiled diapers."
"RT @zachalfonso: “Do you wanna go to Taco Bell?” - 6-7-8. “You can’t sit with us!” - 8! now it’s stuck in my head again 🙄 https://t.co/72dy…"
"[Mino ] my enthusiast, cute, rated, caring, good attitude bias: bp, suzy, krystal."
"RT @nihilist_arbys: Sure, shit's bleak, but remember: we're all gonna be so fucking dead soon. None of this matters.\nEat arbys"
"I just checked in at Taco Bell with #mPLUSPlaces Download today!  https://t.co/fAyaKmnG71"
"Indiana man accused of impersonating officer to get free Taco Bell\nhttps://t.co/49raJSQXl9 https://t.co/twPddT1vKl"
"RT @soojungforehead: Who is stronger?\n\nHara vs Krystal\n\n(remember that one time when 2pm Changsun jump into the water to save Krystal bu… "
"RT @RichieIsEvol: @Wendys why...? Spicy nuggets....... RIP 🙏😔"
"s/o shorty with the soup! an icon. https://t.co/tehTPwUoyw"
"RT @wingstop: You tried it... you really did. \nWho'd you borrow those lines from Sid the kid? \nIt's closing time and we're leavin… "
"RT @Wonderlust_J: SUBWAY \n170915\n#수호 #SUHO #Junmyeon #준면 #엑소\nhttps://t.co/WrKUmPNJpq\nhttps://t.co/vYGWlmT5zm https://t.co/eAy1oEbMxY"
"the ideal me would get Starbucks everyday, but the ideal me doesn’t feel like waiting behind 20 people getting cold brew because it’s trendy"
"RT @bobvulfov: my grandson: grandpa why do u have a limp\n\nme: well in my youth the mcdonalds corporation released a coveted szechuan sauce…"
"Let’s give em something to taco ‘bout. https://t.co/SmJGslYHU0"
"#Gm #Tgfad💪💯✊ @ Starbucks https://t.co/azmNcGYhu4"
"RT @TatianaBonadona: It's kinda like people's love for mcdonalds no matter what they hear about they still gonna it so I'm still going t… "
"@WORLDSTAR Subway no question don't @ me"
"Man I hate Dunkin’ Donuts"
"Mane, somebody need to ship some Chick-fil-a to North Korea. Bet that make them change their mind for a while."
"I need Starbucks this morning"
"Arkansas mini trip over and now back to the grind! #backtothegrind #starbucks #workinghard @… https://t.co/j7tYiKmGga"
"I was in the Chick-fil-A drive through and the person in front of me paid for my food 💪🏽❤️"
"Something Sweet! Burger King's New Cinnamon Toast Crunch Milkshake https://t.co/nOhRAH0KPK #stupidDOPE https://t.co/8ouG3VATpq"
"Ohh that’s deep https://t.co/gvY158U0IB"
"RT @_Mirekle810: Ohh that’s deep https://t.co/gvY158U0IB"
"RT @anammerch: i’m about to buy all of these https://t.co/7umrI74aiq"
"RT @jackiekcalmes: Fact-checkers (incl'g me) are throwing up their hands as Trump describes his tax plan to Hannity--he clearly doesn't und…"
"@michelle_lynnnn Get the Starbucks app!! BEST THING EVER!"
"👀 where that’s at? STARBUCKS? If so I’m running there https://t.co/CQl6U7gFW2"
"RT @REALpunknews: Goths Sack Sbarro, Extending Hot Topic Empire to Far Reaches of Food Court https://t.co/S8aB9zjJJ2"
"RT @Destiny54946852: @nicoletteannmc thank you i will visit that McDonalds and Matthi in sta clara and conchas in qc once again sooner #ALD…"
"Ok but you're beautiful 😭😻 https://t.co/ea9opGUOn5"
"RT @perlaaa_9: Shout out to Diego for the picture at Starbucks 😅 having a straight face is not my thing 😂 https://t.co/XIjmnANFwy"
"Just got my morning shot of sprite from Mcdonalds. Today should be productive."
"I found out you don’t realize how much something means to you until  it’s gone when Dairy Queen shut down in New Roads."
"now I have to murder myself in the gym today cause hubz decided on top of bringing wendys home...smoke hookah...so I had the munchies -_-"
"RT @Pqlyur1: Hire immediately! https://t.co/rEP4GEm1rg"
"RT @YourGfAdmireMe: I love a nigga that take his time instead of 2 kisses n now your dick out😂😂 like holdon swiper put jack back in the fuc…"
"RT @oraltwjnk: YASSS LADY WITH THE SOUP GO BEST FRIEND THAT’S MY BEST FRIEND https://t.co/lnxF22xPpQ"
"RT @Wendys: Please\nThey eat us now, they eat us later\nAdding up our Wins on a calculator\n\nYou're a laughless clown, or a king t… "
"I'm late because the Sheriff needed me to wash cars, because I am a necessary evil...smh https://t.co/P7lVbCMtKy"
"bio sucks cause i actually got coal and not a starbucks csuse im thirsty for followers"
