"When ur trying to makeout in a McDonalds parking lot and a fire truck comes 🙄🙄"
"RT @Braveheart_USA: Government owned aircraft use is being scrutinized, so @NancyPelosi flights will all be reviewed? \n@realDonaldTrump… "
"young subway fare here. ya gurl. https://t.co/iv1RhN37B8"
"RT @morganhousel: Twitter created the most addictive and socially transformative product of our generation and turned it into a $2.5b… "
"RT @Lin_Manuel: Good morning.\nI believe in you.\nNot always in our leaders, not always in the subway schedules, \nbut always in you.\nYou, unw…"
"Tonight reassured me that Chipotle is and always will be &gt; Qdoba. Only thing Q has going is their queso. DELICIOUS"
"RT @halsey: When u try to do a nice thing and it backfires https://t.co/55ArbGPjga"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"Bruh hit up del taco https://t.co/iyH8QalU2D"
"@LundenRTR I've never had Taco Bell, so I wouldn't really know."
"RT @TakaoBeatz: Just when I think I’m losing hope for humanity the dude in front of me at Starbucks pays for my coffee and croissant, gr8 m…"
"RT @mark_joshuaa: Chick fil a employees don’t got shit on mcdonalds https://t.co/08vEJiaVmu"
"@cratebaptist @CTVNews if tim hortons is good coffee then it's clear you have not gone out of your hole"
"#Deal 2017-18 TIM HORTONS BRAD MARCHAND PLATINUM PROFILES PP-4 BOSTON BRUINS https://t.co/4rf03aqOPN https://t.co/zUaSlNovyM"
"RT @ruralmoms: How to Celebrate National Cheese Curd Day (and a fun @Culvers cheese curd giveaway!) https://t.co/tEziPBndt2… "
"RT @carreiro_emily: Are we supposed to feel bad or something, because this man got EXACTLY what he deserved. There is no room for hate… "
"RT @MBTA: An artist &amp; transit enthusiast in China created this image, depicting the new #MBTA subway cars. The assembly plant… "
"RT @ddevinmmorris: A few weeks ago  I got shorted a nugget by Wendys. Today I was given 2 extra nugs. Life has ups and downs. Just power th…"
"RT @Evander3412: @ThatHatfield Young 5 dollar Taco Bell box seems fitting"
"RT @KayMich__: Forget the chicken strips, WHERE THE SPICY NUGGETS!?! @Wendys"
"RT @scottlincicome: End NAFTA now. https://t.co/wqVvifHE7j"
"RT @burnt_angels: EVERYTHING https://t.co/m2AdPQKcn2"
"RT @realDrOlmo: DONT WORRY BOYS/TRAITORS YOU CAN GET A JOB AT MCDONALDS🍿 https://t.co/XpnsnrkU6K"
"2017-18 TIM HORTONS BRAD MARCHAND PLATINUM PROFILES PP-4 BOSTON BRUINS https://t.co/5QwT48AvQO #Sale https://t.co/9N3AuyWNDJ"
"I DIDN'T ASK FOR AN @MBTA ANIME, YET AN MBTA ANIME I WAS DELIVERED. https://t.co/ibwWGP9lNJ"
"@McDonalds Dude no offense but fuck your grandma"
"jesus CHRIST i want taco bell"
"RT @alyssakatyas: This video of Trixie rollerblading from a Starbucks to Shea Coulee's car is important. https://t.co/cNyBrhjM8w"
"RT @IWillRedPillYou: Florida Man Robs Wells Fargo Bank in Gainesville, Heads Straight to KFC with Cash\n#RedPill\n#Goldwater\nhttps://t.co/XX8…"
"McDonald's Create-Your-Taste Kiosks Hit New York City in the Gut https://t.co/gKpjpGYUJU via @Eater"
"We need this @CapeCodToday https://t.co/KZHW8KfVvV"
"Get with him https://t.co/5ibi2dYBoU"
"RT @Nerdwiththehat: I DIDN'T ASK FOR AN @MBTA ANIME, YET AN MBTA ANIME I WAS DELIVERED. https://t.co/ibwWGP9lNJ"
"RT @Shawtyfeels: Kinda wanna look good in a bikini kinda wanna eat three burritos from chipotle kinda pissed I have to pick one"
"UD TIM HORTONS 17/18 - BRAD MARCHAND - TRIPLE EXPOSURE TE-7 ***MINT https://t.co/2mzX4i8OKL #Sale https://t.co/7ycCdO6WMN"
"A Poem For The Modern Day:\nTook a shit at Starbucks\nNo toilet paper in the stall\nNobody heard my cries for help\nToo… https://t.co/ViyNfoCAUX"
"Fuck I really want Taco Bell right now"
"If You REALLY Love Buffalo Wings, We Found Your Next Coffee Obsession https://t.co/JR16hHoyHP https://t.co/WFFs6z7qtR"
"So I'll be starting a new diet on Monday....\n\nhttps://t.co/56FnFAW95H"
"RT @AvidAutomates: Stop by our booth (#920) at #GPUGSummit, take a picture with us, post to Twitter and get a #Starbucks gift card. Se… "
"I'm at KFC in Sydney, NSW https://t.co/lbR6kaO4e6"
"RT @nycsouthpaw: That's a ridiculous use of replay, but on the other hand it may get people to the subway on time."
"RT @EvanDrellich: The ever-interesting Dallas Keuchel on the Astros core, on potential free agency, his longevity, on rebuilds:… "
"RT @Fatboy_sse: THESE SUBWAY COOKIES WAS TOO FUCKING GOOD 😂😂😂😂😂😂 #FATBOYGANG https://t.co/TM1iCVTNqe"
"4 classes. Work at pizza hut almost full time. Now I want to add esports into the mix. No clue how it will go haha."
"Big facts https://t.co/zrcduSBnyL"
"RT @Lmao: 12 year olds are having sex and i can't even order in mcdonalds without panicking"
"RT heidiwaldusky: If you can't beat 'em, join 'em. McDonalds Chobani, even facebook, up their #foodporn game. https://t.co/dD4mFyIEf3 #adv…"
"@bman1126 @MassAGO @MA_Senate Meanwhile. This is Nevada &amp; you see the same in other gun nut states. You really want… https://t.co/93ZCHLjgIE"
"RT @XplodingUnicorn: [first time in Starbucks in 10 years]\n\nMe: I'd like coffee.\n\nBarista: What kind?\n\nMe: I didn't plan for follow-up ques…"
"RT @CBSNewYork: Subway Delays Are Costing New Yorkers Serious Time And Money, Report Says https://t.co/Txi5wB5rlv"
"Townhouse – 52 Victoria Heights Rd Unit 52 Boston, MA 02136 is now new to the market! https://t.co/PNluLAIuna"
"RT @fox5ny: Hunt for subway pervert https://t.co/yzVKrHNAQ8 https://t.co/HqohYHkP7v"
"#MHaffiezMNazri is experiencing an all new #Subway in a basket\n\n#breakfast #lunch #dinner #food… https://t.co/Q0pjXsQwul"
"RT @HeerJeet: Next; Jared Fogle explains what's wrong with Subway's new menu. https://t.co/Sg1UZLlySU"
"i also left my bag at mcdonalds but luckily realized immediately and i left my phone on a shelf in walmart but also… https://t.co/0FvaMHM4kp"
"RT @Crackofdawn_jy: 🇵🇭 Local sale in Manila \nSlogan set 760PHP\nFan set 260PHP\nPlace: in front of the Starbucks😆\nPlease come to find me!… "
"Whenever I'm feeling down, at least I know someone I look up to believes in me (I'm part of the collective you, rig… https://t.co/QToJmzY2QV"
"RT @WCVB: Couple shares love of Taco Bell in wedding photo shoot https://t.co/XZeUvWfxk8 https://t.co/l9QpeIYTct"
"@ErinLee113 You have needs, Erin! Starbucks, Twitter, and Facebook."
"RT @FunnyQuotees: The time when McDonalds gave out good toys... https://t.co/98UgJk4drM"
"RT @stacos: DORCHESTER: 3 car door checkers, Homes Ave, BPD enroute"
"RT @JezCorden: Why why why\r\rhttps://t.co/wWdr6XGmOm"
"RT @roywoodjr: They look like an ad for a terrible Karate Academy that's next door to a Little Caesars https://t.co/NIS91UqueI"
"This is what delivering pizza at Springfield college looks like lol had me coming back with ditches and shit 😂 https://t.co/izadEyZZPs"
"Okay but who tf thinks it's okay to throw their coffee at a barista (or at anyone). Shame on you! \n#starbucks"
"RT @dodomesticdad: So I just had my first cheese curd at @Culvers! And it was GOOD! #CheeseCurdDay #AD https://t.co/vL1SEVvZCj https://t.co…"
"RT @colourlss: Good luck in McDonalds 👏 (from weibo) https://t.co/K8Lh7wUMb2"
"Taco Bell for dinner got me going straight to bed 😴😴😴 #kanakattack"
