"#BlackHistoryFact At the age of 26, Ashley Derby became one of the youngest franchise owners in \nChick-fil-A histor… https://t.co/Z9FA2W7Fiv"
"I'm at @Culvers in Birch Run, MI https://t.co/Bp0qZGfrDb"
"RT @jessthesav: That's cool, my momma don't even buy me Mcdonalds... https://t.co/IPURH9RfYF"
"RT @meechonmars: BRING BACK MY BELOVED SPICY NUGGETS @Wendys"
"Get me a pizza parka asap @pizzahut 🔥🍕 https://t.co/U6ntLEJbZx"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"@McDonalds I went to one of your locations here in Muskegon MI and I received terrible service. I didn't get a receipt either."
"RT @ameriqan: only cultured individuals will understand https://t.co/NGsv6tViL2"
"RT therealautoblog \"Mid-engine #Chevy #Corvette is spotted on public roads -- and in the #McDonalds drive-thru: … https://t.co/oMy1knAOTP\""
"ROWLETBIRB https://t.co/FAJTpsD1v0"
"@subway can i pls have a free sub i'm poor n rly hungry rn"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"RT @Chazer11: LMAOOOO BURGER KING CLOWNING https://t.co/SvDasRaIYs"
"So chipotle on 14th street has a Security Guard inside 😂🤦‍♀️ smh"
"Ha! I hope he gets back in. The LCA response about an already dead animal is foolish IMO. https://t.co/SrXdhXFF4B"
"@anthonytbroome You are right, taco bell is disrespectful to real Mexican food."
"I've got #Oklahoma to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/c75oUUh7lu"
"Nothing more tone deaf than opening a new arena with a bad team and banning one of the team's longest traditions.… https://t.co/tBTcA6Hh78"
"https://t.co/3PpmJ1jcXB your better than this @DetroitRedWings"
"I liked a @YouTube video https://t.co/Mep1w04ETX Ordering A Really Nasty Subway Sandwich! NASTIEST EVER!"
"I ordered a tall drink from Starbucks and this sure as hell isn't tall https://t.co/v87bvgfxV5"
"Now Selling:  Lone Star Steakhouse, Subway, Starbucks, Outback Gift Cards! https://t.co/hDAkYk7zMp"
"RT @pennyannnichols: wanna talk about disappointment?  last night at the club i was ordering lauren and i jimmy johns and i got to the e… "
"RT @NinWire: Pokémon Sun &amp; Moon toys are coming to McDonald’s Happy Meals soon. https://t.co/c5KX2TNWQP https://t.co/a4GjX4f2tb"
"Want to work at Starbucks? We're #hiring in #AnnArbor, MI! Click for details: https://t.co/kS7fq5oXCF #CustomerService #Job #Jobs"
"Are they going to ban when hats are thrown for hat tricks?\nBettman is jerk, been trying to rid Detroit of tradition… https://t.co/xFmgelHG0L"
"RT @971theticketxyt: Octupus-Thrower Facing Lifetime Ban At Little Caesars Arena\nhttps://t.co/B3MAg9ssUH"
"@chrissytothoc Give us building/room will have Jimmy Johns show up and deliver to you #freakyfast"
"I didn’t eat fast food for the longest time but now all I want is McDonalds nugs n fries #rip"
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"@Blurrr_F why are you eating at mcdonalds in the first place?"
"Congrats to Greg Asbed and the @CIW. The work you do is beyond important. Oh and @Wendys, join the fair food progra… https://t.co/O4oDdPLAT2"
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"Wait... I can get this for free at a McDonalds? And it's not rare? Time to jump on a McDonald's sales counter and make an ass of myself."
"RT @BarstoolJordie: Red Wings fan is facing a lifetime ban after throwing the 1st octopus on the ice at Little Caesars Arena… "
"RT @ps4andchill: bae: why tf pizza hut keep texting you \nme: https://t.co/7upSqUqkl1"
"RT @Brandontcare_: Leaving the club on my way to Taco Bell like: https://t.co/BojJCa83hR"
"RT @X_JR__: United we stand, to whoop a racists ass. https://t.co/5A4pVuYWsV"
"Oct. 23 Monday, Representative Bellino's coffee hours\n \n10:30am-11:30am\nTim Hortons\n404 South Monroe Street,... https://t.co/M1iTovc3uM"
"RT @Arbys: Sit boy! https://t.co/rwUIkYZ9bF"
"Let’s do this! #nacada17 #conference #stlouis #starbucks #pumpkinspice @ America's Center https://t.co/TsbygYpzbL"
"RT @Crudes: can't stop laughing, burger king wins https://t.co/MPqQOynGRb"
"i am having a soy milk latte with @starbucks veranda I love my @mrcoffee espresso maker Madonna  https://t.co/2w7AQy38Au via @YouTube"
"WHAT IN THE FUCK 😡😤 https://t.co/mDN3WXrI01"
"These are terrible choices to pick from lmao https://t.co/NycyilThGu"
"RT @chastity_janee: I NEED A CARAMEL FRAPPE FROM MCDONALDS"
"@Lilbooty_Cutie1 You said Chick-fil-A on you this week"
"@Whataburger Why is this @daaisyh749"
"RT @barstoolsports: Red Wings fan is facing a lifetime ban after throwing the first octopus on the ice at Little Caesars Arena… "
"Interesting this caught out on streets in Cadillac,mi @lMonsterSkillsl @thatdudeinblue @EKDrifter458 @robblesso… https://t.co/LuyNb3WKD6"
"Join the Starbucks team! See our latest #job opening here: https://t.co/vM3oRaP46d #CustomerService #Southfield, MI #Hiring #CareerArc"
"how can you ban someone FOR CHRISTENING THE ARENA https://t.co/gguK5nxiOr"
"RT @DetroitRedWings: HEY FANS! @falloutboy's #MANIATour stops at Little Caesars Arena on Tues, Oct. 24! Don't miss out! #LGRW\n\nDetails:… "
"This is so stupid, how can you ban him for continuing a tradition that has been going on for 60 years? https://t.co/Bvf7KjQrLx"
"one of these days im just gonna go into a taco bell and demand a tube of their creamy jalapeno sauce"
"So Parker wasn't actually the first🤔 https://t.co/UBxRWWlHjh"
"RT @tbitchardson: don't fuckin lie to me and get me excited about a taking back sunday mcdonald's ad https://t.co/NnNPhva0nm"
"RT @yeswecouponinc: OH MY GOSH!! #FREE $5 Dunkin Donuts Card! GO GO GO #Freebies #HotDeals #freebie #couponfamily ... https://t.co/9wAuuJOZ…"
"Fuck that and fuck this soft ass country https://t.co/rr4QG5uqkm"
"A whole box of food for under 6 bucks? Seriously thank god for Taco Bell 🙏🏻🙏🏻🙏🏻"
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"once i was walking from a salon to the subway in nyc, a man complimented my hair, &amp; when i ignored him, he followed… https://t.co/s0vvcvyiHV"
"Obesity Was Rising as Ghana Embraced Fast Food. Then Came KFC. https://t.co/chEdmYl8CC"
"One of the best tweets you'll see all day https://t.co/srPmMGLuPU"
"RT @iAmMrCarson: He might’ve died on DDOT https://t.co/eOm8zrSPBo"
"When you're hungry, nothing can be more upsetting than Taco Bell not giving you your sauce Whan they specifically asked"
"RT @dacotte: Me, telling a bedtime story to my kids: \n\nSo after the great sauce incident of 2017, @McDonalds announced toys woul… "
"RT @Starbucks: Handcrafted. #MaplePecanLatte https://t.co/89fURSIOvu"
"RT @therealtblake: Cinnamon Toast Crunch milshake will be tried. Burger King can't miss rn https://t.co/C7B7Nffnsk"
"RT @WaynePerry_: Wendys 4 for 4 #Filayyyy 😂 https://t.co/ooHGeNl0Db"
"RT @BigBeard_Ali: Dove &amp; Chick-Fil-a just gone have to call me a nigger to my face 🤷🏽‍♂️"
"I need Starbucks to deliver to my room"
"Really? This is the best tradition in hockey. No one got banned when Obama was in office, just sayin.\n\nhttps://t.co/xgO1IFzKAK"
"What's the longest your supposed to wait for jimmy johns like when is it considered not \"freaky fast\""
"RT @MiiToons: Mulan didn’t deserve any of this. \n\nHope y’all  enjoy this piece I came up with in the midst of all the chaos!… "
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"Jaren Jackson guaranteed to me he's getting some of that Milan Szechuan sauce when @McDonalds rolls it out.… https://t.co/OyglisAcQN"
"Kicking Off the Party at Little Caesars Arena &amp; Mike’s Pizza Bar - read the blog at https://t.co/Ay18fKZr8r.… https://t.co/fn9bcf0Fsv"
"RT @nihilist_arbys: It's Columbus Day, so we're gonna sail over to McDonald's, beat the shit out of everyone, wreck the place &amp; call it arb…"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"Jimmy Johns in Coldwater needs Delivery Drivers &amp; Sandwich Artists! #workforcewednesday #wioa  https://t.co/Jd3jggN6QH"
"Seeing this was promoted by Burger King, I sense a war coming soon. https://t.co/PJDUXOU3KQ"
"Told somebody yesterday I wanted authentic tacos this mf gone say “why didn’t you just say Taco Bell” 😂🤦🏽‍♀️I still can’t get over that"
"RT @Pitch_Bleeze: #MyHeartIsYoursIf you shell out the extra cash to get me some guacamole when we go to Chipotle."
"RT @tonyposnanski: Scott Baio is so mad about the Boy Scouts so he is boycotting them by not allowing them to fundraise in front of the Sub…"
"free my man, did nothing wrong https://t.co/C4ra8kgnAm"
"I'm a Bohemian. I don't need shoes to buy Starbucks. https://t.co/UbzkVs9PxU"
"Are you able to pick up Starbucks donations tomorrow (Thursday) at the Rochester/Auburn and Rochester/South Blvd locations?"
"RT @MiWorksSW: Jimmy Johns in Coldwater needs Delivery Drivers &amp; Sandwich Artists! #workforcewednesday #wioa  https://t.co/Jd3jggN6QH"
"\"but why eat McDonalds if ur on a diet\". Cuz my job is on the GO GO GO and Subway gets old. Southwest salad and grilled wraps tho 😋"
"Does the punishment fit the crime? https://t.co/USACuhKo1z"
"@ericacerra thanks for wishing me late belated 26th birthday and early 27th birthday meet you and all as a fan soon… https://t.co/uAaa0KgElW"
"@Wendys got rid of spicy nuggets the fuck 🤔🤔🤔"
"RT @MichaelaaRhudss: pulling up to taco bell after a night out https://t.co/KuvW5mMInb"
"RT @Whataburger: I don’t need a curve on a test. I need Whataburger."
"When I die I hope to be buried with a Little Caesars hot n ready and crazy bread"
"RT @CarmineGio: Folks...Please this #eraoftheexposed tippingpoint... https://t.co/xwqdqoQFyn"
"@DetroitRedWings Please tell me this has been corrected. We need all the super fans we can get. https://t.co/byusd9PZCP"
"RT @ChrisMWolfe: @h3h3productions @HilaKleinH3 \nAt Starbucks near DntwnLA; Barista: \"Hey, you're that guy!! You're that guy!! You we… "
"say what you want about fast food but please leave White Castle out of it 😔"
"@DTE_Energy Hey DTE, had to put actual clothes on and go to Starbucks for work. Not cool."
"I hate you 😂😂😂😂 https://t.co/7eyI4AbW4O"
"The Starbucks maple pecan latte is everything I ever wanted in life; a beacon of warmth in a cold, uncaring universe."
"what kinda bullshit is this https://t.co/g7YYRfaSBc"
"business: Taco Bell wants to sell you clothes with your chalupa https://t.co/F55yRhMRVl https://t.co/LddE31CPwh"
"RT @CoitusOnMrBeach: Day 10 without Taco Bell. Depressed, lost, hopeless, malnourished. I fear the end is near."
"RT @x_FreshStart: Dove and Chick-fil-A going just have to call me a nigger to my face."
"RT @SteenSN: @awid__ @BurgerKing @Wendys .@Wendys, what is this #weak play by @BurgerKing having to PAY to get in YOUR followers… "
"RT @BurgerKing: @awid__ @Wendys need a spicy rebound? our 10-piece spicy nuggets are here starting 10/12 for $1.49."
"RT @umphrey15: Jimmy johns &gt; subway"
"The Taco Bell Bottom https://t.co/GAt1E7kQZo"
"Little Caesars sucks"
"Octupus-Thrower Facing Lifetime Ban At Little Caesars Arena #redwings #bhive https://t.co/h6EfW8EkvU"
"This is the most absurd thing I’ve heard of. If only Mr. I was still here he wouldn’t let this garbage happen🙄😡 https://t.co/GXqedRYIMc"
"#psl #basic #sorrynotsorry #noshame (@ Starbucks in Pittsfield Township, MI) https://t.co/SGspH8NcdA https://t.co/tNpFwZAkOf"
"RT @Chicago_Styles: So I went to @Whataburger  and I just had to rap my order cuz I was mad hungry!! https://t.co/1AAwL2wa6h"
"@Wendys I'm going to Wendy's what should I get?"
"Now this would possibly bring me back https://t.co/IGqjJxXoUc"
"RT @RedWingDiehards: Wait a minute...what the fuck? @DetroitRedWings https://t.co/jGehKMxoZ9"
"@wokehillbilly @McDonalds lol they're claiming to be understaffed? find that hard to believe many don't even give consistent hours"
"Burger King is so freaking savage, definitely getting spicy nuggs tomorrow 😎"
"That's weak https://t.co/ndmHnozFdF"
"RT @emhendd: telemetry is better than starbucks"
"Chick-fil-a is such a magical place, this dude literally gave me free food"
"@SUBWAY I just paid $8.26 for a foot long. Wtf happened to $5 footlongs.@Wendys can you explain this to me."
"@SUBWAY @Wendys @Wendys  I mean you've never changed girl. Thats why you my go to..."
"Thanks again to Metro Agency Inc for sponsoring and Dunkin' Donuts for hosting this morning's Brewin' Business!"
"RT @riccialexis: {\"FALL\" in Love with @McD_CentralAR Pumpkin Spice Latte} today!! #McDAmbassador #ad #PSL #PumpkinSpiceLatte… "
"RT @JedStruts: What're you saying JT? @LittleMix https://t.co/8WgcTzPkUS"
"RT @ENBrown: \"Police find no one inside a Liberty Hardee's after lengthy standoff\" 🇺🇸🇺🇸🇺🇸 https://t.co/25KQuP0UV3"
"Thank you Jimmy Johns for the free customer appreciation sandwich 😋😋👌🏼👌🏼"
"RT @hockeynight: Windsor man faces lifetime ban for tossing first octopus at Little Caesars Arena https://t.co/FIs5m2GPtR https://t.co/7m5j…"
"@Quemini the popcorn isn't that good though! before the popcorn we sold trash candy bars for $1 with a $1 burger king coupon"
"I recall @DLoesch being excited the last time Arby's did this. Now it's at every location. https://t.co/qBg9knn3aG"
"RT @lisacrost: I just found this beauty at a U-Bahn station in Berlin: A subway map that shows the amount of passengers with line… "
"I have this weirdly vivid memory of being at Boston market labor weekend 2012 and being really depressed lol"
"RT @savethecheetah1: Tragic consequences of having of more Starbucks than cheetahs https://t.co/PMQY1C9IBs via @torontostar"
"I want to get Starbucks, but I’m wearing uggs and a north face. I don’t want to complete the look 🙄🙄"
"RT @blackvoices: Princess Nokia reveals she threw soup on racist subway rider in viral video https://t.co/QFoOVRuNL0 https://t.co/rI0Hbdj4SC"
"Forever 21 Taco Bell clothing: See the entire collection now in stores https://t.co/S4n6cXB3Bf"
"Please make my driverless car have a snarky attitude!  Ex.  Me - McDonalds please - Car - so we are being healthy today."
"RT @KidRock: If you’re in Detroit, stop by one of the registration tables at Little Caesars Arena. https://t.co/nwOnr1xAxk"
"@Wendys not sure if your aware but they made you a anime woman now? I don't know its weird what are your thoughts o… https://t.co/8oOfyGdfeV"
"@mmeghhan @meechonmars @BurgerKing @Wendys Haven’t been to Wendy’s since 💁🏼😂😩"
"Please STOP bringing back the 1990s, especially the prints. It was not our finest fashion era. https://t.co/95GFDW3V5D"
"Lady if u roll your eyes n say cinnamon almond macchiato at me one more time I’m gonna send u straight to hell n g’luck finding a Starbucks"
"Octopus toss earns man lifetime ban from Little Caesars Arena https://t.co/V7CaX14vqv"
"Just spoke w @DetroitRedWings who say he's NOT banned for life. Was ticketed and released. Long live OCTOPI! @cbc https://t.co/SPArq7oitc"
"This is a joke https://t.co/r5mp5PGy9k"
"RT @melodybaetens: Starbucks Reserve opens in @WestinDetroit and @gmrencen gets 2nd Starbucks https://t.co/nmagJ5TTMx via @detroitnews"
"Phew! https://t.co/7dF2FhgUdP"
"RT @HenryMakow: Poster at downtown Toronto subway station. Society has embraced decadence/Satanism. https://t.co/O0mYYbqG7s"
"RT @JayNoHoes: \"Yea lemme get uh number 5 with a large COKE” https://t.co/zJvr3zN7Bj"
"RT @spiritbor3d: princess nokia throwing hot soup on a racist white man while riding the subway is my fucking mood"
"This hour be listening for a song by Xscape or Monica to win tickets - before you can buy them!  \n\n@TheGelloShow\n\nhttps://t.co/pnOSL1jzYu"
"We're #hiring! Read about our latest #job opening here: Standale Meijer Starbucks Barista - 315 Wilson Ave,... - https://t.co/9DWWRvltdc"
"I was debating if I should stop for Starbucks when Journey's \"Be Good to Yourself\" came on. So naturally I stopped for Starbucks"
"RT @transgirlsonic: you guys have no schezwan sauce? no- i want schezwan sauce! \nwhere's! my! schezwan! sauce! im PICKLE RICKKKKK, WUBB… "
"Honestly, I think people should pay me to replicate the @McDonalds schezwan sauce, not the Big Mac. BUT WOULD IT BE… https://t.co/MYfpiZIhsy"
"RT @Eron_the_Saint: Burger King is mad petty. 😧😭 https://t.co/Eyrdu3t4qJ"
"RT @Sarah_Hyland: The problem with being single isn't the fact that you're alone. It's that you can't puppy dog eye a guy in to getting you…"
"We ganna just act like that innocent man on the sideline didn't get hot soup all over him? https://t.co/km0dyP6UNL"
"RT @SethShaffer: #SuggestedTimsItems\nIf I say Starbucks stuff, am I banned from Canada?"
"RT @browssfordayss: This was executed beautifully https://t.co/jV6VfhgJRP"
"Basically 🤗 https://t.co/1vWZ8P4Alr"
"my dad brought me Taco Bell? I love my life"
"Complete bullshit https://t.co/IciL4q36NY"
"RT @Simpboyz: yall see a criminal I see a entrepreneur https://t.co/1rjMo75vgd"
"RT @ajplus: Rapper @princessnokia confirms she was the person who threw soup at a man yelling n***** at kids on the NYC subway. https://t.c…"
"Today is the first day in the week that I'm getting Taco Bell and I'm proud of myself #progress #iwouldeatiteveryday."
"More food places allow you to just mail it in. @SUBWAY joins a host of other semi fast food to order on your mobile device. #LetsNotTalk"
"RT @CauseWereTexas: Whataburger https://t.co/h3JB1QvQOv"
"GTFO @DetroitRedWings you better realize what mistake you're making! 😡🐙 https://t.co/KF0NTn6Xw2"
".@Arbys venison sandwiches available at all Michigan locations this month @mdurr84 https://t.co/9TbPF2QHAC"
"Another mean teenager brat was in Burger King being rude to the cashier. SOMEONE HIT THESE CHILDREN."
"RT @espn: It doesn't get much better than this!\n\nVote for the winner of this week's @Wendys #RivalryBeef matchup below:   https://t.co/BcXe…"
"‘NYU Law’ Grad Hurls Racial Epithets On Subway… Earns Bowl Of Soup To The Face https://t.co/bJXt420aAc"
"Why am I humming \"Deer Prudence\" https://t.co/2TfQAgUsso"
"@BuffaloSabres @TimHortonsUS starbucks has way better lattes"
"Dearest subway,\nThe sauce to lettuce ratio shouldn't be 1:1.\nSincerely, drowning in mustard"
"I just checked in at Marriott-Starbucks with #CricketRewards Download today!  https://t.co/cTWUrKTRJU"
"Three people I worked with at Subway have posted on Facebook asking who’s hiring today 😂😂"
"@jeremysa214 where did we go wrong https://t.co/4iDaZYLT01"
"RT @LoneWolfStanley: The Wall Street Journal called me about a @dominos joke I tweeted. If I get free pizza for life I'm opening a bed and…"
"Ppl posting their mains reminds me of the time that we were at culvers and one of the cooks came out of the kitchen to tell us he mained dan"
"RT @shayostyn: #FreeNick he ain't done nothing wrong https://t.co/UZXwJM4FAH"
"RT @_DatBoyQuan_: @_ASAPKilla Lol disrespect to authentic Mexican food, Taco Bell trash"
"RT @TheDweck: Why has Hillary stayed silent about this??? https://t.co/A8BR3J1lLe"
"Free my mans https://t.co/OmmCh9hKWq"
"Noooo, that's stupid https://t.co/lxJFfnyAOq"
"@Wendys Dave’s Cherry Cream Soda? You sneaky suckers, this shit is the bomb!"
"RT @Progressives20: RT wokehillbilly: McDonalds This sign is posted at your restaurant in Xenia, OH. Try paying a living wage. #Fightf… htt…"
"There are few things that annoy me more:\nMe at Starbucks: “Hi, what can I get you?”\nCustomer: “Venti Caramel Macchi… https://t.co/jNxQikxLS8"
"Well first we were gonna go eat Chinese, then I wanted macaroni so we were gonna go to KFC and we end up at Applebees😂😂😂😂"
"@Bease21 @Whataburger That spicy 🌶 ketchup is something else!!!"
"RT @tacobell: Feast your eyes on the new @Forever21 x Taco Bell collection. #F21xTacoBell https://t.co/ZHhEGdhALQ"
"RT @TraverseTicker: New retail center with fast-food restaurant, two stores planned for US-31 across from Panera Bread: https://t.co/AR3TQf…"
"RT @Texasmith68: I've got #MichiganState to take the W in this week's @Wendys #RivalryBeef. Who's got your vote?\nhttps://t.co/RSCJWcZAqc"
"i want like one of those stupid starbucks mocha frapes but i dont want to buy one and i cant make a good one with the stuff i have Dx"
"Papa johns pizza is the best pizza"
"Ok I ain’t wanna do this but I’m finna go to Taco Bell"
"@heck_shootin @awesome_somet @JeffIs_PichuTG @NormieDude @BlakeCrazyGamer @McDonalds @Shmevety @GrapeJuiceFan… https://t.co/0M6fddsGv9"
"Where😂 https://t.co/JLv20JmQnw"
"RT @McDonalds: You spoke. We’ve listened. Lots more #SzechuanSauce and locations. Details soon. And that’s the wayyy the news goes! https:/…"
"Retweet, Like, and Comment! https://t.co/pwalQyrgGj shared #Drunk #Racist #Picks #Fight with the ...… https://t.co/es6kcltb4o"
"starbucks is hoppin rn and laura and I are forced to sit next to eachother 😒"
"Check out: Mid-engine Chevy Corvette spied on public roads — and at McDonald's - Autoblog https://t.co/5EscucOOHO via @therealautoblog"
"Suck it PETA! https://t.co/61XQS3gjaq"
"Chipotle queso actually kills it"
"@bencardozorules Taco Bell, Chinese places, subway"
"Straight Outta Mcdonalds: https://t.co/ICr6hGrgvQ via @YouTube"
"freep​.com &gt;&gt; Red Wings: Man not banned for hurling octopus in Little Caesars Arena https://t.co/l3KyKgm02b"
"Smelling Taco Bell at study tables makes me want to head out and get some for myself. I am not sure if this is normal, or if it's just me?🌮😬"
"RT @freep: Red Wings: Man not banned for hurling octopus in Little Caesars Arena https://t.co/MtBeADphTa"
"RT @Dstrick27: Free my mans https://t.co/OmmCh9hKWq"
"The \"MR T\" Laurence Turearud,my dad, and Tom Sheroski from Little Caesars!\n\n\"Pity the fool who doesn't order a HOT n READY 🍕"
"When you love Rick &amp; Morty so much your Nazi ass throws a tantrum over nugget sauce https://t.co/baa2U7cmwd"
"RT @jas_renae: that dollar menu aint gross when u got $2.13 in ur bank account thats all im sayin https://t.co/oNBOkHlYrb"
"RT @oraltwjnk: YASSS LADY WITH THE SOUP GO BEST FRIEND THAT’S MY BEST FRIEND https://t.co/lnxF22xPpQ"
"They took too damn long tbh https://t.co/2TiVri84Zh"
"@ryleesmakeup Hubby hates taco bell but 2-3 times last month buy box meal *for me*  REALLY so he could get codes to… https://t.co/auM9eMqwJS"
"Red Wings: Man not banned for hurling octopus in Little Caesars Arena #RedWings  https://t.co/qdvZdwbcTW https://t.co/SS9qWLQknQ"
"RT @siriusxblvck: The Szechuan sauce fiasco proves Rick and Morty fans don’t understand Rick and Morty https://t.co/tfe0EwpSQ0. I hope yall…"
"This girl keeps complaining on fb that she has to “do everyone else’s job and hers” and shit like bitch you work at subway"
"RT @realfriemds: Can someone take me on a Taco Bell date"
"RT @anallievent: Got leftover doughnuts? Make Krispy Kreme Bread Pudding with Carmel Pecan Sauce! Yum!  https://t.co/9aeTv4S1xp… "
"RT @DRIbauchery: Lmao @ promoted by Burger King https://t.co/eELIogCJLq"
"I swear I’m fat😑 Taco Bell is my life"
"RT @_crownxroyal: How the fuck McDonalds IN WALMART don’t have caramel???? Bitch go get it"
"Cute https://t.co/AcKRVfNJAv"
"RT @callmeshitto: haha brooke i see where u wished happy national boyfriend day to taco bell on instagram. i get it like taco bell is ur bo…"
"OMG @Wendys your new kiosks for placing orders is ridiculous. #badideas"
"Honestly offended that @Forever21 only has 4 pieces available in Plus sizes for the Taco Bell collab. Y'all serious with this?"
"when you have to get Burger King because your mom hasn't went grocery shopping in 3 weeks and now you hate yourself"
"RT @WWJ950: Does the punishment fit the crime? https://t.co/yAlbamQv6J"
"@amysimons @Starbucks Me too.....I hope it’s a phishing scam 😅😅😅"
"Move the team back to the Joe, this is ridiculous. https://t.co/7jY2Nd9lLB"
"@NewfieGal647 @StevenGMcCann @Krystal You better go stock up on protein bars or something. I would be psychotic mes… https://t.co/3OsewYlaZT"
"@Koogs46 Taco Bell cheese quesodildos, fiesta potatoes, and a ninja turtle. Do it asap"
"RT @chrissyteigen: It's in the first one dammit jorden https://t.co/E08E7KagZW"
"RT @jimpjorps: at Taco Bell; woman ahead of me is trying to order a “chocobo supreme” and will not work with the cashier to figure out what…"
"RT @CBSDetroit: Does the punishment fit the crime? https://t.co/XZQWo7TL6K"
"i've been watching @kfc ads for 10 minutes and i feel something unlike something i've ever felt before"
"Is this real??? https://t.co/NcpiHJ6Dzy"
"Aaron keeps pronouncing jimmy johns as \"James Johnson's\" like get out 💀"
"@SubwayListens Ain't pointing fingers here, but @Wendys didn't have no \"jared\" situation."
"@Liquid_Diabetes Jimmy johns. #Areyoutriggered?"
"@dominos My pizza isn't even cut. Smh. 😒😒 https://t.co/mOYkEKb0Ew"
"RT @Wu_Tang_Finance: YO: Things that are a waste of money n hurt yo personal finances:\n\nStarbucks\nBoozy Brunches\nApple product churn\n@nytim…"
"Does this seem harsh? https://t.co/jK7ugsvTks"
"RT @sbellelauren: WELCOME TO THE RESISTANCE CHIPOTLE https://t.co/lnNQkAfsS2"
"All I want in life is Taco Bell"
"#LastChance: We're giving away 4 tickets to the Pistons' season opener at Little Caesars Arena. Enter by midnight.… https://t.co/ozAl2Br6jI"
"Grandma got my 1 year old son a Jack In The Box for his 1st birthday. Why? #wtf #grandma #clowns"
"I’ve worked @Starbucks so long I can taste when water isn’t quad filtered."
"Princess Nokia Throws Hot Soup at Subway Racist: Video https://t.co/yjjO7J6Qp9 via @pitchfork #BlackGirlsRock"
"Fast food giant Taco Bell to open first Scottish  eatery #breakfast #food #dennys #ihop https://t.co/4HTtdcdB6I https://t.co/mkgzyIZAk6"
"RT @griffin_hager14: Free him! https://t.co/vKJn3ECcaJ"
"McDonalds bag in the fridge after too many shots with Tiff lol  #WhereIFoundMyKeys"
"ya girl is now a Panda Express worked"
"RT @GVDeeZees: Need a treat for this gloomy day? Come join us at Dairy Queen tonight from 5-8!!! 💗☺️ https://t.co/UpS5IfG6l5"
"Hey @Starbucks I got an email about bingo and activating my board but every time I try I get this notice\n\nThe email… https://t.co/miQ7CLZNnd"
"Maple Pecan Frapp I just got from @Starbucks tasted like absolute dog shit. Worst thing I’ve ever had from there."
"RT @JustOneFry: I've literally had nightmares where I was eating McDonalds or putting a relaxer on my hair. Not about to die, but a… "
"RT @Devin_Heroux: It's been the focus to move from larger cities to places like Brandon to grow the game and let the community embrac… "
"@WWJ950 @Arbys Pass #NoVenisonEver"
"RT @conorpatttt: a crowded subway.\nsomeone licks my arm.\npanic. disgust. fear.\n\nit’s a puppy in a bag.\nwarmth. jubilation. euphoria. \nlady,…"
"i need someone to get me starbucks so i don't fall asleep at work because i can't leave the storeee🤦🏽‍♀️"
"okay why the hell did forever 21 and taco bell collaborate on a collection"
"RT @QueenChanteee: * eats chicken sandwiches * \n\nperson: YOU KNOW CHICK-FIL-A IS RACIST! \n\nMe: oh forreal? Damn thats crazy\n\n*dips in polyn…"
"Bringing @_Dana_Bosman_  to Chipotle for her first time has been the highlight of my week 😂🖤"
"okay but when will you bring back chicken tenders https://t.co/6zSuI2JYlA"
"I told myself I was gonna cook dinner tonight but then Alexis asked me if I wanted Subway. Welp."
"RT @AdvertiserTimes: #LastChance: We're giving away 4 tickets to the Pistons' season opener at Little Caesars Arena. Enter by midnight.… "
"@TheHartProject1 Trying to order? Learn how to enable Tweet Ordering in your Pizza Profile: https://t.co/qTNEsvUu9t\n [18:19:36 EDT]"
"RT @waynestbaseball: Come out to Chipotle Oct 20-21 &amp; support WSU Baseball! Save the Dates https://t.co/UO71hGcWXC"
"In case you're one of the people thinking differently and screaming about the ban... #RedWings https://t.co/VjDLgKbZuK"
"Don’t know about you but think they should change the name of the kid rock café in the beautiful new Little Caesars Arena. Makes me vomit."
"@Wendys Amazing is an understatement!"
"@BigDrewandJim @bigdrewCON No ban from LCA https://t.co/BuUz7QVUhp"
"LMAO WHAT https://t.co/F1Nr3Ydqd6"
"I’m really in need of some Pizza Hut crew fun I’ve had such a shitty day"
"RT @NFL: Top @NFLfantasy performers from Week 5! (pres. by @kfc) https://t.co/fLeqTBcTDM"
"@MJRen_Wick @tacobell @FranksRedHot @Clancys_Fancy @thebrinery Taco Bell reigns superior in whatever you're talking about."
"None of the dominos near me deliver and I’m so sad. I just wanted a pizza. ☹️"
"Gordon, Brady, and Broncos Defense are carrying my fantasy team rn https://t.co/VYVOd2Gs8y"
"@_the_snipes I just saw this post again. My mouth is literally watering, thinking about how good Chick-fil-A would be rn 🤤"
"RT @JaideKennedy: In line at Starbucks and I felt like doing a good deed just paid for the person behind me in the drivethru always remembe…"
"My aesthetic: Ariana Grande ordering a Grande at Starbucks. https://t.co/AmuPTPsMlM"
"I'm trying to eat Taco Bell on my bed and my dog keeps trying to eat my tacos like fuck off"
"Man I wear some whack stuff but this is on some other level https://t.co/fP8b2FBGam"
"s/o to the cute girl at work for getting me Starbucks bc I didn’t feel good;"
"RT @ThereGoesWill: Dude hit the manager with his car twice and drove off. He’s facing felony robbery charges over a soda at McDonalds… "
"RT @Browneyedbethy: “Okay, best idea ever and exactly what the people want. Taco Bell clothing line.” - someone from Forever 21 who makes t…"
"Sources confirm that Trump could be heard running to his room, playing the cure, and not touching his KFC dinner pl… https://t.co/gcTxDVpVYZ"
"i need to work on my bread making skillz but it actually didn't turn out bad n i just need to season this shit like subway does next time"
"RT @consequence: .@PrincessNokia has no time for drunk racists on the NYC subway. https://t.co/fffOEFJmJw"
"You’re kidding lol this is a red wing tradition, fuck off https://t.co/Je7s8NtUkl"
"I've never been inside a Chick-fil-A before."
"Hunting season is here: Arby's tests elk sandwiches and releases venison sandwiches nationwide https://t.co/sKlW5K4Tti"
"but it was fine at the joe? 🤔 https://t.co/sKMURWLCiA"
"@BurgerKing is savage for promoting this tweet 😂. But on a serious note, why @Wendys?! 😩 https://t.co/0I0ZUGoOzR"
"@_aria_s_ McDonalds rereleased sauce in limited quantities last week. Fans got angry because they couldn’t get it. Bad things happened."
"believe it or not i used to co-run a sungah page on tumblr... 2 years later i make jokes about her working at burger king"
"Ben Affleck cupped my sack at a Dunkin Donuts in 2009. I would like an apology."
"RT @beelen_kaylee: Bringing @_Dana_Bosman_  to Chipotle for her first time has been the highlight of my week 😂🖤"
"Jack in the Box is beyond trash"
"RT @samholley20: You’re kidding lol this is a red wing tradition, fuck off https://t.co/Je7s8NtUkl"
"RT @APetrelak: In case you're one of the people thinking differently and screaming about the ban... #RedWings https://t.co/VjDLgKbZuK"
"RT @amandaJpahl: All this talk of @Eminem and @realDonaldTrump, here’s where the real beef is, with @BurgerKing and @Wendys https://t.co/cC…"
"I could eat subway everyday"
"RT @XXL: Watch hero @princessnokia dump hot soup on a man yelling the N-word on the subway https://t.co/JYHuQJszU9 https://t.co/n0D8VY7MAP"
"I've been doing homework for 7 hours now and I just want Chick-fil-A"
"RT @captaintrash: remember on coming out day that LGBTQIA stands for Lets Go Buy Taco (Bell) Quesadillas, It's A (good meal)"
"Pizza Delivery Wembley | Quality Pizza Delivery In Wembley - Papa Johns https://t.co/2Y674FrNAv"
"@SheldonTTW @Wendys @McDonalds 🙃 isn't that McDonald's lol"
"RT @LimitedRunGames: Our physical release of Skullgirls on PS4 has arrived! @Skullgirls @Arbys https://t.co/gZ5J5PZERA"
"I needed a good laugh. So I just spent the last 30 minutes looking through @Wendys Twitter."
"Little caesars is fuckin 🚮"
"grandpa put Delanie and i in a group chat to show us that he puts mustard on french toast. it’s his favorite other than white castle burgers"
"First tweet from iPhone. @Wendys ghost pepper chicken sandwich when"
"RT @jerichobrown: You can indeed ride the subway or dance in a club without fondling a woman no matter how fine they are. This is a possibi…"
"RT @cvaldezz: I want every item in the forever 21 Taco Bell clothing line"
"RT @rvcheal: i'm sorry who even asked for a forever 21 and taco bell collaboration"
"RT @Drops: dont call yourself goth unless you travel with ravens on the subway https://t.co/IJ9yvMGCHE"
"RT @YaFavAuthor: Pizza Hut Is Nasty Af 🤷🏽‍♀️ Lets Argue"
"The Pizza Hut pizza Parka is about to be a must have for hypebeasts."
"I really want cookies from Subway 🙃"
"RT @ABCWorldNews: Starbucks executive chairman Howard Schultz: Cutting the corporate tax rate would be 'a mistake'… "
"“Sometimes I dream about little caesars” @Maddy_wright12"
"... You're telling me Forever 21 created a TACO BELL CLOTHING LINE????"
"Is Boston Market food?, I've never eaten it 🤔"
"Heroes 😍 https://t.co/42P2DigNMZ"
"RT @RusSwole: I can’t wait to eat a calorically dense meal that will knock my ass out. Like man... Whataburger with a nice pint of Ben &amp; Je…"
"So I had Chick-Fil-A for the first time today. It was good and fresh but to be it’s not ALL that. Them waffle fries were good as hell tho 😌"
"Since when is chick fil a cheaper than McDonalds???"
"@msjteach @SJAM_HWDSB @Starbucks @Dundas_ValleySS @Theburnttongue So logical! My mobile order game is going strong this semester 💪"
"@judymulatto I’ve never had Starbucks. Not once."
"I wanna be a walking Pizza Hut ad this winter https://t.co/0EET1QiP1B"
"RT @ChronoReyer: Ppl posting their mains reminds me of the time that we were at culvers and one of the cooks came out of the kitchen to tel…"
"True a.f https://t.co/4V5rjlcNLM"
"burger king playin games on my tl https://t.co/RGmFszzlUR"
"@ODlewati @madelynnj3 YA THAT PERSON IS ME OK SHES ME IM EXCITED I LOVE TACO BELL"
"RT @sparkfun: An autonomous Jack-in-the-Box using a #RaspberryPi &amp; Pi Camera to detect when it's being looked at. #DIY #Halloween https://t…"
"@JuliaRadio987 It was some starbucks but pretty much!"
"Okay that hooded windbreaker though... 🤷🏻‍♀️ https://t.co/rwMKAqVcYe"
"RT @ad_richhh: All my problems would be solved if Monroe had Chick-fil-a &amp; Jamba Juice"
"I heard that new @McDonalds secret sauce taste similar to @Zaxbys sauce...... 🤔"
"RT @RichieIsEvol: @Wendys why...? Spicy nuggets....... RIP 🙏😔"
"@Dynamic_Suave @McDonalds We need answers"
"jimmy johns cookies r so much better than subways don’t @ me"
"RT @dumbbeezie: I took someone else's coffee at Starbucks. I'm Tiffany now"
"wowee just spent the last $2.98 in my bank account on a jimmy johns sub and i don’t regret it"
"I get what they're trying to do, but that isn't for me. If I get Chick-fil-A again, it's drive-thru only, please."
"Well played!!!! https://t.co/kC2wsZrcn1"
"Omg I'm having 90s flashbacks to Burger King 1st movie toys. Nostalgia https://t.co/LZRL6zEMcg"
"@Lady_Tyrant So you're not eating chipotle 7 times a week anymore?"
"RT @AMike4761: McDonald's employee fired for refusing service to police officer. GOOD for McDonalds!    #ma4t  https://t.co/MiFmyYgDC2"
"RT @bsilv23: When your women is having a bad day, bring her Taco Bell. #itsacure"
"RT @amomontheside: Get ready for National #CheeseCurdDay at @culvers with the chance to WIN FREE cheese curds! 🧀😍 #ad… "
"RT @Tzonick: Why even call it a burger https://t.co/ZXkkC10Slr"
"I hope chipotle open by the time I get home cause I been craving some 😋"
"RT @WPLGLocal10: Man in custody after masturbating at Panera Bread, police say https://t.co/TpY2zbxCkU https://t.co/bOz1pQGT0e"
"Waited 25 mins for my Taco Bell and I was the only one in line...🙃🙃🙃"
"I'm doing hw &amp; my mom want me to go get dairy queen.."
"Taco Bell would be a lot cooler if it were an actual bell that you ring that makes tacos magically appear"
"Arby's tests elk sandwiches and adds venison nationwide https://t.co/J14LZxeThx via @@wzzm13"
"taco bell w/o fire sauce is like @gracerekeweg16 w/o her sophomore boys!!!"
"RT @jacqve: when kreayshawn said 'bitch u ain't no barbie I c u work @ arbys'\nI felt that shit"
"I think Panera bread is overrated af"
"Left work a little late, forgot the boy had Lego robotics class tonight, and need to study tonight. 8:00pm Starbucks it is."
"Ive had Dominos ONCE and I’m still a Pizza Hut Stan 😂😂😂 https://t.co/dOggIyjHzB"
"RT @Julia_Chaney: @Mixedgirl_1 Yeah now my Starbucks experience will never be the same w/o you in it"
"RT @kingzakyia: That F21 x Taco Bell collab looks astounding"
"#computing #technology #ITsecurity #tech #CES Pizza Hut parka keeps you toasty like a fresh slice of pizza - CN... https://t.co/kHkRmhzg5X"
"RT @BieberBonerz: My mom won't even buy me McDonalds https://t.co/PcTP5rozbK"
"RT @Laj_TooCool: Lmfaooooooo RT @_crownxroyal: How the fuck McDonalds IN WALMART don’t have caramel???? Bitch go get it"
"Build A Subway Sandwich And We’ll Reveal Your Secret Sexy Talent https://t.co/wiIAJrm3fI"
"RT @BuzzFeed: Forever 21 thought outside the bun and launched a collab with Taco Bell \nhttps://t.co/gDwuaCeZA1 https://t.co/Cb63ddrtJr"
"if tim hortons could deliver a large vanilla iced capp to my front door rn, that’d be cool🤷🏼‍♀️"
"When the cashier at arbys ask for my name the other day I said ashton, that's what I want to name my son when I have one"
"Can't wait to try these free coffee samples from dunkin donuts! Also… https://t.co/nqoaY0QBKr"
"RT @SwampyTrump: Shouldn’t trump be dead by now from choking on @kfc bone or orange tanning spray and/or hairspray overdose?"
"@SwampyTrump @kfc We're all hoping something will finally take him out!!😁"
"RT @artrbl: jay said \"let's get it\" at the end of his subway ad who wants to call the police https://t.co/nnpLw4azkN"
"@nickyr0mer0 @diontimmermusic Panda eyes + mr timmer = Jesus Christ eating taco bell"
"Lmfaooo https://t.co/VrkR3g0lae"
"The way my bank account looking rn, Taco Bell too good for me. https://t.co/5zVEUMBScf"
"RT @TheCubicleChick: Cheese lovers unite! National Cheese Curd Day is 10/15. Read how to celebrate at @culvers! https://t.co/U7dZGgxAPs #Ch…"
"My mom called me a Taco Bell dilemma but I told her I had to go because the interesting part was coming up in Harry and the Henderson’s"
"Starbucks is so over rated. I had strawberry green tea from there today as its on their “refresher” menu, why did it make my mouth dry..."
"RT @lejonpettis: Taco Bell: *announces they have a clothing line at Forever 21* \n\nMe: https://t.co/L7dMn7bDt2"
"Arby’s To Sell Venison Burger At All Metro Detroit Locations — For One Day Only « CBS Detroit https://t.co/9Gt0fR7qKp"
"Hell yeah like wtf you pulling out $1200 at Mcdonalds 😒 https://t.co/wLl19nPBps"
"@Vic_Sinishtaj Pizza Hut x Supreme"
"When Taco Bell gives you 5 Cinnabon delights instead of the 4 that you paid for 😩😩😩💯"
"Asked to donate a dollar to something for a free slider, this is my fifth time not getting the coupon for the free slider @Arbys"
"@Veronickuhhhh @itsBiiTTERSWEET it is my dog but i dont wear skinny jeans or nerd glasses and drink starbucks. jebaited"
"RT @nasrissist: a nice fall activity https://t.co/5PvtE4saBX"
"Someone take my debit card and buy me Taco Bell cause I can’t leave"
"Someone from my Bumble days came into Starbucks and I came face to face with my dark past"
"RT @_beann_: Little caesars is fuckin 🚮"
"RT @officerjeon: \"yes this is mcdonalds how can i take your fuckin order\" https://t.co/lJjSWbjbea"
"Getting a bite for the road (@ Taco Bell in Howell, MI) https://t.co/R9v7spb0Zr"
"Think ima go mess with this chipotle"
"I love it when I go to sip my delicious Dr Pepper from @Wendys and the flavoring was empty. Pls halp https://t.co/iNOonJFnRu"
"Didn’t let myself get Taco Bell on campus because I should eat healthier only to come home and get Taco Bell because there’s no food"
"I just ate so much Taco Bell"
"Hi Everyone, I am selling our Wings tickets at the NEW little Caesars Arena for this Monday vs. Tampa Bay... https://t.co/eKDT1eAM44"
"They had to plan a year in advance for this one day only event. https://t.co/BYIbrypOSp"
"Halloweeen Event Oct 25th 4-6pm! Thank You Sponsors! @msufcu @cadl @culvers @HyattTweets @SuburbanIceEL… https://t.co/RokGTiX1KS"
"Any live fact checkers on this #Trump @seanhannity interview??  Three minutes in and I'm exhausted counting the lies."
"dying to check out Little Caesars  Arena still"
"Dude this album is wild. @ Taco Bell https://t.co/dKXipRc0D5"
"#subway is better than sex"
"One time I took a shit in @Wendys parking lot cause there doors were closed and I didn't want to shit my pants."
"RT @ugIyperson: \"i need to lose weight\" as i order what i want from mcdonalds"
"RT @CptnClout: The way my bank account looking rn, Taco Bell too good for me. https://t.co/5zVEUMBScf"
"@MatthewFKoch @KFCBarstool @TommyG \"First time, long time KFC. DIEHARD Yankees fan here but that last caller doing… https://t.co/LH1NKmXqJe"
"PROMOTED BY BURGER KING https://t.co/0APBKXsBVd"
"Boston Market..."
"Please @Wendys bring em back. Id sell my house for the spicy nuggets. Id carry a couch for them nuggets. I'd leave… https://t.co/swWTYGPoaP"
"Give this man lifetime season tickets https://t.co/YcSelWE1md"
"What disrespect for @SUBWAY https://t.co/Rxc5fXktsg"
"RT @Larkinsomnia: Y’all act like this is gonna stop anyone https://t.co/YBkYOzGXuL"
"RT @bananabillll: If homegirl eating at McDonalds, it's quiet forrrrr her"
"RT @lawrenlikesit: Found out today that there are people that actually eat at Burger King? And not just use their parking lots for drug dea…"
"RT @jackiekcalmes: He's confusing his proposed rates, calling things \"a 1st\" when they're not &amp; promising tax cuts so big even an R Co… "
"CAN THIS KFC AD STOP FOLLOWING ME"
"RT @DrCrane72: @eileendefreest Favorite Food = Sauce = #FakeNews\nMore &amp; more people confirm Trump's fav food is well-done steak &amp;… "
"nothing but respect for my queen @princessnokia https://t.co/rTSsQZ7jKL"
"@SaraKSmathers Trying to order? Learn how to enable Tweet Ordering in your Pizza Profile: https://t.co/qTNEsvUu9t\n [21:37:21 EDT]"
"@Wendys ?? @BurgerKing ?? What is happening here ?? https://t.co/qv0bIyXGNh"
"Venison sandwich available nationwide this year. Will you be trying it?\nhttps://t.co/f8Rgayx2By"
"Free this man https://t.co/pUFeWoBaFE"
"Who wanna take me to Taco Bell?👀👀👀"
"I CAN BUY THAT PITCHER PLANT. I CAN AFFORD GROCERIES. I CAN FILL UP MY CAR. I CAN EAT. I CAN GET BETTER PIZZA THAN LITTLE CAESARS."
"No, he's not. Red Wings have denied he is banned. https://t.co/xF99fIpGgk"
"RT @55mmbae: Way too good https://t.co/YB0fKrgmeF"
"Oh my God!!!!!! I'm calling in for this!!!! I'm sure Bri will love this!!!! \n\nhttps://t.co/m14WDHqtLo"
"RT @siennamv: pray for me, ya girl has an interview for a second job tomorrow @ long john silvers 😛😭"
"THERE ARE TACO BELL CLOTHES AT FOREVER21. NOW IS MY TIME."
"@princessnokia The guys a piece of shit no doubt but whyd you have to take the mans bag? Wouldve been over once you… https://t.co/HP4o5gf0NI"
"Youth Hang-Out Wednesday started tonight. Join us next week as we go to McDonalds at 6:30pm.  Student worship is al… https://t.co/FRAqUvoZ05"
"Good. https://t.co/VEjDF20X9U"
"If you get me something, I’ll take you https://t.co/CzN1wNCQEv"
"RT @JasonColthorp: Just spoke w @DetroitRedWings who say he's NOT banned for life. Was ticketed and released. Long live OCTOPI! @cbc https:…"
"#WednesdayWisdom maybe be more prepared for when the dinner rush comes @Wendys in warren #DriveThruDrag 🚘🤦🏼‍♂️"
"So stupid. https://t.co/0IdMsrXooM"
"Can’t believe we have to throw perfectly good soup at the trash smh https://t.co/9ISAPrM2aA"
"@awid__ @BurgerKing @Wendys God dammit I love social media 😂😂😂"
"RT @sethmarano: I've got #Michigan to take the W in this week's @Wendys #RivalryBeef. Who's got your vote? https://t.co/A5CKigtFKP"
"@sethmarano @Wendys Good game guys"
"Haha Burger King is sponsoring other people roasting @Wendys now lol 😂 https://t.co/mWkmxd1uPb"
"RT @HashtagGiants: #ILookAtTheWorld and see an incredible number of McDonalds restaurants. https://t.co/JJTXgHgDak"
"@samfrankie97 @Wendys @BurgerKing That explains a lot"
"RT @josh_boggia: Don’t care how basic this makes me sound but going to Barnes &amp; Nobles, getting Starbucks and looking for new books would b…"
"@Allison_2k17 No they have a biggby tho. But sometimes I want Starbucks!!!!!"
"RT @warrenkluck: Burger King has launched spicy nuggets. A day later you will be the one launching spicy nuggets."
"RT @SupremeAce_: this chess not checkers."
"@American1765 @altrobertalt @snowconejustice @Bose @budweiserusa @Barclays @Bridgestone @Campbells @Castrol… https://t.co/t29A8ml99u"
"not impressed by the women on Here that say they know good sex. There's women getting bad sex but got a good life. You fucking for chipotle"
"On top of that I'm hella hungry lows 😒 guess I'll eat some nasty ass @McDonalds"
"Jersey Mikes&gt;&gt;&gt; https://t.co/v4wfT2Rsru"
"RT @TYhsXsc__: Why go to Taco Bell when you can go to a real Mexican restaurant?"
"I had like 4 pieces of pizza and a burrito from chipotle 😕 ... ima be obese"
"RT @995WYCD: Does the punishment fit the crime? https://t.co/5RmMJYbJRn"
"RT @engadget: Pizza Hut Parka keeps you as warm as a pizza: https://t.co/0441XQ1wOY https://t.co/eRJQG9flom"
"Now I want White Castle 😰"
"It’s @Wendys o’clock https://t.co/MtkmktIPny"
"RT @trillityrob: SUBWAY DONT FUCKEN @me https://t.co/xsYfartEK1"
"RT @JordanRomano4: She sucking dick at a church then kissing on her \"man\" at mcdonalds. Hmmmm🙃🤔😂 https://t.co/JjMBzEOgR4"
"Is it socially acceptable to dip your chicken nuggets in a Wendy’s frosty? @Wendys"
"Subway hands down 💯 https://t.co/Ucn1p8tuIz"
"RT @tchidakayla: “Sometimes I dream about little caesars” @Maddy_wright12"
".@tacobell @Forever21 have teamed up for clothes that looks like you picked them out 3A after too many tequila shots https://t.co/zAGt9vYzxD"
"roasted sweet potato wedges + chipotle mayo = sex"
"Lmfao another @Wendy's tweet sponsored by @BurgerKing 😂 https://t.co/idx6Ll8LRq"
"RT @DontCallMeCorey: @BurgerKing @RichieIsEvol @Wendys Your nuggets are nothing compared to Wendy’s nuggets how dare you try and compare"
