"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/F1cgD8QINy"
"RT @Lmao: 12 year olds are having sex and i can't even order in mcdonalds without panicking"
"RT @blackxmags: Zaxby’s &gt; Raising Cane’s"
"RT @Lin_Manuel: Good morning.\nI believe in you.\nNot always in our leaders, not always in the subway schedules, \nbut always in you.\nYou, unw…"
"@shoffmann40 @Wendys We ready!"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"@bobcarskadon Arby's Is Bringing Back Its Venison Sandwich\nhttps://t.co/ukc9YFQ31w"
"burger king promoting wendy’s loosing their nuggets is why they suck ass and will always suck ass"
"I want subway."
"why do i keep torturing myself by going back to panda express when it's somehow even worse now than it used to be"
"RT @KhadiDon: Eat enough Krispy Kreme donuts and you'll glow like one. ✨ https://t.co/vZOF5aiJo0"
"UPDATE: ITS MCDONALDS"
"I once demanded free chicken at KFC and they said \"fuck off kaolo koelie\". I reported this and their account is sti… https://t.co/I2QKfyuCDh"
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"Does it count as eating right is the pizza came from subway?"
"Sir, I am just up in this Subway for a $4.99 meal deal and unlimited refills, not to listen to you holler at your secretary on the phone."
"Petty Caleb has arrived. https://t.co/FQ95y2Thvj"
"RT @RadAlcoholPorn: When you're drunk as hell at McDonalds at 1:30 in the morning and the police walk in https://t.co/4nImETSnzK"
"Mane ion even ask for their ice cream nomo😂 https://t.co/z36eWKXDVg"
"RT @evaloria1234: @AmericanHotLips @ReneeCarrollPhx @McDonalds Omg please save that child no wonder they grow up messed up with that kind o…"
"*pays for Subway*\nWorker: Enjoy your meal!\nJack: You too!.. 😅"
"@shivasdancefit @brockcurrey75 @Jenlskelly @speaxeasy @TheRealStacyD @GiirlGerms @JanBujwit @ReneeGiraldy… https://t.co/SMycQxoNRy"
"Future Foods! Taco Bell Is Testing Chicken &amp; Biscuits https://t.co/2VJeSSdHD3 #stupidDOPE https://t.co/9k5fs1kwBK"
"RT @darnelchickfila: Chick-fil-A Southaven Cow Auditions for \"as need basis\" are Wed. Oct 11th 10am-1pm @ 917 Ferncliff Drive, Southaven… "
"Drop by the Campus Community Hub (next to Subway in Yamnuska Hall) tonight between 4 and 7 p.m. for Colouring &amp;... https://t.co/gAiDur6qA0"
"Taco Bell is really tryna see how far they can go with all this new shit lol"
"@crackrock_corb I steal sauce packets from Taco Bell"
"Bruh. They be at the Krystals on the corner. No lie. Same old heads. https://t.co/nANOLkp4Qt"
"RT @BrooklynSpoke: A millionaires tax won't fix this. https://t.co/DNlBCWftnS"
"Oh so like my Chick-fil-A is closed 😑what in the fork am I going to do now. This has been so disappointing, like loosing my first born."
"U don't like it? https://t.co/yjUmbnVED0"
"RT @FunnyQuotees: The time when McDonalds gave out good toys... https://t.co/98UgJk4drM"
"RT @FrenchCalhoun: Play Chess Not Checkers https://t.co/W9nOLrDcY0"
"Okay Taco Bell, if you don’t have a food item TAKE IF OFF YOUR MENU so I don’t try and order it."
"But still, thank you for the supreme burrito Taco Bell. Love you"
"16:05 Reported Accident at/near LITTLE CAESARS , 1725 UNIVERSITY AVE"
"RT @2fingasss: Whataburger https://t.co/YMzXF4Fr8k"
"We like venison! https://t.co/9YTI15tKWD"
"@apeiros_ Somebody said you gonna bring Chick-Fil-A to work for us 🤔"
"RT @ABC: Taco Bell launches limited edition clothing line with Forever 21 inspired by iconic graphics of the taco chain.… "
"UPDATE: Chick-fil-A may be closed but Mexican food is always a perfect choice. 🌮🌮🍸"
"Lol I knew better RT @SweetMeSydnei: Negative https://t.co/6xbKYO1vs8"
"RT @shaneynclan: courage in 2017 is when chipotle puts sour cream in ur bowl on accident and u eat it anyway."
"I think I’m like crazy addicted to Taco Bell and their tacos 😭😭 what is happening lol"
"I just checked in @SUBWAY with #mPLUSPlaces Download today!  https://t.co/e9uUzMqRUJ"
"*Wendys* https://t.co/6W954qeU4a"
"Who wants to bring this guy some Taco Bell? #butlikeforreal"
"RT @YourGfAdmireMe: I love a nigga that take his time instead of 2 kisses n now your dick out😂😂 like holdon swiper put jack back in the fuc…"
"Yeah... because everyone has wanted one of those. https://t.co/BJtfGRs6CJ"
"@McDonaldsCorp @McDonalds  brighton,mi location. Really?! https://t.co/zkmyugMHbY"
"Anyone hears word about a Chick-fil-A coming lmk #Corinththings"
"@MayweatherPromo I like the Korean BBQ behind the McDonalds on the strip"
"Y’all come eat at Chick-fil-A 5pm-8pm  right now to help support OBHS interact! If you put your receipt in the basket we get 20%"
"@USMspecialist @Collin_Mills72 I'll never forget the time we had 7am practice and all the specialist went to McDonalds."
"@awid__ @BurgerKing @Wendys Omg for realllll @aprilalbanil"
"@kfc Would like to know when the new @kfc in Hattiesburg, MS.  Oak Grove community is going to open?"
"Last week I asked the girls in my bible study if they wanted to meet at a different location this week. They voted Krispy Kreme #blessed"
"- I want chipotle and my back rubbed. 💆🏽"
"RT @PsychoJoeBKF: @AmericanHotLips @TamathaCastle @McDonalds I expect their respective communities to demonstrate in outrage @ the ra… "
"ok well i just sat in ur drive through for like 5 mins with no help so i’m salty @ y’all. i just wanted some fries… https://t.co/SRMOklJArc"
"RT @HausOfKiersten: other people my age are getting married, starting families, buying houses...and i had to unbutton my pants while eating…"
"We ❤️ 🌮's #TacoLovers #TacoBell #TacoFriday #TacoWithMyGirl @ Taco Bell https://t.co/wsJslE07Ex"
"RT @nihilist_arbys: Sure, shit's bleak, but remember: we're all gonna be so fucking dead soon. None of this matters.\nEat arbys"
"Yooooo stomachhhh be fucked up https://t.co/P5sa21W6SX"
"RT @sammyrhodes: Ordered a salad at Chick-fil-A tonight, and you know what, it was not my pleasure."
"RT @BTRowland: if you put mayo or ketchup on a chick-fil-a sandwich, you're the police"
"RT @kendallaltstadt: How are ppl not close with their moms? Like I call that girly just to tell her I got Taco Bell and usually all she say…"
"Y'all Burger King paid to promote a random persons tweet just so they could reply to it \n\nS H O O K https://t.co/5oQqlm5uuZ"
"You did it again @dominos you made my #pizza dreams come true https://t.co/6brMVETSIG"
"RT @Fwzfuse: #McDonalds a upgrade. That 4 for 4 at #Wendys more like it.....#WhatYouWantToDrink https://t.co/HxBa6957MP"
"@jeasley12 @Wendys No sir Texas is due for a win in this rivalry."
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"RT @Arbys: We have the Venison. 10-21-2017 https://t.co/sD4rZBOJRb"
"The Subway Portraits of Helen Levitt https://t.co/wFLT8dH4iR https://t.co/RVy0GZv8hH"
"@Wendys you always wildin out in twitter fam. Food good tho"
"@__vicccc and then goes to mcdonalds after you give him money"
"RT @LydGross: When you’re craving Chick-Fil-A but it’s Sunday https://t.co/gzHuHqV37m"
"@riley__madison did u tweet this before or after u got taco bell"
"This salad from subway 😜"
"Couple shares love of Taco Bell in wedding photo shoot https://t.co/wIknAGmKCl https://t.co/w2oWGGaodC"
"Young Subway https://t.co/skUr4n5lbQ"
"RT @JonDez_: Yo McDonalds why even ask me what sauce would I like with my nuggets if you’re not going to throw them in the bag."
"I'm giving away something for you on @Listia: Starbucks Rewards Code . Get it here - https://t.co/w0uNkr8YSR"
"I saw that today. Must be competing with Mcdonalds lol https://t.co/vKzOWYwWDa"
"All i want is some sweet tea from McDonalds 🙄😩"
"RT @CjayyTaughtHer: McDonalds is date, sitting in our car talking is a date, laying in bed is a date, watching netflix is a date. Money doe…"
