"@Starbucks @xnissenisse Thank you so much for good space w/lattes, frappuccinos, NYTIMES, music, &amp; GOOD baristas. T… https://t.co/7flRURZOJG"
"I love Arby's https://t.co/zUA8QI8qCb"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"RT @mymixtapez: Passengers forcibly removed a man from the subway who claimed he was a lawyer for repeatedly screaming the n-word.… "
"On crowded subway stairs w/ @sergeiburbank, a tone-deaf young (but not so young) person says: \"It's like we're goin… https://t.co/hqSsWhlHWm"
"RT @jonnysun: seeing rick and morty fans yell about pickle rick then seeing rick and morty fans yell at a mcdonalds https://t.co/qgEWF8PHMO"
"RT @FRAGILEAVERY: jack is so stan worthy he bought ppl starbucks today and that’s so cute of him https://t.co/eSL9PtrkIB"
"RT @RedbirdMenace: Rick and Morty fans are behind the times; Bojack Horseman fans have been lining up at McDonalds to get depression for ye…"
"Damn bk bringing back the spice... Wendy's u were wrong for that https://t.co/Z195DADB13"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"@TheD This the way I would’ve came home from subway if some lady cursed me out while I was making her sandwich 😂😭😂 https://t.co/ssZ4kG8gYp"
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"RT @RichieIsEvol: @Wendys are spicy nuggets back yet?"
"I love NY https://t.co/UZplaxXpR3"
"He did this on the L. Come do that shit on 2, 3, 4 &amp; 5 line. Watch what happens. https://t.co/ofWqVzLh9W"
"This the way I would’ve came home from subway if some lady cursed me out while I was making her sandwich https://t.co/po797g3FjH"
"Tuesday night R train. #nycsubwayportraits #nyc #train #subway #metro #publictransportation… https://t.co/STB7Tb382g"
"RT @MsMeowkinz: son ain't NO way I'm about to be eating cereal out of a cat bowl in the middle of the subway platform bc it's \"photography \""
"A swarm of people dressed as Ronald McDonald apparently regularly attack this Burger King. https://t.co/9FAanXRPpn"
"RT @Arbys: Sit boy! https://t.co/rwUIkYZ9bF"
"RT @MiiToons: Mulan didn’t deserve any of this. \n\nHope y’all  enjoy this piece I came up with in the midst of all the chaos!… "
"Has anyone else carrying around Stuck on The Subway Cookies?"
"Burger King out here throwing shade with the promotion https://t.co/errn8UdXm6"
"@yinghazi There is an injured passenger at Astor Pl. See service changes for 4/5/6 trains. https://t.co/ODXL5zfDAR"
"Always making the decision between the hot subway car and being so smushed against people you can't breathe and BOTH SUCK"
"This couple is having a really really intense argument on the subway right now. Universal health care is breaking couples apart"
"A Starbucks without a restroom and working wi-fi is useless (@ Starbucks) on #Yelp https://t.co/cdmT2bNmhs"
"welp I just ran into one of @JonoGlum' ex-girlfriends (from LAKE MARY) at Chick-fil-A (in NEW YORK CITY)"
"God #Ihatethemta #nycsubway #mtasucks Hey @NYGovCuomo and @NYCMayor FIX OUR SUBWAY YOU IDIOTS! Can't wait to vote a… https://t.co/DeAZECNHjF"
"When you're on the subway how bout you not scream and curse at the person you are face timing. Or better yet don't FaceTime them 🙄🙄"
"RT @EhJovan: that wrist flick when she threw her soup 😍 https://t.co/OQ7kdmZ5um"
"The subway is fucked."
"@amBITCHous__ oh na i was by the one in the subway boo"
"Not sure if the a/c just turned on in the subway car or if I have entered a new adjustment phase where disgusting heat feels cool."
"Starbucks is always out of the strawberry açaí and honestly idk I’m over it"
"Chipotle Cheddar Jalapeño Burger! On our regular weekly special!!! 😍🔥#burger #burgermadness… https://t.co/LInXKW0HyA"
"Retweeted NYCT Subway (@NYCTSubway):\n\nSee below information about service changes impacting 4, 5 and 6 trains.... https://t.co/z7c4nDODDN"
"RT @_jDes: fucking love being from New York. https://t.co/CU2OPzKnYD"
"Just realized some ppl read on the Subway only to avoid making awkward eye contact other ppl"
"I just saw a boy on the subway finish his pizza and then throw the crust out the door at the next stop..."
"Whataburger always tastes like regret. Always."
".@BurgerKing promoting my tweet dragging @Wendys over spicy chicken nuggets is the greatest thing to happen to me i… https://t.co/1g2EoNip3r"
"@deray She is a McDonalds executive who made her fame preaching all McDoubles are made equal"
"There is a dude playing a recorder at the Times Square subway station and he’s fucking awful god my ears are bleeding"
"RT @bootyboyanthony: new yorkers are the best https://t.co/M56h9uFE0N"
"I see this all over the city. Williamsburg coffee shops advertising their limited edition Covfefe. YOU ARE DOING WH… https://t.co/uMhpQ7wLcQ"
"@thecascott The subway had lines going up to street level and commuters were walking down the middle of the street… https://t.co/VpmKQQ1JLa"
"Subway driver continued: yeah, you should probably just take the bus"
"Oh good looking out https://t.co/4Gm6q6msFN"
"@dias_siete @MeEncanta @UberEATS @McDonalds @Uber We are going to die anyway smh"
"At school, on the subway, at concerts... https://t.co/flJYJSkKxf"
"Here's what George Washington had to say about homework: \"Burger King finished eating dogs.\""
"sorry but the limearita part made me giggle. just feels \"right\" https://t.co/jGE3Z0mE3h"
"@JoshSmoove_ Cause you had ya mind set on the wendys 😂"
"Update from the south: just paid $7.50 for a bowl and chips at Chipotle. Same thing cost me $11.50 last week in NYC. #wHYYY"
"i just saw a body on the subway tracks i’m so shook :("
"@RoccoDeserto @DrewfromJersey Yo I was in grand central getting off the subway one time and a pregnant woman was ca… https://t.co/GEYYwtjjqN"
"What do you know, Starbucks declines and gets a replacement CEO?\n\nhttps://t.co/4irCQZQsij"
"A thing I don’t see people talking about RE Trump is how many capitalist entities benefit even from “opposing” him.… https://t.co/Cn5gj682IS"
"@latiaw82 There is an injured passenger at Astor Pl. See service changes for 4/5/6 trains. https://t.co/ODXL5zfDAR"
"@TheKrausHouse Pizza Hut buffet is trash. 🚮"
"yes Brooklyn https://t.co/hGbRRwzSI8"
"I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/BFYbRPqff9"
"RT @adreyonline: @MTA you guys have got to be the worst fucking subway system in the world!!"
"@KFed_95 @barstoolsports This guy is horrible, just give us KFC"
"@omegalbagel Also when tried to get a poster from McDonalds an angry fan kicked a glass door open with two middle f… https://t.co/wqtf6pN48B"
"RT @KANTBOT10K: FURTHERMORE I AM SUING MCDONALDS AND CHINA TO OFFICIALLY CHANGE THE NAME TO HARMON SAUCE https://t.co/pmIlAZvX2H"
"Lmk or tag someone who is down for filming &amp; hangs &amp; 💰(like not an entire bag of money but you know more 💲 than a chipotle meal)"
"Thank you @olyviafabre for introducing me to such greatness. https://t.co/dJ2fwDTqzV"
"@hjcarey There is an injured passenger at Astor Pl. See service changes for 4/5/6 trains. https://t.co/ODXL5zfDAR"
"RT @hockeynight: Windsor man faces lifetime ban for tossing first octopus at Little Caesars Arena https://t.co/FIs5m2GPtR\n(via… "
"RT @comicMartinRizo: Those KFC $5 boxes sound good right now! I'm hungro Af."
"I just checked in @kfc with #mPLUSPlaces Download today!  https://t.co/n3UlvbsSEF"
"RT @nihilist_arbys: We'll drag your old ass in and out of  arbys all day, all night. We don't give a shit. \n\nEat arbys"
"the woman with the soup...AMAZING https://t.co/9P2RLGQt3L"
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"reporting live from the subway, where a person has spit onto the floor of the car twice in the past 3 minutes"
"Free Panda Express Entree with Any Purchase :: https://t.co/geNanuvVsv https://t.co/RoV9vAezwg"
"@DallasMySea @dominos When you live in the pizza Mecca of the world"
"McDonalds usually https://t.co/uosWbmChZF"
"RT @roach_nigga: nigga lining look like the pizza hut logo https://t.co/j1QVpZYWu7"
"Parents first time to NYC. “The Subway is fine y’all.” Then as we enter the subway the cops are literally carrying a dead body out... 🤦‍♂️"
"An old man tried to yell at this cute brown women at Starbucks today so naturally I intervened &amp; said \"we don't know you, don't talk to us\""
"i got a free drink from starbucks"
"@PlatanoGuy There is an injured passenger at Astor Pl. See service changes for 4/5/6 trains. https://t.co/NyhzpGCVAJ"
"RT @espn: It doesn't get much better than this!\n\nVote for the winner of this week's @Wendys #RivalryBeef matchup below:   https://t.co/BcXe…"
"@michelleldwyer There is an injured passenger at Astor Pl. See service changes for 4/5/6 trains. https://t.co/NyhzpGCVAJ"
"RT @spacecommunism: I'd better not ever see anyone make fun of things teenage girls like after seeing the absolute state of the respons… "
"RT @GiveItUp4_Ty: I Aspire To Be As Wealthy As @Richkid_life ... Boy Ordered Sushi &amp; Wine In Dunkin Donuts https://t.co/Jyr6Lr31LP"
"I love when we come together https://t.co/uRq9kHsHyU"
"I love this song!!! https://t.co/p8KMpeBn92"
"RT @jimpjorps: at Taco Bell; woman ahead of me is trying to order a “chocobo supreme” and will not work with the cashier to figure out what…"
"RT @CoachDebbieRuns: #ad Craving something spicy? Try this creamy corn chowder with @LAMORENAUSA Chipotle Peppers. Yum! #VivaLaMorena… "
"RT @stats_canada: 89% of Canadians are in the wrong line at Tim Hortons"
"This is what PewDiePie said off-the-record about 12 year olds: \"Burger King finished eating Instagram.\""
"@LauraZlatos There is an injured passenger at Astor Pl. See service changes for 4/5/6 trains. https://t.co/NyhzpGCVAJ"
"@realDonaldTrump WOW! Over 1,318 false statements made by you in 238 days!!Those fact checkers are gonna collapse!!  LIAR!!@SenBobCorker"
"Nah Y’all Not Eating The Chipotle Right Nfs Y’all Can’t Be Lmaooo"
"I’m back as MAYOR!! Free Latte’s for ALL!! (@ Starbucks in New York, NY) https://t.co/8O51ajjwYr"
"@robertchow There is an injured passenger at Astor Pl. See service changes for 4/5/6 trains. https://t.co/NyhzpGCVAJ"
"Will I regret never having eaten at a Boston Market when I die? I kinda think maybe"
"Can’t wait until a smaller, portable Tesla Powerwall comes out so I can steal all of my electricity from Starbucks"
"The workers at chipotle gave me enough food for four days and I'm not mad"
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"RT @AustinsOwnBBQ: Take your meat to the next level with Austin’s Own Chipotle BBQ Sauce. 🔥 😋👍 https://t.co/PY1Zn0tWC2"
"@mrjaxtaylor @Wendys Ohhhh shit! https://t.co/6vQMfW8WUZ"
"RT @king__ashhh: trash https://t.co/AQy5b45az8"
"Subway Scenes https://t.co/x9ifZAG3MM"
"Nice... https://t.co/dkpZevF9ZS"
"I litterally just did this at chipotle... lowkey now I’m shook https://t.co/fxsWydJiCf"
"RT @Le_YoungGawd: Nah Y’all Not Eating The Chipotle Right Nfs Y’all Can’t Be Lmaooo"
"See Also: Dealing With Racist Lawyers On The Subway https://t.co/ghYULcjJ4V"
"Ew I haven't eaten mcdonalds in years and I just got reminded why I don't eat that shit I feel so sick.. only had some nuggets forreal"
"RT @DanSlott: Uncomfortably vague note at Starbucks... https://t.co/FJSLUwr4oX"
"See what happens when you drink Lime a Ritas. https://t.co/LqQuA7mmk6"
"@BrooklynREPro There is an NYPD investigation of passenger injury at Astor Pl. See service changes for 4/5/6 trains. https://t.co/NyhzpGCVAJ"
"Carrer: Science &gt; Seeking Fact Checkers for Freelance Projects &gt;... https://t.co/znPm7dpR3M #career"
"teaching a songwriting class... whatup @DairyQueen @chevy @Walmart @CalvinKlein @McDonalds @Cadillac @randmcnally… https://t.co/X5XpNNtId7"
"not having a monthly subway pass has rendered me socially stunted"
"@krystalball @danielbiss Krystal Ball look deep into Ur self and note Ur “bernie purity” is pure bullshit. Maybe sp… https://t.co/RTe0JvB3p5"
"RT @synthzbot: i hope mcdonalds release daft punk album sauce"
"@emmagf Subway delight?"
"@Lessgo56 Yeah but this mf got arrested lmao, and chipotle always be staring at u when u ask for a water cup"
"@failingupwards @stoolpresidente looks like he runs a 21st century Oliver Twist operation &amp; controls all the kids o… https://t.co/PNPwMwY3bf"
"RT @likablemshyde: When you finally get your twin(@Wickedlillhyde) in your hands for all that @Whataburger pictures/bragging she was d… "
"Shrimp with Chipotle-Bourbon Butter Try it once and you’ll forever crave this shrimp cooked in a... https://t.co/BAr6VtXv19 via @FoodGawker"
"taco bell and grubhub need to link up."
"RT @aprilcrichlow: Would you be ok if only 1 in 10 subway trains ran on time? #SherylSandberg #WSJWomenIn https://t.co/NyXFf58Tsr"
"Shout out NY https://t.co/E76ddcNGg4"
"RT @zfaithhh: we get to the concert venue and the first thing gabby wants is Dairy Queen"
"RT @dude814: @McDonalds @UberEATS Where is my Where is my sechuan sauce. Thanks for lying to me about the promotion one day more… "
"Ok but what do you expect when they SELL DILLY BARS https://t.co/GwA1RqKOMP"
"RT @_yazminsita: Whose man is out here getting drunk on lime-a-rita at 2pm https://t.co/E0nC0TNimt"
"RT @zackfox: Bro pulled up on a Sunday we've all been there https://t.co/9Bm8inKifl"
"@McDonalds Does anyone know the release date"
"RT @_FlyoutChase: 90s back https://t.co/OdFCqBGPvh"
"Man I love my fellow New Yorkers. Here’s to you soup lady!🙌🏽 https://t.co/ksEsKaOiCN"
"RT @1Kevin_son: Wow people are fucking disgusting ! SMH!! https://t.co/s30Q4ukrHp"
"#STLvsNYR going from home yday #Yankees game and these #Isles fans starting whatever chant to make fun of #NYR on subway"
"Shawty dumped her Au Bon Pain Mac &amp; Cheese on him 😂😂😂😂 https://t.co/AkwPae9ve2"
"There she stood waiting on the subway platform for a 1 train that would never come\n- a short biography"
"a cousin sent me a pizza hut gift card, so I wouldn't have to cook on my birthday---very, very nice of him to think of me"
"@Djackso1492 @Foti925 @BreitbartNews Still more people than a @timkaine rally. The line at #starbucks was longer."
"I hate KFC, but their $5 famous bowl meal changed my life"
"It may have been easier for the New Yorker, with its army of exceptional fact checkers, to greenlight the story. https://t.co/7scqpYv8mp"
"Brutal commute on 4/5 today. @MTA #NYC #subway"
"WATCH: Bizarre iPhone video captures #Pregnant #Woman fighting in McDonald's! https://t.co/vILhZDhrwU #Fight #Joy105com #McDonalds"
"@_ScottieF There is an injured passenger at Astor Pl. See service changes and travel alternstes for 4/5/6 trains. https://t.co/EvORH9tVhE"
"Get this man off the streets !!! Help @NYPDnews capture the subway slasher. https://t.co/Q17yK93Fky"
"TV Pitch: A reality show starring five couples that are always arguing on the subway"
"Today a full blown waterfall came through the ceiling of my moving subway car. #survivor #NYC"
"RT @LilyD: These subway ads about cancelling plans because you never want to leave your bed double as ads for depression. https://t.co/4v3x…"
"Puppy in a Trader Joe’s bag on the subway\n“It’s only his second time... he’s not a fan”"
"@srubenfeld Are they talking about the subway because it's a disaster right now"
"RT @NYTMetro: Hope you're not too hungry or thirsty. The newsstands on the Second Avenue subway line have yet to open.… "
"I accidentally stole someone else's muffin today at Starbucks, so I'm basically in ANTIFA now, right?"
"Anyone know if the @MTA subway arrival boards for FMJZ trains are actually \"live\" or based on a schedule? Asking for me. \n\n#subway #mta #nyc"
"Only took 1.5 hours to get home by subway tonight. Wow. Talk about a failing MTA. https://t.co/6cwTSNflVk"
"Fuck outta here! Glad to see his bitchass getting pushed off!! https://t.co/PXW17A9oll"
"@qnrisawesome I don't think I've ever had 3G, I just live by the whims of Starbucks wifi. I sort of forgot there was a better option? 😶"
"@buffdada I believe it's Chipotle and he's looking to keep it safe on the ride home.  I'd do it with Paula's Donuts so I get it lol"
"RT @AllyBrooke: Hahahhahaa. Omg. This photo is so old!! Major throwbaaaack 2014 I think? This caption is everything 😂😂😂 https://t.co/MADVqg…"
"I just want mcdonalds 😭 sos"
"RT @philvolcy: @BurgerKing @snedegascar @Dustin__barnett @giselle_sancen @awid__ @Wendys 😂😭Who is running that Burger King page? https://t.…"
"i love my city https://t.co/2iMRx9UnEE"
"Never seen anything like this before. @BurgerKing promoting a consumer tweet @Wendys, to then swoop into the replie… https://t.co/hv8b2YJlZv"
"OK with Paula's Donuts. But Chipotle can go into the trash IMO😎 https://t.co/PIEAj2lqhz"
"we love ny! https://t.co/ciwSLYKl1D"
"@Crew__Bo1 @MGoodin13 @XboxSupport Worthless comment. I asked my bro what was in the big Mac secret sauce since he… https://t.co/H08HFWEGqk"
"Is this real bring back real rap send these cornballs to McDonalds 😡 #oldschool https://t.co/qJhpAmJeGe"
"RT @erickabakoff: #NYC y'all https://t.co/ywEKcLrmWH"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"RT @MrCreeperGamer6: Imagine being a fast food employee with low pay and no job stability and having these horrible STEM dweebs come in… "
"Tons of delays in the subway from SoHo. Good thing the EHS squad can travel home together! 😊"
"I'm at Starbucks in New York, NY https://t.co/1Y9fcxgCzo"
"I've been comin to my local Dunkin Donuts that the girl who always makes my order has such an obvious crush on me"
"@_nattydreadz_ Subway time"
"Even @McDonalds is testing a veggie burger! Here's a look at how the veggie burger went from niche to mainstream.  https://t.co/SIdJmYLzZx"
"I was harassed by this female employee at Starbucks da other day. she said she finds it sexy when a Latino man w/ beard orders punkin spice"
"I don't think I'll be going for the @Arbys tonight. https://t.co/aat71SYk1R"
"RT @lorquets: Seriously @MTA @NYCTSubway...is it even possible to get anywhere in a reasonable amount of time by subway anymore? #MTAFailsa…"
"Subway Delays ---- HERE WE GO! #NYCVotes"
"#BoDietl asked about subway delays: would he work with Gov. Cuomo?"
"I love my city. No room for hate!! https://t.co/sGfQ44Grhd"
"@Rhiannamator Roller Rink PA's= New York Subway Train Conductors (pre-computerized trains)"
"RT @roniboy: yep it's the lousy NYC subway system #mta #nycsubway https://t.co/LqoY40i3lx"
"RT @oraltwjnk: YASSS LADY WITH THE SOUP GO BEST FRIEND THAT’S MY BEST FRIEND https://t.co/lnxF22xPpQ"
"Dietl obviously knows nothing about the debate between Cuomo and de B on funding the subway's \"emergency plan.\" Com… https://t.co/dYmgiso6K1"
"RT @DylanFusillo: NYC @MTA Executives should be forced to ride their subway to work every day. Maybe then we’d get some proper function dow…"
".@BoDietl goes after @NYCMayor for not taking subway, but doesn't really answer question"
"Subway talk...I been dreadfully wanting to listen to all 3. #nycvotes #NY1debate"
"@itsmikerock I mean, I don't know, but people at Starbucks noticed he wasn't right. It's all so weird. And such a w… https://t.co/N7fPQq11Oy"
"Why is @BurgerKing promoting this lmao @Wendys &gt; @BurgerKing https://t.co/3NySpCA3S9"
"RT @chanel_annmarie: My city don’t stand for this bullshit https://t.co/XLD5cWMnUC"
".@NMalliotakis to @billdeblasio: “I will work with Gov. Cuomo to resolve this (subway crisis). Are you afraid of Gov. Cuomo?”"
"Aunt Kristy is literally the best I'm about to get Taco Bell there's a 65% chance I'll still continue to play with… https://t.co/bkQ0PN01dS"
"BREAKING: Here's what PewDiePie said off-the-record about McDonalds: \"A dog is failing to meet the standards of words.\""
"Thanks for coming over to @nomwahtu! https://t.co/N6cmeYVQGH"
"@EricaTutino @VelVelHoller Just awful isn’t it my best friend as all my free votes and support been up till 6 and 7… https://t.co/R8h1aXrnIl"
"@LCD_Carpsystem @ChipotleTweets Speaking of, did you ever read about the case where a guy in a wheelchair sued beca… https://t.co/2EBLQVoOnx"
"@thejimshapiro Just laughed too loudly on the subway 😂"
"\"If Gov. Cuomo would support it...it could be achieved,\" @BilldeBlasio says of millionaire's tax for subway money"
"RT @meechonmars: @Wendys .@Wendys I just wanna say.... Yall better get it together before another company does.… "
"@Crazy4OReilly90 @buffdada Chipotle is straight trash so youre not missing anything"
"So @BilldeBlasio says he has no plans for the subway congestion."
"#NFL #apologize 2your patriotic customers/viewers. You too, cowardly sponsors. @ProcterGamble @AnheuserBusch… https://t.co/aSHODajEfc"
"SUBWAY RANT: Wild video shows a man hurling racial slurs at people on an L train this weekend -- and  https://t.co/8jxy3fQmOG"
"@TheReal_Shani He is actually great, Standing up for the homeless, correctly saying the subway is a wreck. This is… https://t.co/Wcus3ScMvv"
"so somewhat sorry? https://t.co/bVeNu7TvPK"
"RT @spooney35: Damn fact-checkers go crazy president #tRump has made 1,318 false or misleading claims in just 263 Days @cspanwj… "
"RT @MirrorKissesVA: Never stop for Pad Thai in the middle of nowhere. Just go to Taco Bell and move on"
"THE ASS WHOOPING I WOULD HAVE PUT ON THAT CHILD OF THE DEVIL!!!!!! 🗣🗣🗣🗣🗣👤 https://t.co/iYnGB3Bd13"
"@LovesVag @CNN @wolfblitzer So you lost the argument now you hit me with the CLASSIC YEAH BUT. HMM were they bleach… https://t.co/3OVs19blox"
"We don't eat little caesars https://t.co/uL84jQ59j3"
"@SUBWAY is a multi million dollar company but can't do shit about the fruit flies on the veggies"
"@MarketUrbanism Additional subway trunk lines to the Bronx, Queens, &amp; Brooklyn + up zoning would create massive amo… https://t.co/Y1xq1Wt1JW"
"Lady working at chipotle rips my burrito while folding it and asks if it's ok to put it in a bowl. Ummm no? Lol"
"RT @TweetLikeAGirI: Taco Bell https://t.co/LQiNOI1KhH"
"RT @WWEgames: .@kfc's Colonel Sanders is ready to throw down in #WWE2K18! https://t.co/yWnF6Tpf3i"
"deadstar is so fucking @smokepurpp Krispy Kreme yaaa bitch I stay clean ~ - https://t.co/CCGcZY2Es0 #xxx #nsfw #adult"
"RT @ps4andchill: bae: why tf pizza hut keep texting you \nme: https://t.co/7upSqUqkl1"
"BURGER KING HAS THE BEST FRIES!! IF YOU DON'T AGREE, THEN MCDONALDS HAS THE BEST FRIES!! IT DOESN'T MATTER.. I just want people to like me.."
"I have somehow run into 5 ppl I know on the street or subway in the last week and I need to know WHAT IS HAPPENING!!! @god ur freakin me out"
"This fuck got what he deserved. https://t.co/E4XWLDr4RA"
"@WWEgames @kfc But the hardys couldnt be in game at launch but this colonel sanders b.s is ?"
"\"He went on the subway once, he stops the trains, he got all the homeless off...\" -@BoDietl in a question ostensibly about policing"
"@DakotasKai @WWEgames @kfc The colonel is just a created superstar with a premade attire."
"RT @K1NGR1ZZY: @BurgerKing Girlfriend: I wonder if he’s thinking what I’m thinking. \n\nBoyfriend: I still can’t believe @Wendys doe… "
"RT @NYDailyNews: The subway bigot who had soup dumped on him for a racist rant on an L train insisted he’s “not that sorry” https://t.co/Cy…"
"@nadalotta Ball. And no, that's not a typo. Her name is Krystal Ball."
"Can we make younger popping on the subway illegal please and thank you"
"RT @transgirlsonic: you guys have no schezwan sauce? no- i want schezwan sauce! \nwhere's! my! schezwan! sauce! im PICKLE RICKKKKK, WUBB… "
"@fivemznyc @danlistensto @DanielKayHertz A lot of kids take the bus crosstown alone but aren't allowed to take the subway."
"@casper I absolutely ADORE your \"Find the xyz in the photo\" advertisements in the subway. As a commuter they help k… https://t.co/3jJe5pd0Di"
"RT @Clarknt67: DeBlasio is correct. New York State took our Subway maintenance money. Now they want us to chip in to fix it.… "
"They should've debated in a crowded subway car #NYCMayoralDebate https://t.co/kfBsE2Xgvz"
"I'm moving to Grammercy I feel like a human Starbucks Latte"
"HOLY SHIT @KFCBarstool TOOK THE SUBWAY HOME WITH YOUR BOY &amp; YOU WERE MORE THAN RIGHT @barstoolsports @BarstoolRadio https://t.co/ksXNLrgTc5"
"Can some1 splain me this @McDonalds Schezuan sauce #RickandMorty thing?"
"I fucnking love subway"
"RT @kenradio: Love what illustrator Soo Min Kim does with the iconic Starbucks mermaid, placing her into funny everyday situation… "
"@Wendys tell me a joke"
"RT @edinburghpaper: First Scottish Taco Bell will be open by Christmas \n https://t.co/vGwVM3r7Gp https://t.co/eC5EXbCG3M"
"Wendy's no longer sells spicy chicken nuggets, but Burger King does. https://t.co/clQxJGjspg"
"You Can Now Buy Your Very Own Subway Countdown Clock I prefer to find out my morning train's serv...… https://t.co/JXVSVUdQAG"
"Should've walked my ass to Starbucks"
"@NYDailyNews He's a serial subway bigot. #lockhimup"
"The old guy on my subway with a shirt that says, “no it’s r2d2. i loved him in star trek”, with a picture of a dalek on it is me in 20 years"
"I'm never on the train when shit like this happens. My rides consist of people that smell like public bathrooms and… https://t.co/PjRvo6YZ71"
"It's hard to watch the #NYCVotes mayoral debate when you're stuck on an extremely delayed subway train https://t.co/fhd12N8th6"
"#NowPlaying Krystal Johnson - We Believe | Power of Worship Radio =Click To Listen=  https://t.co/pgldFS7zbo"
"How New Yorkers Reacted To Subway Rider’s Racist, Drunken Rant (Video) https://t.co/ZDiKe8KSC2"
"RT @ryanridley: The joke that shook capitalism. https://t.co/qVkoFmfuD4"
"Should have tossed him off the train while it was still moving https://t.co/Ae4VjshuMP"
"RT @DaddyBergdorf: Long Islanders get ready for work by waking up, shoving an entire bagel up their ass, chugging Dunkin donuts, and runnin…"
"RT @erinmdurkin: \"He went on the subway once, he stops the trains, he got all the homeless off...\" -@BoDietl in a question ostensibly about…"
"Guess who has deadlines and not sleeping tonight!  I love Starbucks… https://t.co/d1RqXuBA2Q"
"example of why I love New York https://t.co/blstwyAZut"
"I made my bed (ordering an iced mocha from Burger King) and now I must lie in it (keep it in my possession for the rest of the megabus ride)"
"The only good thing from today was seeing two dogs on the subway—one was a large dog in an IKEA bag and the other was a service dog 👑🐶"
"RT @ssentience: RT to win a $10 Starbucks gift card ☕️\n• must be following me and @glowradiant 💫 https://t.co/uQnvo3fiBv"
"The person in front of me at chipotle ordered a quesadilla in a way that made it clear she has never even heard of the Spanish language"
"RT @18dMedia: Fried Mashed Potato Balls - KFC Australia is Serving Deep-Fried, Breaded 'Gravy Mashies'… https://t.co/ze0R0Jdqly… "
"RT @SHUCheer: Show your support for SHU Cheer tomorrow at Chipotle between 5-9PM, just show this flyer at the register! Help get… "
"@NYGovCuomo is responsible for NYC subway oversight not @NYCMayor who only is required to fund the city % of subway budget."
"@customs_ccw @WWEgames @kfc I know that but still lol"
"I'm sure y'all hear stories but some actual unheard of shit be happening on the subway"
"light subway reading, A People’s History of the United S by Howard Zinn 📚 https://t.co/yt1fIH668v"
"RT @chelsieomfg: The soup was a nice addition. https://t.co/O1wtFs1QdM"
"RT @spotsammie: @Chris11962 @ProcterGamble @AnheuserBusch @McDonalds My response to NFL   Eat me"
"A 60ish woman just came up to me at the 14th St. subway platform &amp; asked “what train did I just miss?” I said “The F.” She said “As in FUCK”"
"@NYCTSubway Subway apocalypseis not good for #WorldMentalHealthDay"
"Strangest thing on subway. Stuck btwn stations, conductor announces 30min delay. Right after everyone sighs, train starts moving smoothly..."
"It may be #pumpkinspicelatte season. \nBut that shouldn't stop you from choosing healthy drink options in #starbucks\nhttps://t.co/olk6dTxcSt"
"@washingtonpost Starbucks is next\nhttps://t.co/Vu4CXfvo6d"
"So Mormons can dance like this but they can’t open Chick-Fil-A on Sunday? https://t.co/Zy1NfEckkr"
"I said i didnt like Arbys but didnt mind McDonalds and some guy at work said Im a typical fucking millennial. IM DONE"
"RT @annataylor2018: I could eat chipotle for the rest of my life and not get tired of it"
"Finally out of the subway, but trust me: witnessing that awkward situation gave me enough anxiety to last a week."
"RT @dianascholl: Using my day off to listen to SCOTUS arguments as I ride the subway. Great job @ahilan_toolong ! https://t.co/X9DfX5Fs53"
"Of course the subway fucks up when I'm trying to get home to watch the USA game"
"Omg I love you STARBUCKS"
"I mean, listen, I think we're all happier that this piece landed in the hands of the New Yorker's famous fact-check… https://t.co/KNyL11ZhW9"
"Some guy just whispered to me on the subway, “I just ate a whole bag of marshmallows.” I gotta say that’s a new one."
"@itsCrab @McDonalds There were no victories to be had in that situation."
"RT @alvinlindsay21: #OnlineMarketing News: Short Attention Spans, Google Feed Rules, Starbucks Emojis: https://t.co/oWIYwppDdv #seo https:/…"
"My Top 10 Free Halloween Subway Art Printables! (Perfect for framing!)\nhttps://t.co/eKcUlwLlAi https://t.co/O2wNTkd5mL"
"@ChiefBoomin be happy that commute is a bitch soho seems so close until you get on the subway 🤦🏾‍♀️"
"This tweet is hilarious only because Burger King is promoting it 😂 https://t.co/437y84Oo2m"
"Workout #1 brought to you by Dunkin' Donuts' maple pecan latte and… https://t.co/3iVD3Z8Mct"
"@sassygayrepub @CHIEFSCHMEEF Ayy u got the number for pizza hut?"
"#randomactsofnyckindness Man on subway feels faint, woman gives up seat, another gives her water bottle for him to drink out of"
"@JadeSalzman is bringing me Chipotle and I've never been so excited for food omg"
"RT @OmarGoshTV: Had a super gross sandwich made at @SUBWAY &amp; ate it. Gave the girl a nice tip for being so nice. Ewwwwww! https://t.co/EMev…"
"@salmaiorana Unless dusty is playing chess while everyone else plays checkers but I doubt that very much"
"Ha, thanks for that &lt;3 IRL I am a disaster. I consistently look like something the cat dragged in and I barely writ… https://t.co/5b6bkVj1mE"
"Raise your hand if you were personally victimized by the subway delays today 🙋🏻🙋🏻🙋🏻🙋🏻"
"i’m irritated by this country🙄 https://t.co/fwxpsUrqwM"
"Chick-Fil-A doesn’t make mistakes. If there’s something wrong with your order it was your fault"
"RT @McDonalds: You spoke. We’ve listened. Lots more #SzechuanSauce and locations. Details soon. And that’s the wayyy the news goes! https:/…"
"Love commutes home to @EHSNYC mostly because of subway ride conversations with my neighbors in Newhouse! 🚇💙"
"What's up with these petty Burger King promotions against Wendy's"
"An off-Broadway actress was arrested for trying to push a fellow straphanger onto the subway tracks: https://t.co/8d2wZetODe"
"RT @mauriceholmes35: What if there was a food place that had chick fil a chicken, raising canes sauce and bread, and jack in the box shakes…"
"Checkout our awesome sessions at Pratt!  Only 30 minutes by subway from midtown, and easy to locate! https://t.co/asT9bBuw9T"
"@BurgerKing promoted by burger king😂😂 y’all petty https://t.co/17Gm3xhwXM"
"@K1NGR1ZZY @BurgerKing @Wendys Dawg they best be paying u for this https://t.co/ZJ06UuaQUP"
"RT @dejaplachta: We 👏🏾 All 👏🏾 Hate 👏🏾 Racists https://t.co/7x6MRXFce2"
"chestnut praline is the most amazing starbucks drink i love my job"
"@deedee_nj a Starbucks without seating isn't worth going to. Their coffee is overpriced, but I have a weakness for their cappuccino ☕😉"
"@dejaplachta @MuaSapphire HAHAHHAHA THAT WAS WELL@DESERVED as a New Yorker who takes the subway I woulda threw my breakfast at him 😭"
"RT @KlausBromi: Nerds getting rewarded for becoming dumb, angry mobs has been a terrible trend over the last few years. https://t.co/03h8RQ…"
"Slighty creepy yet very delicious #Starbucks cookie 💀 https://t.co/NONVdVCEam"
"RT @nytimes: Homelessness. Subway delays. NYC's budget. Highlights of the top issues from tonight's debate for mayor. https://t.co/Svu0Jy5J…"
"RT @JayNoHoes: \"Yea lemme get uh number 5 with a large COKE” https://t.co/zJvr3zN7Bj"
"When people complain at starbucks and forget we’re in the Bronx and the employees clap back 🙌🏼🙌🏼🙌🏼🙌🏼"
"Grilled Chipotle Peach Salad https://t.co/3KcUUAQHet https://t.co/BnOB0DeFpC"
"RT @WSJ: New York’s 5.8 million weekday subway riders are about to get a new way of quantifying their commuting frustration https://t.co/3K…"
"Because NYC ain't having that shit. https://t.co/M53HRrbQdp"
"It's been done so well in fic before but occasionally I sit on the subway thinking about it a lot"
"yea, im sorry lmfaoooo . im def not giving up those 2 things https://t.co/ryLrbHia9D"
"We have a homeless problem in Manhattan A Subway System That Is Broken And Fixing Our Schools And We Are Talking About The National Anthem?!"
"Unsurprisingly, this is what my grandmom had to say about McDonalds: \"Destiny 2 is failing to meet the standards of cheese.\""
"MY MAN CAN GO BEFORE I STOP USING DOVE ! LMFAO https://t.co/ryLrbHia9D"
"A Sankey Subway, gorgeous!! https://t.co/uu6gTbeY2c"
"@Wendys bring them back 😭 https://t.co/EWziPBxh7t"
"The man from the subway who loudly identifies people as \"black man,\" \"white woman,\" etc has learned a new ethnicity: \"Spanish\""
"Love my city 💖💖 https://t.co/Pki9el9ESR"
"@JMartinezNYC @brigidbergin @BilldeBlasio @NMalliotakis @BoDietl Subway was delayed."
"RT @jonraff: Man grabbed 7000 pussies since 9-11 and everyone acted like they didn’t know/care.. this mentality let @SUBWAY Jared rape mino…"
"RT @PeterRudilosso: If you haven’t walked through the fumes of the FIDI Chipotle Chicken Vent multiple times a day you don’t really go to P…"
"@ChipotleTweets just had chipotle and almost choked on this piece of rice https://t.co/QyIcwiK3T1"
"Had to repost..Looks like last lap in #miami was at McDonalds😂😂... Love my #trini… https://t.co/DiVX6hXaXC"
"@EconomyBeyond Which also requires the subway"
"@OmarGoshTV @SUBWAY Cool what was in the sandwich"
"Made #Spaghetti with chicken chipotle creme #yumz watching #mexico play 🙌🏼🙌🏼🇲🇽🇲🇽🇲🇽 #🇲🇽 #⚽️ https://t.co/HzjgF1enJi"
"Lmao I love my city https://t.co/59SvhNf9bi"
"Taco Bell breakfast is really underrated"
"Love subway folks, but I hate the subway service @MTA https://t.co/acKtklBhws"
"RT @thugtear: left my son at the park (dw i tied him 2 a tree) so i could go2 mcdonalds n grab some rick n morty sauce n now my ex’s new ma…"
"it’s what he deserves https://t.co/JmMz0hcl7R"
"RT @RealAlexRubi: Chicago activists hold subway demonstration against planned $95 million police academy https://t.co/MncejT3haa"
"Yo the Burger King in Long Beach sucks ass! Don't ever go there! They gave me the worst fuckin attitude ever yo!"
"@AJEnglish @AJUpFront Is mcdonalds healthy food?"
"i just waited 45 minutes on the starbucks line only to find out that they are out of green tea AND CAKE POPS"
"@UberEATS y'all lucky that shit ain't here yet because taco bell would have all money"
"Paris and Brussels Trip Recap | The Krystal Diaries https://t.co/UBcboJtH4L via @krystaldiaries"
"Food&gt; Syrup&gt;Starbucks's Secret Menu Apple Pie Frappuccino Is Better..https://t.co/SwIgvckmYY #Food https://t.co/2Y3YUTNcrK"
"RT @Chicago_Styles: So I went to @Whataburger  and I just had to rap my order cuz I was mad hungry!! https://t.co/1AAwL2wa6h"
"I can't trust people who order a filet-O-fish sandwich from McDonalds.."
"This boy at my school got me a whole pizza from dominos 💜🤦🏽‍♀️"
"Tg forever 21 is linking up with Taco Bell, I don’t know how we have survived this long without it"
"https://t.co/8G1VzryNFO updates background-image #40 https://t.co/ahrlgFynHJ for McDonald's https://t.co/UZTz8HzbSa"
"Imagine not only eating Taco Bell...but eating egg from Taco Bell. God no."
"RT @Iron_Spike: I made a friend in the subway. :V This is Matthew Christian! (Don't worry, I asked if I could film him, first.) https://t.c…"
"Could go for some White Castle"
"Lmao so I don't exist? 🗿 https://t.co/4dkf7eslYw"
"RT @BurgerKing: @ColeLedford11 @Wendys 2017 literally just go so much spicier. 10-piece spicy nuggets are here at BK starting 10/12 for $1.…"
"gentle reminder to fellow NYC residents that every once in awhile, if you have the means, it's a good thing to swipe another onto the subway"
"RT @Wendys: We know why the chicken crossed the road\nBut you crossed the boss and straight got told\n\nWe had some fun, but yeah… "
"Is it socially acceptable to eat mcdonalds in the shower ? Asking for a friend"
"Forever running into people I haven't seen in months on the subway or penn station"
"@GideonResnick I love feeling I watched this go from Gideon’s Subway Thought to official tweet."
"@obviouslytianna Ur chipotle BFF"
"The spread is so real on this subway. Four guys taking up a whole row of subway seats..."
"RT @all_in_yo_girl: Imagine bein a black person in subway ordering ur food &amp; a customer pulls a gun on u bcus he &amp; his wife felt nervous ht…"
"Subway rule #1: if you have a book bag on take it off your fucking back. Good day, sir. #nycproblems"
"RT @NickFlood32: 🚨🚨WITH CHIPOTLE QUESO!!!! JUST ADD A BUTT TON OF SALT AND WILL BE SO MUCH BETTER!!! 🚨🚨\n\nproblem freaking solved @ChipotleT…"
"KFC after class hits the spot 👌🏼"
"RT @sigg20: There were People squeezed in everywhere for the 1952 Dodger-Yankees \"Subway Series\" at Yankee Stadium.#Yankees… "
"The best of nyc and the worst of nyc in one vid. https://t.co/BFrlPRN0J7"
"She’s been turning a blind eye for awhile. #Malliotakis https://t.co/2IqLKH4ja3"
"RT @CeIebslnHS: - plays ultimate frisbee  - suspended for vaping in bathroom  - works at little Caesars  - wears mandals to school https://…"
"RT @breakkingground: macy’s be tripping if they think I got the coin to spend for m&amp;g with liam, bitch I can barely afford a subway ride"
"RT @hesonvinyl: @obviouslytianna Ur chipotle BFF"
"RT @NBCNewYork: A rapping conductor has been catching the ears of commuters riding the NYC subway system lately https://t.co/IISHNFNZnd"
"RT @JanelleKendraa: @ShooNick  boutta go get some KFC from your side https://t.co/SQxvkhsMPh"
"@kristygeerholt wtf where's mine?? https://t.co/A7tghBIc03"
"Plus the stations are less than a minute away from the #StudentLivingEHS residences 😊😍 #DormGoals https://t.co/dpnM8NWxvD"
"@BrettSVergara @AshleySpivey Oh thank god bc chipotle's is garbage and I cry everyday that there are no Qdobas or Chuys in NYC"
"Love my state https://t.co/TAJT90wb6U"
"@JimmyH1eld McDonalds"
"RT @raquelxfogel: Nothing but love for my city https://t.co/f9aiEDUkGc"
"Yay..one for the good guys.... https://t.co/85U01UdIdM"
"Both @NMalliotakis &amp; @BoDietl proved they were unworthy in subway discussion (&amp; elsewhere) re @NYGovCuomo responsib… https://t.co/VnqEueZbXR"
"Don’t get mad cuz ion like chick-Fil-a that shit is Garbage 🤷🏽‍♂️ https://t.co/agCwJUY3M8"
"RT @OliviaMesser: On the subway fuming at the difference btw reactions to Meryl Streep’s statement (too late, not genuine) and Clooney’s (w…"
"@uncledonniewins @CNN So you work at Mcdonalds???"
"Pizza Hut needs to stop spending its dollars on me if the one near me doesn’t deliver"
"RT @G6D6P6: Could you marry someone who has the McDonalds app"
"can you believe @laguerawavy and i were together for over 24 hours and not ONCE got starbucks"
"Its always NY 🤦🏾‍♀️ https://t.co/1dw5Ys1pVb"
"@twitteebird28 @McDonalds lol you have to watch the episode to understand, but Rick mentions it in a scene and it catches 🔥 with fans"
"@richarddeitsch Was half expecting the sodas and beers to start flying, nWo-style. Or at least the @Arbys roast beef sandwiches."
"Teenage Mutant Ninja Turtles Raphael toy 2016 McDonalds TMNT on eBay: https://t.co/1Bi6CYBCG5 #tmnt #raphael… https://t.co/ql5e1urEiY"
"RT @SheepishWolf1: @NYCNationalist 100% agree. The subway is completely messed up and he is a walking abomination towards 34k of New Y… "
"State of the subway has really put NYC on a level with LA, transportation wise. Can't read in a car but at least you know why you're stuck"
"@wallycay I say this as I could take a subway and be there in 40 minutes\nNot quite the same but still I should just visit more often lol"
"I from Brooklyn, I rep Brooklyn all day. https://t.co/KAdiQk4NKl"
"wow RT @_HAYNES: Wow. Secret menus?! https://t.co/mMKuQ9DQSs"
"RT @ohmyyymanda: 🍃 Starbucks, fall scented candles, Halloween movies, fuzzy socks &amp; cuddles. Nuff said. 🍂🍁"
"“you work at Starbucks? You’re a barista? You want an espresso shot bitch?” 😂😂😂"
"Omg New York City ... ♥️#subway #new York #adonà #soprano #city… https://t.co/50PZlcoXQT"
"2017-18 Upper Deck Subway Vancouver Canucks set a treat for local collectors https://t.co/OUV8hiuPlp https://t.co/bThHXEQD7O"
"WEDNESDAY LUNCH (1): 11a-2p @buffalostate (Cleveland Hall in Cleveland Hall Circle) | Main &amp; Eagle (along the subway tracks DOWNTOWN)"
"RT @YeKerit: pizza only https://t.co/GDAIxVx1uq"
"A group of fed-up straphangers booted a belligerent subway ranter off the train, then tossed soup at him https://t.co/3plhEHTnzd"
"Literally making Nate drive me to McDonalds to get a sweet tea #BestCousinAward"
"L train passengers, you did amazing https://t.co/yC4qsCEZRC"
"Absolutely disgusting and disrespectful https://t.co/JaTBQNxRox"
"@pigmented80 All I have is $110 because I had to pay bills today and I did overtime at McDonalds so can you do $250… https://t.co/AuMUOmmgtJ"
"Chicken Beef\n\n#wendys\n#burgerking \n\nhttps://t.co/k5WdVMsMp0 https://t.co/yASd0v5c1o"
"#SamiZayn I think I see his #Wings :) #SDLive or maybe he means like those guys whom parade the subway"
"Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/XI8uLPa7vE"
"@hannahgoldfield But you can ride the subway drunk. Advantage: NY"
"Something Sweet! Burger King's New Cinnamon Toast Crunch Milkshake https://t.co/nOhRAH0KPK #stupidDOPE https://t.co/BQUk3eDpKb"
"L Train riders you’re doing amazing sweeties https://t.co/HwVX6ANpoM"
"RT @nushmoney: Why did this remind me of @Jay_Staxks_ https://t.co/bbWD7L6Vzy"
"Not in NEW YORK!!!! https://t.co/JuvfBWb4ZX"
"Subway story 3 of the day: bumped into a guy. he said he would kill me and then spit in my general direction. But I was in the train already"
"Gave up and making @Arbys cater it https://t.co/CMPkl0eIwI"
"How you get drunk off a lime-a-rita? Fuckin thot https://t.co/Gr2F50735g"
"@dpakman @realDonaldTrump or checkers"
"RT @jergarl: THIS IS A FREE COUNTRY. HATERS GONNA HATE. YA KNOW?\n\nStarbucks Barista: Sir, your order?\n\nMe:*whispers* one pumpkin spice latt…"
"RT @AlyssaGerstein: I have reached the point where I am making coffee at home instead of getting Tim Hortons bc broke. this must be rock bo…"
"White liberals.  Let me guess he's a Democrat/Hillary supporter. https://t.co/k4mHAqtDf3"
"Too Many ZOOZ - Warriors - Subway Gawdz - HQ https://t.co/SLk65zeJTJ"
"Why are we having July-level subway humidity in OCTOBER #climatechangeisreal https://t.co/ZHCAWIwooL"
"@ilysweettea Any excuse to eat Taco Bell lol"
"Stomp him out!! https://t.co/UHpclRw5Xq"
"@shrutithenaik @Adi_ction May be they had those chai lattes at Starbucks and suffering from low morale.."
"I think I have a reason to go to Arby’s now lol (other than location) https://t.co/RH6vtTVjqu"
"I wanna wish everyone a Happy Tuesday ladies roll up a J for your man and L ride to Wendys he's been outside grinding all day for you. 🙏"
"@greenblanket Ice breaker tip for @greenblanket ? Jack in the Box jalapeño poppers AM I RITE"
"Tht Burger King biscuit looks like it’ll suck the life right outta you w/o a bev"
"To the passengers on the L train: you’re doing amazing sweetie. https://t.co/4EeAxYklcC"
"how u a grown ass man getting this drunk off a thot juice https://t.co/iKoIytyhiv"
"RT @yashar: I love this - Burger King doing sponsored tweets of people complaining about Wendy's https://t.co/TqUR15XfKH"
"fake news back at it again at Krispy Kreme https://t.co/FsCfhuxuPc"
"I wanna dip a piece of Pizza Hut pizza in some beer cheese. That is all."
"Pet peeve... I know I'm being a bitch by saying it but this girl was just waiting for the subway and sat on the... https://t.co/KU5OL8c1pk"
"RT @JordanCwierz: Something went wrong with the ticketing system; tried to buy Star Wars tickets and ended up getting McDonalds Szechuan sa…"
"'NYU Law' Grad Hurls Racial Epithets On Subway… Earns Bowl Of Soup To The Face - Above the Law https://t.co/MsT4SganSu"
"I saw a hot guy on the subway then he started using a stylus and he suddenly was no longer good looking"
"RT @ltvsquad: When can we start talking about building entire new subway routes through Queens?  Every route is at or near capaci… "
"RT @ZayVeeeee: Lmao I love my city https://t.co/59SvhNf9bi"
"RT @CarHelmets: @WakefieldBxDave @placardabuse @NYPD40Pct @DunkinDonuts Woah, an actual Dunkin' Donuts district manager?! I didn't… "
"Reading @JessicaValenti's Sex Object is too real when you look up to see an old man offering a woman to sit on his lap on a crowded subway🙄"
"miss that corner of Starbucks Katipunan I'd park myself in to get work done"
"she really put on for everyone that has ever been asked by their mama if they got mcdonalds money...a legend https://t.co/L2yq3frTZt"
"@EricFPhillips @gracerauh Are you referring to the ferries that carry fewer people than a crush-loss subway car?"
"Trump supporters are gonna try to boycott #Eminem’s new album the way did Starbucks. Good luck with that.… https://t.co/VpRygW2LnM"
"RT @BoyGeorge: I'd pay £20 not to drink a @McDonalds coffee! https://t.co/dmhjPEJVWq"
"RT @nuffsaidNY: Trump supporters are gonna try to boycott #Eminem’s new album the way they did Starbucks. Good luck with that.… "
"RT @BrandnKardashn: Disgusting &amp; and who TF gets drunk off a lime - rita my ass can drink 2-3 and I still won't be buzzed https://t.co/DajI…"
"Retweet Until he is recognized and his name is made public to the world https://t.co/i11uuXiyVL"
"Got a hunnit guns, a hunnit clips.... https://t.co/ewnaehw53K"
"@emswears @Tayrichhh take her out to starbucks"
"Okay.. backtrack. What is Rick and Morty? Lols. I thought I was cool. I guess not. https://t.co/cQi2pUNNdR"
"RT @mtehuitz: Love subway folks, but I hate the subway service @MTA https://t.co/acKtklBhws"
"RT @totaIdadmoves: Offering to fix the ice cream machine at McDonalds cause it's always broken."
"\"Promoted by Burger King\" \nSAVAGE https://t.co/s0OyDyP6Mv"
"A lime-a-rita though? https://t.co/Kjfu4uX7N5"
"In regards to the Rick and Morty-McDonalds Szechuan Sauce fiasco, even Satan couldn't predict the turnout! (Hatarak… https://t.co/chCeEvuhde"
"I am cryinggggg at \"Promoted by @BurgerKing\" LMAO https://t.co/FS1Gd4ixxe"
"Awe hell nah https://t.co/0Cn24328iI"
"RT @stvcrtr: Burger King throwing shade via promoted tweets. https://t.co/5HJOQlGF0f"
"“How’s New York?” https://t.co/EhBFlBTVX3"
"F--k Papa Johns, now this is sweet! https://t.co/jGLrKsY5Rp"
"RT @layaamoon: If you're vegan &amp; still eating at Mcdonalds wtf are you doing honestly https://t.co/78hvBHgkKn"
"disgusting https://t.co/3MNMlqy6Sq"
"Red Lobster vs. McDonalds https://t.co/SF62tXKk2S"
"RT @AnimangaUSA: In regards to the Rick and Morty-McDonalds Szechuan Sauce fiasco, even Satan couldn't predict the turnout! (Hatarak… "
"I'm at Whataburger in Corpus Christi, TX https://t.co/fZT5riulKq"
"Some random number just sent me a work schedule and I just don’t work at Burger King so Idk someone’s not gonna get there schedule"
"I guess we've finally identified one of the million girls who \"would kill for that role\". . . https://t.co/HWJbRhDT1r"
"23 years riding the subway and I've never seen someone fall through the gap in between the train and the platform. Until today. It was me."
"RT @House_Feminist: [mcdonalds drive thru]\none McGiving Up please"
"RT @debsuniqueshop: Check out Starbucks snack tray espresso bean picture 2007 platter coffee #Starbucks https://t.co/lURXMmTFlx via @eBay #…"
"RT @lisacrost: I just found this beauty at a U-Bahn station in Berlin: A subway map that shows the amount of passengers with line… "
"RT @BigTymeSkier: Cold, left over Taco Bell for lunch #Fitness"
"@JBurtonXP If they want to void their contracts and work at McDonalds they can go right ahead"
"RT @AcleverNICname: he’s a lawyer... note that https://t.co/s67VnuA7ix"
"@Anncostanza1 I made a short list of things New Yorkers would rather vote for vs a Trump supporter.\nA subway rat\nCu… https://t.co/9IU343N2y5"
"That’s what he gets for drinking thot juice https://t.co/tJ3PuevYvS"
"L TRAIN LIT https://t.co/7EXdBNq6k5"
"I'm at Taco Bell in Houston, TX https://t.co/EXlSr1vdAF"
"RT @nelx97: I from Brooklyn, I rep Brooklyn all day. https://t.co/KAdiQk4NKl"
"This is exactly how racists should be handled. I can’t wait for someone to try me like this. They ain’t getting no… https://t.co/fSAy9tGK6F"
"Timeless design by Massimo Vignelli. You may have seen his designs without knowing all on the NYC Subway. https://t.co/MvXgWJeQt1"
"Just got me some chick-fil-a and waffle fries.. BLESS UP"
"Love how everyone worked together to get rid of this jackass. \nCan we find out if he's really a lawyer and inform h… https://t.co/uZWoeEc34x"
"🗣📢 \"Brought out the green metro card just to race the subway, brought the cash to subway,\nbought a sammich from... https://t.co/Xn9UwWa0sL"
"The man  that kissed the boo boos away and brought mcdonalds home. Had us rap battling in the basement, to our first shots."
"I’ve been taking steps to be more active d2d. Like getting off the subway 20 blocks early. Results= Increase in nightly mental health."
"New York knows what's up https://t.co/Y35Kteh2fR"
"Bravo to the woman who threw the soup at him 👏 https://t.co/ETMJpfsk4M"
"@NightieTime I was on a subway car so crowded this morn I couldn't hold on until the next stop and was terrified I'… https://t.co/W8963P3536"
"RT @beyonseh: i love this song https://t.co/vkPvMyO13X"
"I was supposed to go to Starbucks to study, I ended up having a mental breakdown... l o l"
"RT @wingstop: Be there. Done that. \n\nBring something fresh... not frozen. 😉 https://t.co/xi81olVFgP"
"And of course Chipotle ran out of rice and every meat so now I gotta get that foolywang by my apartment."
"Not too sure how to feel about this https://t.co/xwTc2Z0Vde"
"Wendy's is the real mvp forreal #CreamySriracha https://t.co/ZicfG7wKbL"
"RT @_VallAnderson: Why am I obsessed with Taco Bell??"
"@Drew_Magic_ So is McDonalds. Not my favorite restaurant."
"RT @Saressaa: I love New York.. dare to mess and you'll get ur shit rocked https://t.co/4GMt5eX3WF"
"that's my city 👏🏽👏🏽👏🏽👏🏽👏🏽 https://t.co/O1uMnx8iIH"
"@shanley You're not even worth taking out to McDonalds."
"RT @southernjawn: @Wendys Y'all getting eaten now &amp; later?! https://t.co/bCup74Fwax"
"@shieldxsection Not @ you dragging McDonalds 😭😩 But deadass about the Roman part 😍😍🤤🤤"
"RT @Braveheart_USA: Government owned aircraft use is being scrutinized, so @NancyPelosi flights will all be reviewed? \n@realDonaldTrump… "
"I often take the L train... Scary times we're living in...... #nndic https://t.co/OAR9fXtRRZ"
"RT @UglyGod: LMFAO HOW IS SHIT NOT VIRAL. WINGSTOP AND WENDY'S HAVING A RAP BATTLE 😂😂😂 https://t.co/C4EusWWMlQ"
"Too bad it's still 80 degrees outside https://t.co/4IppUmXla3"
"It's really awkward when a rapper on the subway doesn't finish his verse before the next stop."
"soup throwing lady youre doing amazing sweetie https://t.co/ugGsmhf7aB"
"Colonel Sanders was right\n\nKFC became a fucking disaster after he left https://t.co/7twVxI2xYU"
"@kansasmyass I cry on the subway literally every day"
"RT @WhatsTrending: Why are all of these nerds rioting over sauce?!\n@RickandMorty @McDonalds https://t.co/w2Rg7j5iYE"
"RT @iFreakum: The crowd did the correct thing! fucking unbelievable 😡😡😡 https://t.co/Zu3OF6r6Lr"
"RT @_zolarmoon: Imagine being a teenager in subway waiting to order ur food &amp; a customer pulls a gun on u bcus he &amp; his wife felt \"… "
"RT @shanedawson: these @JulienSolomita pins go really well with my taco bell stains! get yours today! https://t.co/P8KDUkiryp"
"You need to stop being wimpy about this and get it back https://t.co/LfVG7FV1bS"
"RT @scottvernet: if you live in new york city &amp; your preferred choice of coffee shop is starbucks, you are an absolutely awful person"
"Why does Burger King tweet memes without pictures? Lmaooooo"
"World needs more of this https://t.co/fu4PdUZQE0"
"RT @shuttupchris: A limearita https://t.co/WpOmP7vX7H"
"I love being here https://t.co/KmbDg8XPkh"
"@starbucks #upstanders is what we're all about. https://t.co/uLYRNXSN1j -&gt;  whole playlist of changemakers. We do this for &lt;3."
"I knew it was the L train. https://t.co/cFXH4FRbEV"
"The worst 💩 always going on the L train. https://t.co/tFxHpL84rD"
"This shit is so. Funny. https://t.co/MlUn3VXrQZ"
"Alright New York! ✊🏽 https://t.co/K45IuAhH8T"
"I need a free personal chauffeur to pick me up from the subway station"
"“Everybody who went to go get Szechwan Sauce @McDonalds is a total Jerry” - Gaby’s friend #RickandMorty @adultswim"
"RT @yunghyna: now THIS is the america i fuck with!!! racist people have no place on this earth!! https://t.co/p3cjHQgB66"
"RT @Obey_Ellee: Target is not a date, McDonalds is not a date, parked car conversations is NOT A DATE.Don’t play with me ok? Twitter is get…"
"@deadspin @girinathan @barry @lindseyadler @laurawags update: @hannahrkeyser on subway: \"When was the last time I even bought milk?\""
"NYU geomagnitism study in dim sum parlors are guinea pigs in NY subway is exerting on TNT. take away our arcane symbology"
"A burger brand is publicly begging Amazon to buy it — and it shows tha...https://t.co/ncvCQFzH0H"
"@danvellone Oh like your house stuff. Try living at Starbucks."
"RT @CrocOclock: Out of all collaborations, WWE chooses KFC's Colonel for WWE 2K18.\n\n#WWE2K18 #KFC #NintendoSwitch #PS4 #XboxOne https://t.c…"
"I was gonna get a Papa Johns pizza with that B1G1 deal but then I found out the one pizza with the coupon costs  $18.\nlol no, Dominos pls"
"RT @UberFacts: KFC's Colonel Sanders was once a lawyer who assaulted a client -- He also killed a man in a shootout."
"Okay that may not be a date for you. Some women appreciate the little things, clearly you not one of them 🤷🏽‍♀️… https://t.co/VE9Z3KSCij"
"@AdamMyerson I'm waiting for the subway actually but it just came"
