"Starbucks is beyond overpriced."
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"@McDonalds new idea for a seasonal item. The McTurkey™ sandwich for thanksgiving."
"Anne Hutchinson's house... thanks Chipotle https://t.co/uQrtGOHIBl"
"I might set a Stanley Black &amp; Decker record for amount of time Chick-fil-A shows up on an expense report"
"RT @nihilist_arbys: It's Columbus Day, so we're gonna sail over to McDonald's, beat the shit out of everyone, wreck the place &amp; call it arb…"
"RT @OohWee_itsVee: No one wants yalls pigeon nuggets! https://t.co/XjOh0dpTYp"
"RT @Dintrification: Ducked up the Burger King on myrtle isn't 24 hrs"
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"Hey @Starbucks when will you start delivering"
"To enter the U.S. wizarding world and board the train to Ilvermorny, do you have to run your cart thru the bathroom door of a Dunkin Donuts?"
"RT @AllyBrooke: Hahahhahaa. Omg. This photo is so old!! Major throwbaaaack 2014 I think? This caption is everything 😂😂😂 https://t.co/MADVqg…"
"New autumn carved turkey at Subway is the real deal #believethehype"
"I've always been curious why @SUBWAY doesn't have a sweet bologna option."
"RT @BlueSea1964: 🚨 Fmr Liberal MSNBC Host Krystal Ball Admits Hillary’s Silence ‘Makes Us All Look Like Hypocrites’!\n\nSurprised? No\n https:…"
"No problem here! https://t.co/Egz2CHjRji"
"If got a dollar every time starbucks has been spelled my name wrong I’d have enough money to buy more starbucks for the rest of my life."
"Is it possible to get food poisoning from a chai latte from Starbucks? Because that's all I had yesterday before I got violently ill."
"RT @floral_dad: something i over heard a very lawyerly man say over the phone on a subway once-\"of course cats cant read Dave\""
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"@AndrewMcgrady So surprised no one on here has bashed you for this yet... I don’t even have a Papa Johns near me uni05Cry, just a Domino’s"
"@JordynneGrace @Starbucks JORDYNNE any chance I could get a follow back? #SOVEREIGN https://t.co/DOiPQR1uQK"
"I'm at Starbucks in Pittsburgh, PA w/ @a_a_alrashed9 https://t.co/QQdsSukIR0"
"RT @Arbys: Sit boy! https://t.co/rwUIkYZ9bF"
"There was a sign that said \"do you like tacos and horror?\" Is that like the shits you get after Taco Bell?"
"The disrespect. https://t.co/nIIli7k3ag"
"Just found out there’s no #Starbucks in the mall I’m transferring to. Hold up while I cry my eyes out #onewaytosavemoney"
"I’d do anything for this to happen tbh https://t.co/YdqwJ2J9Ba"
"Man Accused Of Sexually Assaulting 2-Year-Old In Chick-fil-A Bathroom https://t.co/ZateNUoQRu https://t.co/IyQyw9LQrU"
"RT @RichieIsEvol: @Wendys are spicy nuggets back yet?"
"I love this. https://t.co/FFCirdZHyM"
"@nicholaspacitti THIS IS LITERALLY OUR RELATIONSHIP https://t.co/Zi70zkUWIb"
"RT @HOBOrlando: Don’t miss out! Stop into HOB Restaurant &amp; Bar for Chipotle Bacon Mac &amp; Cheese before it’s gone! Book your table at… "
"Pumpkin frozen custard has been A THING long before Starbucks! Get it today or go for our Caramel Crunch flavor! https://t.co/RQneH1Ved9"
"Join the Starbucks team! See our latest #job opening here: https://t.co/T1VdH0h4OO #CustomerService #York, PA #Hiring #CareerArc"
"RT @ps4andchill: bae: why tf pizza hut keep texting you \nme: https://t.co/7upSqUqkl1"
"@ZippersNYC @BernieUpstateNY @CakedaddyINTL @Clarknt67 @ProfessorDNA @lumpylouise @CarloScagnelli @BernardSander23… https://t.co/eKGeYeXjqO"
"If u get 3+ drinks in the starbucks drive thru i donut like u"
"Trump: We're here to take the IQ test so that--once and for all--we can prove that I, Donald J Trump, am SMART\n\nCashier: This is a Starbucks"
"RT @syberbitch: Starbucks leaves me with like -5 I feel your pain too well https://t.co/6972UvLaXt"
"@Arbys Quick, someone make a Revive meme."
"Me when this kid in front of me at Chipotle got a burrito with just chicken and the tortilla and nothing else on it… https://t.co/z8Hy0oBXGl"
"Who gives a fuck, shits trash anyways. https://t.co/IhoJYxiPZb"
"RT @saksappeal: What if @SEPTA Regional Rail trains ran more like the subway? @alon_levy says its possible with a few tweaks: https://t.co/…"
"@FartHog69 @McDonalds My point was about them not realizing the amount of demand for the sauce vs what they supplied, but ok..."
"GO TO CHIPOTLE TODAY AND SUPPORT WILSON THEATER THANK U :^)"
"Whether going for modern or classic, this subway brick #tile with 3D beveled edges could fit the bill. #HomeDecor… https://t.co/Wx7Vk8qrD6"
"RT @FWPshow: Has anyone ever gotten hot sauce AND napkins in their Taco Bell bag?  I believe it’s company policy that you get one or the ot…"
"I like your music n all but bruh you fuckin crazy for this one https://t.co/bzJ005AMiB"
"RT @McDonalds: You spoke. We’ve listened. Lots more #SzechuanSauce and locations. Details soon. And that’s the wayyy the news goes! https:/…"
"Oh Arby's\n\nNever change https://t.co/wxhHXP7edX"
"@waileamarriott Tiffany @Starbucks is incredible, I went in twice today and she remembered my name and order! #attentionpays"
"Wow they are good... https://t.co/XEmYewW54C"
"@ArachnaCat Yeah idk the angle behind @Arbys with Inuyasha either; but it won’t be long before Naraku rises again t… https://t.co/rgWOtvUZsM"
"I remember why I stopped eating Taco Bell now"
"LOVE THIS https://t.co/ThsTcB6GDQ"
"RT @WickedTags: The Lion Burger King\n#FastFoodBroadway"
"RT @PittWCIH: Calling all Chipotle lovers! We've teamed up with the Chipotle on Forbes today from 4-8pm. Details in the flyer att… "
"The Burger King and I #FastFoodBroadway"
"RT @jgmoore: #Ferguson Baker Goes From Two Hand Mixers to Supplying @Starbucks https://t.co/hcTllktwEa"
"I'll take a beef and cheddar with a side of Half Demon Angst https://t.co/qAoGRassMn"
"Make m- *thump* https://t.co/75OUuap8Fi"
"RT @kfc: “Would you like to be playable in the WWE 2K18 video game?” they said. “As long as my physique is 100% accurate,” s… "
"ATTENTION: Taco Bell has now put their breaded chicken triangles in a QUESADILLA this is NOT A DRILL."
"Chipotle fundraiser today! From 4-10pm, you have the perfect excuse to go get a burrito! 🌯🌯"
"are you good https://t.co/BNB8c6lYfc"
"RT @WilsonTheaterCo: Chipotle fundraiser today! From 4-10pm, you have the perfect excuse to go get a burrito! 🌯🌯"
"For our vegetarian friends, Chick-fil-A has you covered too!  #ChickfilAMoms https://t.co/EvP4PCTrz6"
"@CNN running out of fake stories? https://t.co/KJD1PcbtmP"
"Kudos to the anti-fascist tie-dyed grandma who threw a glass bottle at this asshole. https://t.co/DOs0bfXaUO"
"RT @alexsuuh: Wtf, I got declined for a medicine ball tea at Starbucks and I check my account and all my bills Wanna charge my account toda…"
"RT @JMoney731: The Taco Bell Jar\n#FastFoodBroadway"
"RT @hannnahsh: I want Taco Bell"
"RT @robyndwoskin: The Burger King and I #FastFoodBroadway"
"I've got #Texas to take the W in this week's @Wendys #RivalryBee! Who's got your vote? https://t.co/chD4ptetwt"
"RT @Jake_Vig: They called my name for my drink order at Starbucks, but I’m not answering until they say it with some goddam passion and con…"
"\"Promoted by @BurgerKing\" 😭 https://t.co/hPhxetMFoU"
"RT @PhiMu_UK: Come out to chipotle tonight and support @PhiMu_UK and @UKPhiGam for Bonnamu! 50% of the proceeds go to the event!!… "
"10-10-2017 @ KFC - Kentucky Fried Chicken https://t.co/oZJFZdJ057"
"RT @vplus: Pizza Hut delivery is getting 15 degrees hotter \nhttps://t.co/LO5PQe0bDz"
"I still don't have my Szechuan sauce @McDonalds https://t.co/NEadlUyLhq"
"Victor McLaglen - the first man Jack Johnson fought after becoming World Heavyweight Champion (exhibition bout). https://t.co/k624Lqf8Of"
"I just watched the McDonalds hiring manager yell at this boy because he wanted to work here with a Penn State degree. Inspiring."
"we have a 16 hour drive today and guess who instead of sleeping stayed up all night talking to an arbys employee on tinder"
"RT @lukeoxendale: we have a 16 hour drive today and guess who instead of sleeping stayed up all night talking to an arbys employee on tinder"
"RT @CoachHolko_LC: All of my NEPA followers! Make sure you stop by Chipotle this Sunday 4-8pm! #SupportWBB https://t.co/MAqRS3ToS9"
"&amp; bacon fondue fries https://t.co/u1fjZoVD8w"
"chipotle queso is pretty disappointing"
"OMG DANNY ARBYS MVP OF THE WEEK https://t.co/u8KKPFIIuF"
"RT @espn: It doesn't get much better than this!\n\nVote for the winner of this week's @Wendys #RivalryBeef matchup below: https://t.co/9Ttl9Q…"
"@espn @Wendys Free speech off hours and you suspension Hill. ESPN hates African Americans who sleek up for injustice. #espngotohell"
"RT @JPLSherlocked: @espn @Wendys Free speech off hours and you suspension Hill. ESPN hates African Americans who sleek up for injustice. #e…"
"@little_greeny_b It means u get mcdonalds ;)"
"Too upset to spell check. Simply Go to hell ESPN with all the Trump white men https://t.co/VbYldppPDs"
"@BurgerKing can you believe this?! @wendys doesn't sell spicy chicken nuggets still.. bk.. my way.. !"
"@TheReal_EmTeeAy @espn @Wendys Cancelled my cable of all ESPN. Hill not allowed free speech on own time. Go to hell… https://t.co/fAx0dbcAOt"
"Everybody that's works at this #McDonalds @McDonalds has the nastiest attitudes. If you don't like customer service go get an office job"
"@Sorenova @McDonalds Ketchup on a Big Mac? You monster"
"i just walked into a burger king listening to music from the new blade runner and for the first time i realized i was living in the future"
"Trump White House is white bread white, white rice white, no wonder trump and pence have no clue what NFL protest i… https://t.co/bx0NzWGmV5"
"Hey @danharmon, how about u hold the extra shitty “oh so smart” fans of ur show accountable for turning the @McDonalds thing into a fiasco?"
"Taco Bell is hands down the most non driver friendly fast food"
"RT @TheKevinRice: Met @jodyyobro on the subway. Go follow my man"
"Yeah I definitely want Taco Bell"
"Hey Delsin, heard you're getting banished from the tribe for setting fire to that Starbucks. https://t.co/O7RbEYYCwx"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"RT @veneficaultrix: Imagine giving up Mcdonalds because of a fucking sauce and not the horrors of the meat industry lol"
"The 1975 just came on in Taco Bell. Highlight of my day"
"The ladies at Starbucks on campus already know drink order 😂😂"
"@jberkezchuk I like to take pics in my ugg boots and north face with our starbucks labels showing"
"RT @SI_Eats: A five-story Chick-fil-A is a thing that's happening. https://t.co/w781ATvhYo"
"Random guy and I just bonded over how fucking obnoxious teenagers are in the subway"
"RT @TheTumblrPosts: dont look at my twitter to see how my relationship is going I could tweet “I’m so done” n it’ll be cos my mum didn’t ge…"
"NYC’s ‘Lime-A-Rita Racist’ says he ‘isn’t that sorry’ for his subway tirade: ‘It’s the First f*cking Amendment https://t.co/55FDiFQ5Zb"
"Stop by Chipotle on Forbes ave tonight and get some grub! If you tell them that PULSE sent you we get half of the cost of your meal!!! If y…"
"walking down Forbes and I passed a McDonalds and at least 400 Rick and morty fans were rioting about Trumps Sauce ban. Oh and I was slammed"
"fucking soccer moms talking on the phone while driving is the worst thing to happen since the Krispy Kreme closing by me"
"RT @DJMany: Thanks, Rawrrrrrrr!!!! 😘🍔🍟 https://t.co/JCb1ijyjii"
"RT @RedbirdMenace: Rick and Morty fans are behind the times; Bojack Horseman fans have been lining up at McDonalds to get depression for ye…"
"@RobotInTheBox Our local subway sucks"
"Been eating Chipotle heavily lately, but the shits been BOMB!!!"
"RT @MHHisapenguin98: I love how the promoted Tweet underneath is KFC like that relates to @shanedawson so hard! 😂👏🏻👌🏻 https://t.co/YWEBesLY…"
"@TheFakeAlbert Vanilla Pink Berry sounds delish. New Starbucks flavor?"
"RT @iAmMasonLevi: just had the best taco bell experience of my life and then a small asian man flipped james off"
"Don't let that sweaty guy fool u lol https://t.co/87Wh93pibT"
"When I tell @hello_kimmy2 were going on a date but we to to burger King https://t.co/A3oJqYrOoM"
"RT @KlausBromi: Nerds getting rewarded for becoming dumb, angry mobs has been a terrible trend over the last few years. https://t.co/03h8RQ…"
"Want to work at Panera Bread? We're #hiring in #Monaca, PA! Click for details: https://t.co/1deKZy1wsu #Hospitality #Job #Jobs #CareerArc"
"RT @kpastewka: when you realize Chick-fil-a is closed because its Sunday.😑"
"Every time I’m adventurous with my Starbucks order I regret it"
"@Wendys since your burgers are never frozen what do you do with the leftover patty’s that you can’t use anymore?"
"Coming 10/12 5-7pm, Fire Prevention Event @ #McDonalds at 1 Shadow Oak Dr, Mechanicsburg, in partnership w/ Silver Spring Community Fire Co."
