"I just earned the 'Middle of the Road (Level 5)' badge on @untappd! https://t.co/SVs057bwKE"
"Ain’t no hype! The real deal. Nice job OFBC! - Drinking a Hype Juice @ Old Forge Brewing Company - https://t.co/iRxmvCvEwU"
"RT @TheDIYideas: chicken bacon ranch fries 😋 https://t.co/YTBiOjnD5K"
"Due to time constraints, I was forced to eat string cheese much like one would chomp down on a carrot. Needless to say, I now hate myself."
"RT @mypassion4food: Grilled cheese get in my belly\n#food #foodporn #foodie https://t.co/UZ1FqLAwVV"
"When do they start selling Girl Scout cookies 😩"
"RT @NYCMayor: Game on. If the @astros win, we’ll send you a case of @TheBronxBrewery beer and a dozen cannoli. What’s in it for N… "
"RT @PittCabe: @The_Incline @Pitt_LykeAD I don't know maybe.  Work with then on a compromise. They donate 15% to a charity or some… "
"RT @GlenmorganBar: Enjoy Buffalo, sweet-chili BBQ, or roasted garlic teriyaki Jumbo #ChickenWings, served w/ celery &amp; carrot sticks an… "
"RT @Quaandadon: This new wave of DICKHEAD \"comedy \" yall tryna create is lame as fuck. https://t.co/X88ZXZdN5l"
"Beer and spirits for sale at the @freshfridayslfm !  Find us here at 7th and Hamilton until 7!… https://t.co/QHnQvfmQ8H"
"Feta Cheese Nutrition Is Powerful https://t.co/MJZdNK60G5"
"RT @FlashSticks: What a crazy #German🇩🇪#idiom!🌭You need to check this!😂#learngerman #deutsch #deutschlernen #mfl #langchat… "
"I talk with my hands so much that I spilled a beer on myself."
"Drinking a Goose IPA by @GooseIsland @ The Bridges Golf Club — https://t.co/CrOOMudchf"
"ALL WE WANT ARE SPICY NUGGETS BACK! NOT LONG NUGGETS!!! https://t.co/s4vlKUTOi7"
"RT @yourlru: if you skip the meat you could save 200 animals per year and 220,000 gallons of water. https://t.co/lMSUCfyxkk"
"#beer30 #BEvERage30 - Drinking a Maxwell's Scottish Ale by @rivertownebeer - https://t.co/1tLr2TeUYT"
"All the way live... - Drinking a Citra Hopped Live Pale Ale by @stbcbeer at @stbcbeer_pgh  — https://t.co/fZ6HfEFGFT"
"Just added Oktoberfest by @lakefront to our menu https://t.co/PGOKMSczaT"
"Friday night pizza ftw"
"RT @HXRLEEN: Drake must have come thru with the air max’s so homeboy.....got it https://t.co/mokIBWp2oj"
"@JanethNBNY Where you goin? Chuckie cheese?"
"@XF_Unreal Pep and sausage"
"RT @Stonekettle: I don't want to hear another goddamned republican crying in their beer. This their mess. They KNEW. Take action or go fuck…"
"I found the leaked script to the new Addams Family movie directed by the Sausage Party guy https://t.co/QmPrIVRnpN"
"Hoppy in the right ways... - Drinking an 2X Unfiltered IPA by @stbcbeer at @stbcbeer_pgh  — https://t.co/15C4impiUJ"
"RT @theAshLeon: me: [cakes getting smashed to smithereens]\nhim: [already gripping my neck with crackhead strength]\nme: harder\nalso,… "
"RT @finah: how about you mind your business https://t.co/uh2A8gm2sd"
"\"It's beer o'clock\" thought the middle aged man who has a dorm fridge in the bathroom serving as his kitchen."
"RT @envydatropic: My friend ordered an entree but said hold the bacon......I'll miss her"
"RT @12ozSports: Subscribe to our YouTube page for live updates, or to listen to old shows: https://t.co/TIB0bGlRNd #podcast #PodernFamily #…"
"Pumpkin spice beer."
"@boneshire_brews #boneshire #indiecraftbeer #freshhop #ipa @SunnyBraeHops #s... (Fresh Hop) https://t.co/V6PROu1TX6 #photo"
"why couldn’t you jus eat the pizza and leave? shits stupid https://t.co/Wdg01gmCNt"
"Get $10 off wine, spirits and beer on your first @minibardelivery order. Use code: MP043579 https://t.co/ht8UZK45h6"
"@Stanford U: USA 🇺🇸 @DittmersMeats, LOS ALTOS, CA - BUTCHER SHOP, DELI, FRESH SAUSAGE &amp; IMPORTED FOODS - SAMPLES TO… https://t.co/ILImQDX07L"
"How come when I used to drink 10,000 calories worth of beer my dad told me I was trashy? https://t.co/vCxC22NAnT"
"Pear, Blue Cheese, &amp; Walnut Flatbread on Martin's Party Potato Rolls! https://t.co/GEE0WSwA68 https://t.co/ObK0MbHHKD"
"Have you tried any Irish red ales? Check out what our beer columnist had to say about one he drank recently.. https://t.co/khcweDLyOO"
"WH Grindley 6 in. Bread Plate Set Staffordshire Ironstone England Set of 7  #Grindley https://t.co/30wjSQAgmo via @eBay"
"Bacon: Yesterday, Today and Forever. https://t.co/kfYYrAo56p"
"Learn how to make caramel apple bread pudding with this recipe from @DelishDotCom at https://t.co/vIkvUTcASE"
"@Loehr44 @SalSports Young Ham and cheese footlong sub with lettuce mayo oil n vinegar peppers.. or ‘Young Footlong’ for short I guess."
"Deschutes Black Butte Porter on tap now. https://t.co/T8bvuVgl41 @DeschutesBeer #onlyatapps #BeerMenus"
"@RealJamesWoods @NewRepublic \"God is Great, Beer is Good, and People are Crazy\""
"@AmericanHotLips Throw a big juicy slab of pork on her tray topped with a pound of bacon and send her on her fkn wa… https://t.co/TwuSImZLfm"
"RT @JustinTuck: That's the Osi I know https://t.co/tLmDuYlySv"
"RT @evergrainbeer: Guess which beer is back....Space Face!  An American style IPA brewed with Galaxy hops. #evergrainbrewing… "
"RT @CloydRivers: Friday the 13th might be an unlucky day, but when you live in the land of bacon, badasses and bald eagles, every day is a…"
"RT @ComedyOrTruth: Rt for yeast rolls from Texas Roadhouse like for Olive Garden bread sticks https://t.co/fpOFJv6huT"
"RT @ItsFoodPorn: Chocolate Cake is bae. https://t.co/ed2j6vy8IN"
"Fans keep tossing pizza on 'Breaking Bad' house\n\nhttps://t.co/BxyfNHgjVy"
"RT @halstclair: I’m here for a good time not a long time. https://t.co/ozaITrpql2"
"Exit 16 DIPA in a Crowler--can't imagine a better beer to start your Friday--Manoa Beverage is the place… https://t.co/Tg1X6gC5x6"
"RT @goodhealth: These vegan cheese recipes taste like the real thing https://t.co/3GWRT2BzFg"
"RT @PosiFawn: GET THE GRANDE INSTEAD OF THE TALL. TAKE A NAP. BAKE SOME COOKIES. PAINT YOUR NAILS. USE THE BATH BOMB YOU’VE BEEN… "
"@BlueBloodsBlue @ImproperColby @SirDanielCase @usnews The main difference between apples and cakes, other than fibe… https://t.co/Fa9wrGdAay"
"Very clean... - Drinking a Why the Helles Not? by @stbcbeer at @stbcbeer_pgh  — https://t.co/XxakBCSDB4"
"New Beer's at The Farm House Restaurant!!!"
"I can't wait for my night of rom coms and pizza"
"RT @holyhoundtaps: Just added NVP (Nitro Series) by #BreckBrew to our menu https://t.co/V8MUVl00gJ"
"RT @TheVFL_: @EASPORTSFIFA @EAHelp @RobHodson_ - I appreciate FUT is the bread-winner and most important, but you've got 49,000 really angr…"
"RT @DlYRecipes: Chicken stuffed cheesy bread 😋 https://t.co/1ri58K9y4a"
"@DianeEarnhardt @DaveD_40 ty❤glass in paws from his favorite trail.been ruined by people breakin beer bottles.cant go anymore.goin 4 6 years"
"RT @CollinRugg: NFL: “We get first place for being the most unliked organization this month”\n\nBoy Scouts: “Hold my beer”"
"Apparently anyone can be a king nowdays... - Drinking a Pumking by @stbcbeer at @stbcbeer_pgh  — https://t.co/F7C8tHEQ1F"
"Lovin' the Eagles!  Weekends are for chillin' with PVT Wings and Craft Beer! So many delicious options.\n#Eagles… https://t.co/eHldD2qF1u"
"@meghanjules haha I wouldn't even be mad. Those donuts are delicious!"
"RT @Julie_Weathers: @w_terrence Who the heck wastes fried chicken throwing it at someone? That's as bad as the college students getting… "
"@iTimRo Yeah. Can you bring beer or whiskey. Thanks 😁"
"Find out all the Rutter's locations that have Beer Caves here! https://t.co/tyNphy2GgE https://t.co/K9GQSvUyg7"
"RT @MSI: ADDITIONAL PIZZA. https://t.co/67gw7GpOuX"
"It sands down the rough edges a good bit... - Drinking a Cold Press Coffee Pumking at @stbcbeer_pgh - https://t.co/XvH0r5T2CY"
"RT @Boulevard_Beer: Clothes.\n\nTreat yo self.\n\nFragrances.\n\nTreat yo self.\n\nBoulevard beer.\n\nTREAT. YO. SELF.\n\n#TreatYoSelfDay https://t.co/…"
"@QuitaBonquisha @QuitaBonquisha That's crazy! Was that your first time trying that pizza?"
"Surveillance cameras capture knifepoint robbery at Dunkin' Donuts https://t.co/8b4YAgZK7v https://t.co/Ae4Sa5h75K"
"@Maximal_Change Went from least favorite to most. Esp smoked on the grill w/mesquite served with goat cheese and a fine balsamic vinegar"
"@Dartmouth_Diva Pepperoni and sausage, from a local Italian family. They take every summer off and close the shop t… https://t.co/IN3Jq8nu0w"
"Just a few of our many helpers today.. thanks to everyone who helped out! Remember, donuts will still be sold tonig… https://t.co/wItrQ0bum7"
"Sweet Corn, Bread, Puddin, Vanilla, Let's Get it today at #LIVEMIXING 530pm EST right here on YT. #DIYejuice https://t.co/wdPDPJWzmb"
"“I’d like to make a toast.”\n\n*pulls out loaf of bread and toaster appliance, fumbling as a try to remove the twist tie*"
"@Boneshire_brews #indiecraftbeer #azaccalyse #ipa - Drinking an Azaccalypse at @boneshire_brews - https://t.co/Z3Y2UQO9L6 #photo"
"RT @Bossip: Smashed The Homies? Drake Rumored To Be Homeboy Humping Bella Hadid's Airmax Loving Cakes After The Weeknd… "
"Me: what kind of problems are you having why are you in the ER today\n\nPatient: I don't like soda"
"Want to work at Panera Bread? We're #hiring in #Princeton, NJ! Click for details: https://t.co/KrQSP3Vf3d #parttime #Baker #Bakery #Job"
"@CaleWelborn @TheHerdNow Stop selling beer at sporting events"
"RT @HoldMyBeerGif: Hold my beer while I do a backflip right near the edge https://t.co/PsvGn4WiGH"
"RT @QueenzFlip: PIZZA TOO DAMN GOOD I LOST MY MIND !!! THE KICKED ME OUT BECAUSE INSAID THEIR PIZZA IS GOOD https://t.co/mdfR5Oxtjo"
"I love @dominos chicken Alfredo  bread bowl... I just wish they made it bigger"
"Easy drinking and fantastic maybe better than th... (Fat Tire Special Release Belgian Style White) https://t.co/nr8FqhU4Mo"
"I just want to play the arcade version of Bubble Bobble with beer is that so much to ask?"
"RT @itsqueenss: When they order pizza but it's not Dominos https://t.co/mGAbeZXMG1"
"Just Tapped: Pizza Boy - Brewery Pilsner  / German Pilsner / 4.60 %ABV @pizzaboybrewing #craftbeer"
"NEW POST: Chocolate Tombstone Snack Cakes\nThey're to die for! \n\nRECIPE: https://t.co/DFXFsMbA8K https://t.co/blaO5ety0A"
"YOU TAKE THAT BACK! https://t.co/Wg4shltcVw"
"RT @Eppi54: @CBSNews All you know is your wife's ketchup company. Go away Herman Munster"
"Why does wheat bread smell better toasted than white bread??"
"our department director is conducting an interview while drinking a beer"
"I'm at Dunkin Donuts in Dillsburg, PA https://t.co/WWAef3gbu0"
"@beesponsible Honey on pizza? WTF is wrong with you"
"RT @JoeyGraceffa: I want French fries so bad! 🍟"
"RT @CanadianFCA: FCA meeting on Monday, Oct. 16 @7!! Come to the football field for some milk &amp; cookies, a fun game, and a surprise guest s…"
"RT @A_single_bear: Hello, I am a bear. Where can you get bread? I am asking for another creature.\n\n(I am sorry for the deceit. I am the one…"
"RT @MissAshleyDoris: Guilt free pizza recipe🍕🤔 check it out here😝👉 https://t.co/EnCcjWlNqZ https://t.co/pzpFTRuEF0"
"Young Beer. Got it. https://t.co/uOI2yGAjsi"
"RT @HatfieldAnne: 78 of my last 78 servers heard me the first time when I asked for more bread."
"RT @clodlester: day 13: pumpkin spice pumpkin cookies https://t.co/PYs1Fx9Uh0"
"RT @laura_hudson: Internet: Some reaaaal bad takes out there this morning, you have what it takes to top them?\n\nApple: hold my beer… "
"could have abs buttttt pumpkin beer &amp; Halloween candy are priorities rn 🍺🍫🎃 #balance"
"RT @shanedawson: check out today's new vid! **BUYING A $1000 PIZZA** https://t.co/TJaYIOfvHh RT  ? :) https://t.co/Qgb003m5W1"
"RT @PornEdits: Love me some pizza https://t.co/z76w93QL7p"
"Tart tart tart... not much else.  But who cares it's a sour... right? - Drinking a Sour Opal - https://t.co/pIIhkufdto #photo"
"Fantastic - Drinking a Freemang by @SpoonwoodBrewin - https://t.co/OTglTvHtbF #photo"
"@PRachfalski @dominos I see cheese all over it. You just got weird toppings you freak"
"RT @MommaTBlog: The Pork Slider with bacon, cheddar and bbq is delish! The Frogtown Bistro at @PoconoWinery PoconoWinery… "
"@jbabramowitz @Bluepurplerain Isn't \"cake daddy\" like a \"sugar daddy,\" but owns a bakery? Or is that like a \"baby d… https://t.co/888JgYlS09"
"@draebird What I would give for some chicken nibblers and those Lawry's seasonsed fried 😩. And maybe a banana pudding milkshake"
"Listening to O.A.R. on a @SIRIUSXM #Exclusive. Don't not what it is, but I gotta have a beer when I listen to #OAR #GoodStuff"
"Sounds like New York. Service charge was ridiculous tho smh https://t.co/XUA2fbPJYg"
"Packs a little abv punch - Drinking a Space Juice by @LongTrailBeer at @tedsbargrillpa  — https://t.co/GFM8JPwr5E #photo"
"Post from 3 years ago today: Pumpkin Gingerbread Cookies #recipe #icancookthat #archives https://t.co/ggVSmvR36P https://t.co/xPmm8xPTvc"
"Yea the pancake block he had. I was referring to the play at the goal line when he was dragged five yards after the… https://t.co/SnJ8Aa7SXb"
"Hot and Spicy Fried Chicken!! #Waynepa https://t.co/m5A71CO8C6"
"We're proud to serve the @astros in the ALDS! NEW in our #ShareYourStak Series Matchup- the New York Spicy Sausage… https://t.co/1MXFfmPOKG"
"Get to the brewery this Saturday! We're celebrating our 1st birthday and we have a fun day planned including beer,… https://t.co/eD8fZsu2i2"
"All I want is someone to just hold me and tell me everything’s going to be okay... and some McDonald’s french fries ☹️"
"RT @Sci_Phile: Propane Powered Bottle Launcher Captures Gorgeous Chemical Reaction in Slow Mo https://t.co/5vb8NvD8Eo https://t.co/b8Q4AS3l…"
"Pesto chicken meatballs with sautéed peppers and tomatoes with rosemary French fries. I love my… https://t.co/P9gBopUAfB"
"@s9ecia7k_Sway I always get the same thing lol Fettuccini alfredo with shrimp and the sausage potato soup! It's to die for!!!!"
"@ML_Propaganda @YoungDonDraper @H_aLLanYork1 @Kambeii @WaskelweeWabbit @prageru Or this https://t.co/bNNuciNOGZ"
"Best pizza in Pittsburgh?"
"THE CAPTION https://t.co/dAV7mWp7Bp"
"RT @distracted_monk: Woman on subway: Are you weeping?\n\nMe: It’s fine. I just remembered I have a frozen pizza I can throw in the oven toni…"
"RT @UgIyPPL: pizza accepts you for who you are"
"“I guess I’m not getting a fucking pastry then.” -Marj"
"RT @sammserve: mettaton should market some alphys-inspired soda and call it alfizz"
"@Meeeeeker Play it by beer."
"LEFTFIELD (Reason &amp; DOC LVLY) - Support Real Pizza"
"Ore like 4.32ish. .....thanks Todd! - Drinking a Nobody's Robot @ Morey's Beer &amp; Cheese Shack - https://t.co/dtJMEi4Zrj #photo"
"RT @SunshineJarboly: one time my dad was arrested for smuggling a backpack filled with muenster cheese across the utah border"
"I'm continuing to position myself fir a run for mayor. The one term Mayor now @PhillyMayor doesn't care about the p… https://t.co/hkiXFsveri"
"RT @howardeskin: I'm continuing to position myself fir a run for mayor. The one term Mayor now @PhillyMayor doesn't care about the p… "
"@PittTreblers had our 🍕pizza bonding night after our rehearsal! https://t.co/8aYeRj4gco"
"RT @IsaiahJCSmall: FREE SHOW\n\nFREE BEERS\n\nFREE PIZZA\n\nmy set is at 830pm!\n\nLibrary Collaborative Grand Opening\n\n2544 Library Road, Pit… "
"Pushing a 4.  Supper balanced.... sweet, tart, &amp; funky all at the same tim... (Hues (2014)) https://t.co/pNIb83dRw3 #photo"
"RT @elijahdaniel: a teen with a bowl cut at a macklemore concert just asked me to buy him beer this is my rock bottom"
"If you’re in Philly and want some great fried chicken 🐔 get to @LoveandHoneyFC #food #goodeats https://t.co/PmrvsOM9uy"
"the greatest cure to a hangover is not drinking beer in the first place. try kicking back with a coca-cola"
"@claireolivia97 So does a cold beer.."
"6 Porcelain Bread Plates 6.5 in. Noritake China Japan 5764 Blue Purple Flower #Floral https://t.co/UUBurK0jpq via @eBay"
"@Ryan_Deem Hold on what. There's a crab grilled cheese there? Not even joking, you might change my mind on the enti… https://t.co/rxPoICsYG7"
"RT @dosojossantiago: Breakfast in Bed. #Bacon #Coffee #blueberry #Foodie #foodporn #breakfast https://t.co/rTpU9O42jJ"
"RT @UncleChaps: Blue cheese is trash."
"Stone Enjoy By 10.31.17 on tap now. https://t.co/yPyJyEq0ww @StoneBrewingCo #BeerMenus"
"Weyerbacher Imperial Pumpkin Ale on tap now. https://t.co/iiLxZ6nNrg @Weyerbacher #BeerMenus"
"Since I know @Wendys is clever and creative, I expect spicy tenders by the end of the year. I have faith in y'all. 💪 https://t.co/86yYEByW35"
"Happy Friday and Happy @TreeHouseBrewCo Beer Thirty! #beerthirty #treehouse #getinmybelly #DillyDilly https://t.co/NPnTrqFdli"
"This gon be a quiet Friday night | I’m gd wit that | 20 hot buffalo wings fries and pizza | I’m on chillz"
"RT @alt921: If you're thinking you MUST get to New Mexico and throw a pizza on the Breaking Bad house, you better do it soon...\n\nhttps://t.…"
"@franciscanmom To be fair: did they mean sprinkle cheese? That would be licit."
"RT @sgleiter: @drgilliland made ketchup like Henry Heinz used to make and I hear it's amazing! https://t.co/HqAPazy8vK via @PittsburghPG"
"A beautiful  Fall Friday evening with a good beer and some Tom Petty coming through the speakers. Living my best life"
"Bring me this Wendy's daddy cakes"
"RT @kurtwearshats: when the wife says it friday lets have pizza and tots for dinner https://t.co/dmMF0NUsN3"
"Come here before or aftet @ModernBaseball at @UnionTransfer and have a beer with Franklin. https://t.co/30u6GkAG9J"
"Do you know what cenosillicaphobia is? Yup I’ve got that! - Drinking a HOPism at @wholefoodspgh - https://t.co/uTnSNVi8Ns #photo"
"We’re CuStars tonight. Check us out at #abbeyfest from 8-10, no cover and beer specials.… https://t.co/nj83qe7AIy"
"RT @gofooji: pizza and streaming make the perfect pair 👻 tweet @AmazonVideo + #UnlimitedScreaming + 🎃 to get a snack for your sc… "
"Thanks Todd/Bryan - Drinking a Yam Jam by @DG_Beer @ Morey's Beer &amp; Cheese Shack  — https://t.co/XRWfhXHCwN #photo"
"@kfc guess salmonella is on the menu...maybe I can wash it down with my iced tea...wait they gave me soda 😒😒 https://t.co/cJ2XIXhVhj"
"#NowPlaying Dark Fastasy - The House Of Bread https://t.co/F7qiILu6zy"
"RT @LadiesOCB: The latest The ladies-of-craft-beer Daily! https://t.co/StiCmxKtyo Thanks to @angelsil_tpa @valpass @stephaniekays #craftbee…"
"This was really tasty, not gonna lie. My favorite that ive had from these guys - Drinking a Wrench NEIPA - https://t.co/XlJWr5rXBP"
"Golf trip dinner @ British Beer Company Hyannis https://t.co/kYPyatXUMt"
"I just got a large pizza, wings and breadsticks at @littlecaesars in 3 mins flat. I'm in love. Now I'm hooked. The hype is real."
"Beer with the bestest husband ever https://t.co/msgPTecSJo"
"Should I  order a pizza for my cat Milo? https://t.co/JdKqvzw7cp"
"Roast chocolate with hint of sweet. Very approachable. Even t... (Caribbean Chocolate Cake) https://t.co/NQ1EzgsJgQ #photo"
"Update: I am on page 3 and still am having a tough time staying motivated to finish\n\nSo I ordered pizza and wings instead\nYEEEEEEEAAAHKILLME"
"@iamSarina_ I need my case of beer and my bottle before any new bets Bro💯😂"
"#Vegan Chocolate Chip Walnut Cookies #recipe #icancookthat #NationalCookieMonth https://t.co/vlT8StX4Gu https://t.co/VpLYaUAMDQ"
"Hey @CaseyBoyCasey my boyfriend is putting ranch on pizza bagels... thoughts? 🍕"
"@bkerogers Pizza Hut isn't trash pizza though?"
"Last beer of this mix a six.  Cape Good Hope by Yards Brewing.  Let me tell you something, I don’t have good hope.… https://t.co/iLqHojmk1Q"
"@RadBrostache The cheese curds were squeaky. Very yummy."
"Someone send me a surprise pizza and I'll love you forever"
"I love sour things but damn this is really sour - Drinking a Sexy MotherPucker @ Pen Argyl - https://t.co/g6Q2oXAEWH #photo"
"RT @chsecrwfrd: credit cards sound fun until you're 30 and still paying off that medium pizza from your senior year of college."
"RT @ThaGoldenJet: Subway cookies is so fire"
"AIR MAX LOVING CAKES WHAT LMFAOOOOO https://t.co/97nbjyfq63"
"RT @AmazonVideo: @mikejoy2017 You can run, but you can't hide! Your pizza is on the way. 🎃 #UnlimitedScreaming"
"RT @DepressedDarth: Join the dark side, we have pizza parties every Friday"
"Can't wait for this pizza to get here"
"@JimGaffigan @LouMalnatis Love Lou Malnatis Pizza classic Chicago style deep dish"
"In honor of Full Pint Brewing’s  (Pittsburgh) bronze medal... (Night Of The Living Stout) https://t.co/CHEENHseLv #photo"
"Actually pretty good, but I'd like to see them use real... (World Court Mocha Blonde Stout) https://t.co/XbyHRL44Ta #photo"
"FIRKin Friday! - Drinking a Captain Coffee Rumkin Cask by @furybrewing @ Tapped Brick Oven &amp; Pour House  — https://t.co/nZqaLeVrlf"
"\"Are combos even combos if they aren't pizza combos?\" - @katreenamahree"
"who will get pizza and chill"
"RT @beardfoundation: #BeardHouse Photo of the Day: Korean Fried Chicken with Red Chile Butter by KYU Miami https://t.co/1pdkRiSiFq"
"@pens_andthe_pen Nice! I made a baked potato and chicken tenders lol. Now I’m sitting in a daze, these meds are insane"
"Arsenal Cider Grant's Flying Pumpkin on tap now. https://t.co/8x1MaUa9GG #lebosaloon #BeerMenus"
"Danknicity. - Drinking a Double Daisy Cutter Pale Ale by @halfacrebeer @ The Churchville Inn  — https://t.co/cyTFvy3xa0 #photo"
"RT @bumblesnot: I had another big brekkie today, even some bacon!\nHopefully my meds will kick in soon.\nThanks again for all your ki… "
"*SNIFFFFFFFFfffffff...*\nI’m smelling some treason in the air. Also, someone is cooking French fries. But mostly the… https://t.co/DyQTqg1xYQ"
"Good amber beer. Not too hoppy. - Drinking a McSwagger's Amber by @crookedcan @ Loews Sapphire Falls Resort  — https://t.co/jt24uuSp7k"
"RT @Breaking911: VIRAL VIDEO: Texas beer ninja saves drink and takes down a woman with box of nachos https://t.co/iUE6RWSg7S"
"I think amazon is sending me free pizza? #UnlimitedScreaming"
"@AP Okey-Dokey American Broski!  We all drink Royal Cola and eat our Cheddar Cheese Burgers in Celebration!  Russia… https://t.co/wjhEBdI9Ag"
"RT @TheBoydP: Top 10 Things That Are Sugarcoated:\n\n10 Lips\n 9 Lies\n 8 Nuts\n 7 Arsenic\n 6 Donuts\n 5 Def Leppard\n 4 Cookies\n 3 Feelings\n 2 Ce…"
"Sounds delicious. https://t.co/53hXuvbJPY"
"RT @tastemade: Pizza-Stuffed Chicken Roll Ups\nChicken dinner just became pizza night.\nRECIPE: https://t.co/JcAWZhK4jZ https://t.co/ieUgVY4P…"
"Nice amount of hops - Drinking a Bitter Ex by Oyster House Brewing Company @ Oyster House Brewing Co  — https://t.co/TuDo6VEfAr"
"Nicely done TD! - Drinking a Bourbon Barrel Aged Imperial Pumpkin Ale @ Morey's Beer &amp; Cheese Shack - https://t.co/WVImA3A2cr #photo"
"Life expectancy would grow by leaps and bounds if vegetables smelled as good as bacon."
"Sooooo good! - Drinking a Zombie Killer by @bnektar @ Village Tavern  — https://t.co/7l1TxzQBCN #photo"
"These #donuts are 💣💣💣💣 https://t.co/lJkvI3TOBH"
"Pizza Joe's meatlovers pizza might be the best"
"RT @ADSKVRED: Time to make the donuts! #VRED’s #WeekendShowcase starts off with this fun #concept by Joan Mendizábal. #VREDStar https://t.c…"
"RT @G_njaJ_sus: @BlSCUlTS Nigga I didn’t even see all that ketchup delete this"
"I don't understand how I moved to PA and neglect philly and their bomb ass steak&amp;cheese.😩🙄"
"@jessica_sharrah I remember my first beer"
"@JamesGardin Thank you James. When it goes through, I'm buying you a pizza"
"Seemed a bit light on the flavor department - Drinking a Pumpkin Down by @BallastPoint - https://t.co/55c2QIr1sD #photo"
"For a porter this is tasty. Great plum. Solid beer... (Sat In A Corner Plum Porter) https://t.co/8F8bMWc8g2 #photo"
"movie night..@KIssMeGuido w/@D_Lombardozzi .. almost died 😂😂😂with the clothes in the pizza boxes. How cute are you? Crushing."
"So I’m on a Women In Economic pizza crawl right now."
"**MOANA** Moana cake I made for Emilys 7th Birthday! Happy birthday my baby! #baking #Moana #Disney #cakes… https://t.co/rNgn0fA5ZY"
"When that flash come on y’all be looking like powdered donuts 😩😩"
"RT @JesseKellyDC: Tabasco sauce is an insult to hot sauce everywhere. No real American uses it. (Except for the Chipotle Tabasco whic… "
"RT @TheRealDarthMan: Live in about 40 min #HorrorSquad #FridayThe13thTheGame #twitchkittens #TeamEmmmmsie GRAB THEM BEERS AND CHEERS AND… "
"Waiting For My Pizza 😋😋"
"WOOT!... (Drew Curtis / Wil Wheaton / Greg Koch Stone Farking Wheaton w00tstout (2017)) https://t.co/ZXtoZFsPmm #photo"
"I dislike spiced holiday beer but this to... (Festivus With Fig, Cinnamon And Vanilla Bean) https://t.co/xQTCIEmTZ2 #photo"
"RT @iamslickrick_: Homemade turkey burger with crumbled blue cheese, onions, mushrooms and sautéed spinach. https://t.co/VXX6MYhcgi"
"RT @LookAtLollyy: Crawfish and shrimp cheese fries from tasty treat restaurant in New Orleans. https://t.co/Yo6BmVZy60"
"i'm on facebook trying to trade a beer for a ticket to owlchella"
"RT @vinnycrack: WHOEVER MAKES THESE CAPTIONS NEEDS A RAISE https://t.co/N6fDOL32Hy"
"Bucket list item for sure. A month or two golfing in Scotland, Ireland and England. My ginger head would fit right… https://t.co/vzRiEROUbG"
"RT @iamwilliewill: Fuck the wheat and white bread. I’m eating my sandwiches with this bread https://t.co/gnIBuD0DH3"
"He blew my mind at the Pizza contest. Was the show great? https://t.co/tmcor4EvAb"
"The head is thick and creamy like a latte. The beer is smooth, ri... (Bourbon BA Supermoon) https://t.co/w3tfGMQDda #photo"
"@jennyleesac30 Chili Cheese Fritos are  the snack God would eat"
"RT @BucknellBCSE: Tuesday, Oct. 17th 12-1 @BUPublicPolicy is sponsoring \"Its Not The Storm It's The Aftermath\" 1st floor event lounge ACWS…"
"Evil Genius  #Adulting on tap now. https://t.co/rFPy0mpsHy @EvilGeniusBeer #BeerMenus"
"RT @ceventh_: When that flash come on y’all be looking like powdered donuts 😩😩"
"@CharlieBlix Pandering. Always pandering. I will give it to him. He knows which side of his bread is buttered"
"Don't think this is a triple, but rather apple-y and malty and thick. Very g... (Golden Delicious) https://t.co/JjXitlGWHC"
"freddy is eating a pizza in a nightmare restaurant. the toppings are the screaming faces of his past victims. \"bring me more!\" he demands."
"Young Chicken Tenders https://t.co/W4bSx0RjVh"
"Really nice Pils! - Drinking a Mary by @HillFarmstead @ Morey's Beer &amp; Cheese Shack  — https://t.co/xVH6xleBdM #photo"
"I feel like that's god is punishing me for drinking soda when I know damn well all I drink is water 😫"
"RT @kcrehabexpert: Doing 2 ACL talks @LEUpdate2017 in just a few weeks in Philly! Hope you easterners can make it and then we can grab… "
"@GordonRamsay What do I need to do to not have the pastry on bottom of a beef Wellington get soggy? Tried twice. Failed twice."
"Got my wish... pizza and HP ⚡️"
"Funk forward with spicy grapefruit. Nice change of pace beer if you’... (Calabaza Boreal) https://t.co/QA7ki0ixnm #photo"
"Decisions decisions decisions. Picking out beer after dinner was tough. @ironhillbrewery… https://t.co/Sx7L8ZeDst"
"this pizza is about to be love before tonight man. 🤤"
"To celebrate Week 5, we will have cookies, provided by  The Pennsylvania Bakery."
"You and your client deserve the best. I finally found that Turkey Breakfast Sausage that's… https://t.co/Tszqv8p325"
"Donuts at #IRM, cupcakes @FertilizerCA , cake @Fertilizer_Inst - the #fertilizer industry sure knows how to celebra… https://t.co/zpJygL7uFq"
"every time timehop shows me a tweet from my “chicken nuggets &amp; pizza &lt;3” phase i get a little bit closer to death"
"Clean malt backbone with sweet and tropical fruit aroma and taste. - Drinking an 300 @ Media, PA - https://t.co/OzobsgGVhz #photo"
"Going to Squirrel Hill's #Oktoberfest tomorrow? Stumble down the stairs for a free scan @UncoverSqHill #pittsburgh… https://t.co/0VqT2xdkqV"
"RT @pipesmalone: never met a cheese i didn't like"
"Sweet Italian sausage, peppers and white rice ugh so good"
"@JC1053 Reginas Pizza.  That is all"
"Why would you not spend your Friday night by eating Hawaiian pizza and watching @theofficenbc?"
"Anybody who votes/voted pizza is a stupid dummy, NACHOS 4 LIFE! https://t.co/8Lydn9NVAn"
"Beer Ball Champions 2017! 🙌🏼 🍺\n\nCasey... love ya kid! ❤️ https://t.co/9kS3V3ZQXU"
"@nc_arrrgggn @skynicalodean Haha i shoild have tried one of those while I was there. Although the funnel cakes add a little something extra!"
"Crock Pot Cream Cheese Chicken \n\nIngredients\n\n3 lbs of chicken pieces\n1 (2/3ounce) package Italian salad dressing... https://t.co/2yuLoGDWzm"
"In a pint of heavy? That doesn't bother me. https://t.co/K8dYRtcZdt"
"Amazing customers buying @SantaKabani pizza after helping them port over and signing up for DTV! @cMacAdowsh… https://t.co/FdUKhqUpML"
"Green Flash Soul Style IPA on tap now. https://t.co/CZEo9z4slF @Greenflashbeer #CainsSaloon #BeerMenus"
"RT @lilzz_mor: Please help settle this important debate between me &amp; Max. How do you eat leftover pizza:"
"Smooove - Drinking a Phantasmagoria by @Prairieales @ Blinky Light  — https://t.co/48FuhLKLl3"
"Clean, crisp, Citrusy f'n goodness, with a Pillowy head that just won't quit....... (Kanso) https://t.co/Jk6aJXqolu #photo"
"Good. - Drinking a Contempt by @Aslin_BeerCo @ W. Ridge Cul de Sac  — https://t.co/Gy45yzXzgY"
"Worked on my paper recycling; now Ima get dinner. I get busy &amp; then hungry. Lemon pepper shrimp n olive oil &amp; hot c… https://t.co/IPQNdDmKWE"
"Nice solid IPA. - Drinking a Goose IPA by @GooseIsland @ Filomena's  — https://t.co/D6aVEXrI0H"
"Looking for something different? This is a great beer from Levante Brewing. The Earl of Newlin in an 18th Century... https://t.co/jt3HzoMkhn"
"Recovered our chocolate cake from the #caketheif @BenFrankBrian https://t.co/rQJwxBcbSD"
"There's the balance. - Drinking an Imperial Pumpkin Ale by @weyerbacher @ P.J. Whelihan's  — https://t.co/BOBTYuzzCw #photo"
"I LITERALLY HAVE NO FOOD AT MY PLACE SO I ORDERED A PIZZA FOR MYSELF I TOOK A NAP AND WOKE UP TO ONLY TWO SLICES LEFT BRUH I COULD CRY"
"We're psyched on last week's brunch menu so we're keeping it for this week too. Sweet crepes, savory sandwiches and… https://t.co/iUh3NEgKpm"
"@Emanuel_Wynne Young Grilled Cheese.....😐😐yo"
"RT @drob: Benjamini: several epidemiology journals have long banned p-values. Still gave us “Ketchup and pizza may prevent pr… "
"Bit malty, but smooth. Holds up pretty well - Drinking an Imperial Yard Breather @ 2 lengths on crocus - https://t.co/6XaszXXpC6 #photo"
"RT @DiscStore: #FreebieFriday RT + COMMENT Pizza, Jorts, or USA to win!\n\nOr get them for 40% OFF right now through Sunday!===&gt;… "
"Cheering on @VBKutztown, and enjoying some free pizza in the process!\n#GOBEARSGO https://t.co/5DFyEomx0A"
"Pizza Boy Peach Around  is on, replacing Pizza Boy Hopvision - Rakau"
"@LoveeeT2 @TheOneQueenChi 😂😂😭 you can't leave me &amp; chocolate cake alone for too long... i told you"
"dog, gazing adoringly at pizza: a poem https://t.co/hTQtrYIs10"
"@RednecksNews Bye bye cuz we love our chops n bacon"
"My mom got pizza and scary movies to watch for Friday the 13th, God bless🙃"
"RT @Will__NE: If yous have seen the new video you'll know about the pizza guy who was like \"I'll draw you in pizza and cheese\"\n\nT… "
"Holy shit it worked https://t.co/kwNB7NVR3R"
"Not bad as it call your name https://t.co/qm0zTr09Vx"
"Ready for pizza and a scary movie with @AmazonVideo 🎃 #UnlimitedScreaming via @gofooji"
"@MikeRaymondLV Heard they just bought a water bed with the bread they had saved for a couple years"
"So this is the new comedy? https://t.co/lsMNI8rnh6"
"Classic in a cool can - Drinking a Guinness Draught by @GuinnessIreland - https://t.co/nhib0mC4J0 #photo"
"@SethDavisHoops Wow you're on a roll tonight Seth.  Maybe time to drink beer.  Seriously, I look forward to your Tw… https://t.co/0E9Uywu5zT"
"RT @Pork_Sword_: There is woman crying about someone throwing fried chicken at her through her car window.\n\nMe: *rolls down window* Me next…"
"@thisalbumsucks I just had chicken fingers and pepperoni pizza"
"@PapaJohns hey glad it’s been 45 minutes and I still don’t have a pizza when i was quoted 25 minutes"
"@55GACrowder @NorthVanMike Still doesn't bother me. Because, beer."
"RT @timstubbs67: Artisan cheesemakers talk cheese trends, flavor inspiration https://t.co/St691eKwrk"
"I liked a @YouTube video https://t.co/LMVwYeS2Ge Binging with Babish: Fried Chicken Lasagna &amp; The Luther Burger from the Boondocks"
"RT @PorcelainChina2: #etsy #Plate #Lefton China Bread Salad Dessert Decorative Pink Roses Porcelain blm https://t.co/fAtkIqEdfS via @Etsy"
"pizza and streaming make the perfect pair 👻 tweet @AmazonVideo + #UnlimitedScreaming + 🎃 to get a snack for your scary movie night 📺"
"Dank AF - Drinking a Yakima Fresh 2017 by @columbusbrewing @ Morey's Beer &amp; Cheese Shack  — https://t.co/FPd9ePT1lN #photo"
"I found pizza flavor pringles so my night just got better. https://t.co/yEGTKwmBCR"
"clemson cheese finna lose to cuse😭"
"Lotta mango but pretty good - Drinking a Mango Wheat by @BlueMoonBrewCo @ What's Brewin'  — https://t.co/UGbhfni5EZ"
"Where's the best pizza? A classic debate. Enjoy these comedians arguing their cases #funny #foodie… https://t.co/WeAu7EI3Jz"
"Friday the 13th has not been good to me, I broke two nails trying to show my girls how to toss and I dropped a whole tray of cookies 😬😬"
"RT @MrsMcEnoff: Who drank all the beer???? I drank alll the beer #drynn"
"@CarrionTrilevel Oohh I would have beer or liquor.. hmm none of you share with me 😂"
"Thanks for coming out. Appreciate the support. https://t.co/qqzat4STOB"
"Ketchup vs. catsup: @drgilliland on the history and evolution of that most #Pittsburgh of foods: https://t.co/xkEn5RyPxd"
"RT @Deerhuntingprob: Welcome back October. May yours be filled with:\n\n- Huntin' 🦌\n- Cooler weather 💨\n- Football 🏈\n- Cold beer 🍻\n- Bonfires 🔥"
"Dinner with friends tonight!  What can be better than that?  Sorry, friends...Chuck E. Cheese with Hannah Bananas tomorrow!!! :D #LoveMyGirl"
"This Sunday come out and support Kia's Cakes bakery ! They have an… https://t.co/8JgI82hXQv"
"cringeworthy videos of girls trying to shotgun a beer are my favorite #saturdaysarereallyfortheboys"
"Hoagie and Mac and Cheese after 10 nice 2nd dinner"
"But but but...how can I be a thief if you have it? https://t.co/Vgj7gPwGCV"
"Very nice! A souvenir brought back by friends from Michigan. :)... (Beer Right Meow) https://t.co/JermWEXFxO #photo"
"@missspennylane Yo that beer/shot duo though 💯"
"New Halloween ouija board to feed all the ghosts in the neighborhood imaginary ghost cookies 😂😂😂 https://t.co/O4mic0XexM"
"Someone deliver a stuffed crust pizza to my apartment pls. Or goldfish, extra cheddar. Thnx."
"#IReallyShouldTry Pineapple on pizza... some actually like it. https://t.co/2hlu4bR12G"
"@RydeOfYourLife @JSamsonGZW2K1 @xAstridSedin @RealJakeSmith87 Cigars and scotch? Ok grandpa. 🙄 wine and pizza is the way to go"
"@SusanSanderlin Lol.... that's all I got. No beer here !"
"The beer festival is totally sold out! No tickets will be sold at the door. See everyone tomorrow."
"Harm can’t eat non of that shit 🙅🏾‍♂️ https://t.co/fIq7Ii3Mmr"
"@mik9703 Add melted cheese &amp; put in oven definitely"
"I've had worse pilsners - Drinking a Krombacher Pils by @krombacherbeer at @franklinparkbk  — https://t.co/EzlgQW5EVH"
"The 2017 Conshohocken Beer Festival is completely sold out. There will be no tickets available at the door."
"@gofooji pizza and streaming make the perfect pair 👻 tweet @AmazonVideo + #UnlimitedScreaming + 🎃"
