"@SGSFOX After the game, go to Nicks (if they let you in). Get the Stromboli. Mother Bears Pizza  as a fallback. Thank me later."
"RT @djoats02: when u stop drinking soda and start drinking water https://t.co/uGS3flthKU"
"THIS IS WHAT POKEMON GO SHOULD BE https://t.co/CGECM6efh1"
"I been wanting some pizza for a while now 😂😂😂🙁"
"RT @Mirlandra: Meat wrapped in bacon. What else do you need to know? #bacon https://t.co/reb3wPMOWb https://t.co/XL7MZ15Xiz"
"Now this is a cool #doughnut @ Dunkin Donuts https://t.co/ruh9VKoc7T"
"RT @vinnycrack: WHOEVER MAKES THESE CAPTIONS NEEDS A RAISE https://t.co/N6fDOL32Hy"
"RT @HoldThisBeer: Hold my beer while I tease a bull https://t.co/Qc6wzhKMqV"
"*rotel, pizza &amp; hot wings* 😩😭 https://t.co/5eDxXLtZ6j"
"And some warm chocolately chocolate chip cookies😪 https://t.co/jerRKEViyC"
"RT @iamwilliewill: Fuck the wheat and white bread. I’m eating my sandwiches with this bread https://t.co/gnIBuD0DH3"
"RT @RealMarcus901: *rotel, pizza &amp; hot wings* 😩😭 https://t.co/5eDxXLtZ6j"
"This is what we call \"trolled to the max.\" @bdevault sent me 50 packets of ketchup. https://t.co/9x8woJaUec"
"Young Sonic cheese tots 😔 https://t.co/gZZLEAUcbL"
"CP Designs - Coffee &amp; Donuts - Adult\n$25.00\nhttps://t.co/Y9LjzfF0X6\n#leggings #charity… https://t.co/foJpxPh9uv"
"@_youhadonejob1 So that's how they know where to deliver the pizza."
"Gee Gin-Redheads, with green eyes have a way with words. https://t.co/3Fa0N5Vboq"
"Delicious #Recipe @GordonRamsay 👍🏻 https://t.co/qMZezNiiRM"
"@mangomaxima 👍👍👍real crispy bacon plus cat head biscuits with fig preserves 😋"
"@SimplySassy1 I miss alcohol so much I thought you were at a bar and the bottom left were beer taps"
"RT @TuteFairy: Bitches have expensive taste and beer built bank accounts 😭"
"RT @townhallproject: Tenney, Donovan, Bacon, Yoder, Young all holding public events this recess. #ShowUpSpeakOut https://t.co/qGpU3BUFs2"
"@6urris Same lmao I just pour acv and a lil Castile soap for babies w baking soda and basically all my oils hahahah… https://t.co/Ygg3rIhfiL"
"Last night at Waffle House I ordered hash browns all the way, and my life will never be the same 🙌🏼"
"I just earned the 'Flamenco' badge on @untappd! https://t.co/XxdwiO9wf6"
"You deserve a day of live, country music. And while you're here, you deserve a beer! https://t.co/SB3EJsynSt"
"Daily Specials: Sourdough, Cream of Potato &amp; Texas 2 Step Soups, Sausage Onion Mushroom Quiche, 3 Cheese Quiche, Pe… https://t.co/fOw23miuJL"
"RT @JalainaDaviss: Y’all know butter and margarine not the same thing right???"
"@SpencerMc12 Jus for the pizza"
"Chipotle BBQ! House-made #seitan sausage served over #fresh greens, tarragon aioli and #spicy… https://t.co/Eyp6LhMG3g"
"Indian firm does carbon capture and usage, turning C02 into baking soda. https://t.co/mfD7RocmDe"
"Lunch crew at ESCoC Fall Family Retreat. Ham and cheese sandwich with lettuce and tomato, chips, apples with toffee dip and baby carrots."
"@HawkeyeMommeye @packer_hawk @hawkeyeguy85 To make people buy local or regional beer? I actually didn't drink any o… https://t.co/LH2jsrzG6e"
"if you’re a pancake in the greater Murfreesboro area: beware"
"RT @ltgrusselhonore: @DavidBegnaud @SpeakerRyan What Bull Shit no Questions about no PODs and Those Skittle / Can Sausage meals , I did… "
"#CaptainsLog Hour 7\nHad my first customer issue. Apparently I'm personally ruining her entire life. Is it too early to have a beer?"
"BUT WHAT ABOUT THE COOKIES https://t.co/3ksfLTdJpr"
"RT @Quaandadon: This new wave of DICKHEAD \"comedy \" yall tryna create is lame as fuck. https://t.co/X88ZXZdN5l"
"I will get a tattoo of Kevin Bacon holding a lamb if lawmakers sign an agreement to not take contributions in 2018… https://t.co/8DbSIA6co3"
"RT @meaganhoneaa: good morning to everyone except those who don’t like donuts"
"I wake up eating cookies 😂"
"I find a duck's opinion of me is very much influenced by whether or not I have bread."
"RT @Qveenlai: *life saver gummies https://t.co/mm9GQdKJZl"
"RT @ElixirSpirits: Stone Enjoy By 10.31.17 on tap now. \"There is no better time than right now to enjoy this beer.\"… https://t.co/XGyJ1CMLQX"
"@TheWeirdWorld That's called cottage cheese"
"Best Thread I done seen https://t.co/vnDUr1tRVp"
"RT @LookAtLollyy: Crawfish and shrimp cheese fries from tasty treat restaurant in New Orleans. https://t.co/Yo6BmVZy60"
"I entered to #win a #Walton's Sausage Stuffer Kit from #waltonsinc! #giveaway #free\nEnter the giveaway here: https://t.co/jeL9X6CZP2"
"@CarISweatpants Pink Floyd should be listened to while eating bread and drinking water because they’re so bland lmao"
"Saturday-hotdogs-Cold beer-college football 💯"
"RT @SatisfyingTaste: This bacon-wrapped burger ring is gonna WOW everyone at your next party 😳\nhttps://t.co/Du09fQRz9A"
"@jmay11 Try it on pizza."
"Mom &amp; Pop Pizza Shop in Livingston, TN https://t.co/t9tY4dxsvl"
"Top stories: Crockett's calm, Friday's scores, canned beer &amp; more from JC Press - https://t.co/5wla1KTTbs"
"Laying my fat ass in the bed eating this pizza 🤤 im not getting ready until 1"
"@cooperyoung beer festival pre &amp; after game #drinkcraftbeer selections @ilovememphis @CraftBeerTime… https://t.co/t4o6iMaq5q"
"RT @drwaheeduddin: @FriendsOScience @tonydunc @cff1776 @Tokyo_Tom @swcrisis @kmpetersson @GillesnFio @CohodasHoward @Vivarn8… "
"RT @charlieputh: Ask me if I just had 20 mini pizza bagels."
"@charlieputh Did you just have 20 mini pizza bagels"
"I'm craving melted cheese, pls just let me have cheese today"
"RT @BarrettSallee: Tubs on his friends taking boats from Alabama to Knoxville for games.  \n\n\"Three days. Maybe four, depending on how much…"
"RT @meechonmars: They not as good as yo spicy nuggets &amp; a side of BRING EM BACK sauce https://t.co/fncw5O0AkN"
"There's a retirement party at work today which means free beer. Then I'm going to a wedding also = free booze. 😈😈😈😈😈😈 today is a good day."
"@bobshabazz they were chicken mole tacos with a fried egg on top &amp; they were good as hell."
"Drinking a Fennario    by @jackalopebrew at @acmenashville — https://t.co/XdGXLiHi62"
"RT @AlissaRocchi: 🍕Pizza Party🍕Thank You Cashiers!!🍕#CAM2017 @THDBecky31 @ToddDrew @Edward_Shelley @SheaKing75 @ClaireCassidy15 https://t.c…"
"Best statement I’ve ever heard on TV https://t.co/L3Smq6rqQI"
"RT @aislynnelise: Two guys just walked into this Beverly Hills Starbucks dressed as slices of pizza. It’s 9:30am on Saturday."
"RT @abbigaileonard: @banjorts made Chinese pizza last night and it was honestly ~gourmet~ https://t.co/PvKOwIHi7O"
"RT @BREMAKAYLAA: See this is how you do it. You see something good you SHARE where you got it from.😂 https://t.co/fScKycNwwJ"
"RT @mitchelmusso: I’m the man who had the cheese https://t.co/BTr61Uw4qS"
"I’m the man who had the jerky https://t.co/JRarM1QpVo"
"RT @justpatterns: donuts 😍 https://t.co/VWSiAW4Cmp"
"Work, work, work, coffee, coffee, coffee, beer and maybe some chocolate. https://t.co/V1YRyEC6oS"
"The latest https://t.co/ECeyhTlrlK Oh My!! https://t.co/k5wOPBhgH0 Thanks to @SwipeUp #wine #beer"
"RT @ThisIsJessPaul: 📹 SOTD: “Evil” by Interpol I made Rosemary bread tonight, so I was reminded of one of my favorite... https://t.co/eEWy4…"
"[HEALTHY RECIPE] Creamy Pumpkin Soup with Grilled Cheese Croutons - https://t.co/O2mNv6IRog https://t.co/q2i6kXjD9H"
"want chocolate cake."
"Set and ready! Let the beer festivities begin. Happy to be among all these great breweries… https://t.co/jMc1XIMbq5"
"Me: \"Can I get a fork?\"\nCashier: \"No, I don't have a fork. I have ketchup &amp; mustard.\"\n\nThat doesn't feel like a great solution to my problem"
"@_VolsFootball_ I liked his quote about how it takes 3 to 4 days to get your boat up to Knoxville depending on how much beer you drink."
"Change in lunch menu is Pizza for a Monday @MichiganAvenueE https://t.co/nzDuV1J40f"
"RT @wynburn1Wynburn: @BreitbartNews And medical care, and food, and beer, and tvs, and cell phones, and computers."
"WHO TF STARTS FROM THE CRUST. YALL MAKE ME UNCOMFORTABLE. https://t.co/gvGkTXm9Ou"
"Beer tents. Uh oh https://t.co/fyvjJcPHxe"
"Literally every Venmo transaction on my feed is for pizza. Doing well y'all."
"RT @a_veryland: I can’t believe the Dunlap Walmart didn’t receive the pillsbury halloween cookies this year😩"
"Rice Cakes have no business calling themselves \"cakes\" at all."
"Saturday Special Chicken Philly $10 Philly sandwich, with grilled onion and pepper, American cheese, served on ciabatta bread*"
"It's Saturday which means wings and pizza day. Gotta get my workout in first! #govols #GBO… https://t.co/BhHQ7s1d8i"
"RT @yourlru: if you skip the meat you could save 200 animals per year and 220,000 gallons of water. https://t.co/lMSUCfyxkk"
"RT @HoldMyBeerGif: Hold my beer while I do a backflip right near the edge https://t.co/PsvGn4WiGH"
"A long day of fighting fires in the rain calls for cookies #phillip_girls https://t.co/oT5sFfwrkk"
"Cheer on the Vols with our Big Orange Cheese Grater lamp🏈 this is an awesome accent for any… https://t.co/M8c7J9sFqB"
"RT @recipe: Cheesy garlic bread meatball ring https://t.co/xQPXMGOc7X"
"Silver Plated - Cake - Pizza Server -  New - N by SandiesGiftCorner  https://t.co/dLaRBvsPu0 via @Etsy\n #shopsmall #epiconetsy #giftsgalore"
"RT @totallyclairezo: two biggest shocks of adult life:\n1. everyone does cocaine \n2. cheese is fucking expensive"
"@WaltDisneyWorld keep doing what you're doing at Dino-Bite Snacks. That was hands down the best glass of Barq's Root Beer I've ever had."
"if we'd known as kids that being an adult means frozen hot chocolate for dinner and pizza and fried rice for brunch https://t.co/LAP9UHmvI4"
"RT @harriette23xx: The face you pull when Bae mentions pizza fries 🍟 🍕 https://t.co/oKzeDLFm3r"
"RT @OhMyThisIsGreat: I WOULD DESTROY THIS! https://t.co/xcYAtnOCwX"
"Don't forget mafiaozas_franklin has 2 for 1 beer Sunday all day and  night! Go see A.P. after… https://t.co/zU4FBNcZUm"
"RT @Russell___Smith: No thanks. I'll just die early. https://t.co/fP3i9xHRjU"
"Thoughts during a shitty football game: what causes the constant tiny bubbles in beer? Anyone?"
"@Boars_Head I want the Bowtie pasta with Boar's Head Bacon and Goat Cheese!! Yummy"
"Ware: there's no way there could be a worse analysis than me.\n\nTuberville: Hold my beer!"
"RT @RachelCruze: A life of people pleasing is exhausting. \n\nLive your life. Love your life. Eat your pizza. 🙌🍕 https://t.co/lSzzIWr95h"
"RT @Blakeandbrew: My excitement over @CYBeerFest is at an all-time high. This is the best beer event in Memphis IMO. #ilovememphis #craftbe…"
"RT @cajunsoulfire74: Roberta's Pizza was mentioned in HRC's email.  #PedoGate #PizzaGate\n\nhttps://t.co/aWqwsAnVId\n\nhttps://t.co/sbp2SabmDw"
"RT @MotorHeadMama: When you get cookies from @nissanusa #titan #NoLazyHorses #Nissan #NissanTITAN https://t.co/3JYJ4uNQC6 https://t.co/RdDF…"
"I liked a @YouTube video https://t.co/ouIBJtI60r Entire Costco Pizza Challenge"
"We are in Memphis today for the Cooper-Young Beerfest! Our beer will be available in Shelby County starting next mo… https://t.co/9Qr3radiTd"
"Pizza Rolls! With organic kalamata olives, sundried tomatoes, vegan cheese and herbs&amp;spices!… https://t.co/rJWdgAoju3"
"Ever wondered which beer you should be pairing with your meals and snacks? Well, wonder no more!\nRead More &gt;... https://t.co/5Ys0hibAzC"
"@MrsBustyB need to get rid of that bread tho"
"RT @LaDemSoc: It's almost like their politics are just politics of resentment and not based on concrete principles or values! https://t.co/…"
"@chelseamonique_ Best pizza in New Jersey"
"@SchulzBrauBC really happy for you all!  Keep up the good work and keep that great beer flowing!  #Prost 🍻"
"RT @JackedYoTweets: So she lovin’ the crew? https://t.co/M1wbsYwBao"
"“you’re not leaving are ya? because you still have that beer and I don’t believe in alcohol abuse!” says the server to me \n\n“no, no!” says I"
"RT @emarl_: Twitter peaked at an account where birds could tweet by pecking at bacon fat on a keyboard https://t.co/ISJmbxzGMc https://t.co…"
"Get my delicious Fried Peach Dessert Pizza recipe here: https://t.co/sA5lsGcMNR https://t.co/yXdeuZ1Ckv"
"@Platini_954 You got it all wrong bruh. He's obviously practicing to play Whack-a-Mole at Chuck E Cheese WITHOUT THE PADDED HAMMER."
"RT @mikeshinoda: Hot dogs. And Ketchup."
"I don’t drink soda but I’m drinking a sprite rn and there are lil yatchty lyrics on it"
"RT @BabyAnimalPics: Sausage dog burrito! 🌭🌯 https://t.co/Bkiu1Jo8cg"
"It’s like the state of Alabama and state of Mississippi are trying to out-hold my beer each other. https://t.co/xowfoWOv2W"
"RT @bobvulfov: (to the guy who just delivered my pizza) text me when u get home so i know ur safe"
"Grilled cheese with mayo instead of butter. So good."
"Mmmmmmmmmm BACON #RollTide #ROADTO17 #BeatArkansas"
"@sean_spicier Add jalapeño and cream cheese- makes 'em delicious!"
"RT @sean_spicier: I take them wrapped in bacon https://t.co/VzBqJInjyf"
"\"Tennessee's red zone offense is awful.\"\n\nJimbo Fisher: \"Hold my beer.\""
"RT @mryjhnsn: A Delicious Avocado Banana Bread Recipe Courtesy Of The Watertable https://t.co/aQDuie8m2c via @familyfocusblog"
"RT @TheFoodDIY: Omg! This pizza 😍 https://t.co/lWnb533yeW"
"@Brooketayluh I haven’t had coffee or soda in the past 3 months"
"@baileyeshbach I really really love that sausage pup"
"RT @thetomatohead: 🍕Anybody ready for pizza? https://t.co/2DVgqBMEM6"
"DS Brown I see a lot of Weed arrest making contact smelling weed Does Richland really try to protect Pizza&amp;Candy th… https://t.co/XaClVnR77s"
"damnn😂he fucced up https://t.co/7hDzevK34N"
"RT @IamChrisPorter: Help victims of the NORCAL wildfires by buying this special beer from Russian River!!  \n\nhttps://t.co/1NkWpCC5tk\n\nPLEAS…"
"RT @PepeinVegas: Some people see nature, I see a beer😁 https://t.co/Pq6KLlVkD3"
"#COYG - Drinking a Berry Blonde 2017 by @MaydayBrewery @ Hops and Hollers Craft Beer Store and Taproom  — https://t.co/kMDLBmKMNt"
"Jordan giving us a quick lowdown on the Chocolate Rye Porter at Cooper Young Beer Fest!! https://t.co/jyj6WLPZDz"
"RT @ldgadamn: Just tryna bake some cookies with the loml"
"You brazy https://t.co/O3NBscI4E7"
"Love the idea of having our #pizza at your wedding, work event, etc? We offer catering! Click the link below and... https://t.co/1fkaMN4z1V"
"RT @EJH95: Unpopular opinion but Pizza Hut is  100% better than Dominos 🍕"
"@dccoletrain Great food, even better beer!!"
"The beer Bandits are in town"
"RT @ItsFoodPorn: Bacon Grilled Cheese. https://t.co/5jjvTlsflD"
