"I've got #Oklahoma to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/BUogXVuZ4M"
"Regardless of the country, there are are a few things you can always count on! @Starbucks https://t.co/c4iU0cOa92"
"RT @Whataburger: Your tl needs more Whataburger https://t.co/pbsQYGAX7t"
"RT @TheLaurenHuling: There are a lot of things wrong with the world right now, but my $5 footlong at Subway always costing $8 is pretty hig…"
"talking about a subway sandwich u imbeciles😤😤"
"the @McDonalds around fenway park knows what it truly means to Go Beyond\n\nthey actually know what I mean when I say extra everything"
"@McDonalds this trans girl's might need for ketchupy mustardy pickly oniony salty splendor has been satisfied\n\nextr… https://t.co/SSmyDCZvPx"
"My phone reception is better underground on the subway than in the grocery store. #Witchcraft"
"Love coffee? Enter for a chance to win $30 Starbucks Gift Card or PayPal Cash! - US Only Ends 10/12… https://t.co/Jur2SpN8NL"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"Apple, Facebook, Google, Starbucks, and Others Urge Supreme Court to Take on Gay Rights Case https://t.co/pq9OE69P59"
"RT @Lin_Manuel: Good morning.\nI believe in you.\nNot always in our leaders, not always in the subway schedules, \nbut always in you.\nYou, unw…"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"RT @DrDenaGrayson: Trump plays checkers, while those around him play 3-D chess🔥\n\nInvestigative leads ARE being pursued. Good things ARE hap…"
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"RT @BlvckGrip: you should probably shut the fuck up https://t.co/fP89T8HVWT"
"RT @maribgs: starbucks date w/ bae ~~\n\n#monbebeselcaday \n\n&lt;3 https://t.co/BOOYkmnPTx"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"RT @Niggativities: they had a whole wwe royal rumble in the NY subway lmfaooo https://t.co/io7ueenMVW"
"@kaleymallery No one is going to chipotle to get tacos"
"Blaze prep @MPB starting @6pm tonight and ending whenever we finish. Chick-Fil-A afterward for anyone wanting to join (bring meal money)"
"Taco Bell in Magnolia really needs to get their shit together."
"@JordanUhl I don't trust ANYONE who drinks that purposely burned-for-\"flavor\" Starbucks SWILL."
"RT @writesyoo: [PLS RT] Youngjaes 25th birthday Subway Ad project 🕊  \n\n-follow instructions for donations\n-updates will be below t… "
"RT @HeteroGamingVet: MISSED CONNECTION: i saw u outside subway yelling “triggered!” at a car with a Bernie sticker and fell in love. did… "
"RT @Bdell1014: Ya WCW took a shower &amp; when she washed her ass crack she got shit on the rag without knowing &amp; washed her face afterwards.Sh…"
"i want chick-fil-a so bad"
"RT @poopaloopaa: i want chick-fil-a so bad"
"@tatianagw2 @Wendys 🙄 Y'all ain't ready."
"@TTCnotices WE  GONNA   HAVE  NEW  TRAINS,NEW  STREET   CARS,NEW  LOTS   OF  BUSES  AND   NEW  LONG  SUBWAY   LINES  IN  DECEMBER\n\nLOVE  MAX"
"@TTChelps WE  GONNA  HAVE  NEW   TRAINS,NEW  STREET   CARS,NEW  LOTS   OF  BUSES  AND   NEW  LONG  SUBWAY    LINES  IN  DECEMBER\n\nLOVE  MAX"
"Woman at mcdonalds who told me I look ready for Halloween should be thankful I didn't say the same about her heavy pearly pink eyeshadow"
"First Islamic McDonalds Opens in Berlin https://t.co/Qi92EvHmUo"
"RT @ABC: Taco Bell launches limited edition clothing line with Forever 21 inspired by iconic graphics of the taco chain.… "
"RT @vladtvnews: You will never Eat from McDonalds after looking at it 😳😱 https://t.co/mQaoH25nGL"
"@AmericanHotLips @southern4MAGA @McDonalds So true"
"@ChickfilA It’s people like me that take 8 Chick-fil-A sauces, 2 Polynesians and 3 ranches that fuck it up for the rest of y’all"
"How can u eat a bowl from chipotle without chip shit so incomplete"
"@Wendys store #00001359 1-10 rating10 best. Service 4 burger 6 fries 4 restaurant could be cleaner"
"RT @DonnaWR8: 🔁 #WTG #Kaepernick at NEW job @McDonalds⬇️\n\nGreat job DIVIDING #America &amp; #NFL‼️\nYour mom must be SO proud‼️\n\n#MAGA https://t…"
"Fully furnished office space for lease next to @zaza_pizza. Across the street from @heightstaco &amp; @Starbucks… https://t.co/yW6s2Q1GYL"
"@Zarphus @McDonalds @JonathanBull0 Do you happen to know this for a fact?"
"@GGFrosteV9 @ezlkill @LasaLoraine @McDonalds That’s your opinion"
"RT @huffpostqueer: Apple, Starbucks and others petition SCOTUS to ban lgbtq workplace discrimination https://t.co/XgmOh5s9OI"
"@heatherlygreen @ezlkill @LasaLoraine @McDonalds People can’t hel it they can’t afford healthy food"
"#PlaceresDeLaVida #starbucks en Starbucks Argentina https://t.co/52litx5oKm"
"RT @Linking_Mercury: @TEN4Texas @flowerpower69 @Woody12009618 @BrotherVet @Extraboringname @Eminem @Kaepernick7 @KingJames @steph93065… "
"RT @mamashakess: I just want to know one thing. \nAm I the only one who can’t fucking stand Starbucks Pumpkin Lattes???? https://t.co/YaThke…"
"RT @oraltwjnk: YASSS LADY WITH THE SOUP GO BEST FRIEND THAT’S MY BEST FRIEND https://t.co/lnxF22xPpQ"
"@NFL @kfc Have you heard this yet? \"-Breakin My Wrist\" by yours truly 🙌 - https://t.co/0QjHZ8uaL6"
"RT @V_of_Europe: Brawl between 40 Africans breaks out in French subway https://t.co/w25szRxu0k"
"Join the Starbucks team! See our latest #job opening here: https://t.co/5MFNkiISwH #CustomerService #Russellville, AR #Hiring #CareerArc"
"@jmariec36 @SethShaffer Harrumph!\nMuch as I HATE to quibble online -- \n\n🤣😳🤣\n\nPEET's COFFEE\nfor THIS Bay Area person… https://t.co/CTKibzeMPw"
"RT @alxaesa: TEXAS has Khalid\nTEXAS has Beyoncé\nTEXAS has Blue Bonnets\nTEXAS has Pluckers\nTEXAS has Selena Gomez\nTEXAS has Daisy… "
"RT @londyn_bridges7: When you’re not in the mood for Subway: walk into one and sniff. \n\nNow you are in the mood for Subway."
"New motto https://t.co/kL4BdplSN5"
"RT @SirGregoryDa1st: Been had that nigga on the bench...chess not checkers. Lmfao https://t.co/nse7Fs37aX"
"Want to work at Starbucks? We're #hiring in #Springdale, AR! Click for details: https://t.co/h8Q1gZksfo #CustomerService #Job #Jobs"
"Captain Ds was 🔥"
"RT @girlideas: the New York City Subway banned dogs unless they fit in a bag and the people of New York did not disappoint https://t.co/6B4…"
"Chick-Fil-A is celebrating HoCo Week (Oct. 16-20)! CHS will receive $1 credit with each order if you mention, “I’m with Conway High School!\""
"RT @SlimmySlim94: I want to try the scheswan sauce! The one from Rick and morty ! @McDonalds hook your boy up 😋"
"RT @CuhCuhCuh: the only taco bell im going too cuh https://t.co/bB0akhWSEb"
"RT @NorseShadowRunr: @Linking_Mercury @jmreiniger @Znoes @TEN4Texas @BrotherVet @SenSanders @tgradous @Ender316 @gunluvngal @ndb4ever… "
"RT @ARTXHOUSE: MY BOY @isaiahbrande WAS THE MANAGER AT JETS PIZZA \n\nBEST GOD DAMN PIZZA CHEF IN THE SOUNDCLOUD GAME https://t.co/LbIaNQ6qE3"
"@_RMatthews go get a job at mcdonalds https://t.co/P0I24I2bb0"
"nah i love myself https://t.co/y1CujgkmfM"
"RT @AModernLadyWN: Now try to put up a hetero poster extolling the virtues of normalcy &amp; safety. You will end up arrested in #Canada.… "
"RT @_ahmedsaeed1: I still laugh to this day 😂😂😂😂 https://t.co/P5mBvPRMTY"
"I never know what to get at Starbucks so I always end up with a green tea I could of made at home lol"
"RT @NFL: Who will be the biggest difference maker tonight? #TNF #PHIvsCAR (by @kfc) https://t.co/APH9KeGuP3"
"RT @BurlingtonPost: Tim Hortons/Wendy's colleagues &amp; customers celebrate Ralph's hugs and dance moves as much-loved employee retires https:…"
"Somebody please bring me chipotle I’ll smoke u out"
"RT @Arbys: We have the Venison. 10-21-2017 https://t.co/sD4rZBOJRb"
"RT @FunnyQuotees: The time when McDonalds gave out good toys... https://t.co/98UgJk4drM"
"@Wendys how do you feel about me enjoying these delicious buttermilk tenders from @McDonalds"
"RT @XplodingUnicorn: [first time in Starbucks in 10 years]\n\nMe: I'd like coffee.\n\nBarista: What kind?\n\nMe: I didn't plan for follow-up ques…"
"RT @brookemiccio: I don’t think I’ll ever understand how people have time to play multiple guys/girls at once I barely have enough time to…"
"RT @Sethisto_EQD: Every time I see her I want Mcdonalds for some reason. And I haven't been to mcdonalds in over a year.… "
"I got 2 sandwiches from Subway and the lady asked who the other one was for and I lied and said my mom. They’re both for me"
"i'm drunk in a starbucks and i love my life"
"RT @JakvarAustin: @mattmfm Holy shit. Let's also get Subway Jared's views on the sandwich industry."
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"RT @dominos: Three cheers for the farmers that allow us to make the best food of all: PIZZA! 🍕🍕🍕 #NationalFarmersDay https://t.co/CKDf8pwykH"
"RT @HeerJeet: Next; Jared Fogle explains what's wrong with Subway's new menu. https://t.co/Sg1UZLlySU"
"@Starbucks It was delicious!"
"My dad just told me that when we ate at Pizza Hut the other night I ate FREE because it was KIDS' NIGHT\n\nI'M 22 AND… https://t.co/Dhep4miVZ2"
"RT @ItsFoodPorn: Bacon Cheese Fries With Chipotle Ranch. https://t.co/cTb4zJxcIl"
"i made a point to cook food to take to work tonight so i wouldn't buy taco bell........... \n\ni forgot my food at home"
"RT @WampusCatUpdate: Chick-Fil-A is celebrating HoCo Week (Oct. 16-20)! CHS will receive $1 credit with each order if you mention, “I’m wit…"
"#Win $30 PayPal Cash or Starbucks GC @pamelamaynard @missmollysays2 @itsfreeatlast https://t.co/JWWExoVOUS"
"When u are at subway and u want fucking lettuce https://t.co/que5yEc9Fz"
"RT @nihilist_arbys: Sure, shit's bleak, but remember: we're all gonna be so fucking dead soon. None of this matters.\nEat arbys"
"Love our Small Groups @FPBenton !!!!    @Jess_Moody Starbucks + MomLife = a great night! Ready for 6:30 to get here. #MomLife #iConnectHere"
"Nope .. https://t.co/HbhJnvp4Jk"
"RT @BigBeard_Ali: Dove &amp; Chick-Fil-a just gone have to call me a nigger to my face 🤷🏽‍♂️"
"RT @agolis: My favorite thing about podcasts is how often I now see people smiling goofily on the subway because of something they're liste…"
"I'm in the running to win a Starbucks Giftcard thanks to @shoplemonberry #starbucks #creativityislandgiveaway https://t.co/iGhi2eNhjU"
"RT @MartyScurll: KFC you're lucky you're not advertising chicken wings #C&amp;D\n\n#villain ☔️ https://t.co/L1OsemhM46"
"I’ve had Chick-fil-A for breakfast 3 days in a row. Life is good."
"What a fucking moron!\n#schezuansauce #RickandMorty #McDonalds https://t.co/Ps5ULFxRUG"
"for real..... https://t.co/aXxHxHKYFZ"
"Well, chipotle didn't put my guac in my bag so tonight is canceled"
"RT @Ashton5SOS: I'll be your Burger King,\nIf you'll be my burger queen - @Michael5SOS"
"The new $5 crispy chicken quesadilla box from Taco Bell just gave me life, please keep making these! 🤤 @tacobell"
"Roll 3D6 gas damage... https://t.co/R7gXTJgHog"
"Quee....?! https://t.co/5Gh915Howo"
"All Day Breakfast Menu at Chick-fil-A https://t.co/QJGjYCEXwE"
"RT @pixlpit: @Cranbersher Since Rick &amp; Morty made that one-off joke about that sauce from McDonalds, and McDonalds promoted brin… "
"@DrMRFrancis CHECKERS FOR THE CHECKER GOD! BIOPICS FOR THE BIOPIC POTENTATE"
"hi, Starbucks spelled my name right today. https://t.co/hXqJVr9X5O"
"I haven't at chipotle not one time this week wtf is happening"
"The only reason why Pizza Hut can compete with others is because of their stuffed crust"
"RT @jesuspinkman: I walked into Starbucks and the lady said “hi baby u want your chai?” And I immediately cancelled all future therapy appo…"
"McDonalds On University So Freaking Slow 😒"
"i just ask for chick fil a sauce in the arbys drive thru because i'm embarrassing and stupid"
"RT @shineebeinextra: who's better KFC or McDonalds https://t.co/EZECNxdc1H"
"RT @tiwyf: Jack in the Box's new Cheeseburger Topped w/ a Grilled Cheese Sandwich &amp; new Munchie Menu via @Foodbeast http://t.co/XRZjsrR9GX"
"Mei is a very cheerful and sort of sassy kind of girl. I enjoy having her presence of tl. Can easily make friends a… https://t.co/DBTCTct7w7"
"Papa Johns all the way https://t.co/wx3KntBhEB"
"CCS Spirit Week at Chick-Fil-A!: Come into Chick-fil-A Conway Commons and mention Conway Christian BEFORE you... https://t.co/cZAwK2AdCD"
"aLL FACTS https://t.co/6TmJMLpwDa"
"Y’all hook your Starbucks up with UCA’s because they ain’t got nothing but attitude &amp; time https://t.co/GZK8y0K4UT"
"Young Chipotle https://t.co/PGnmCgWEWk"
"Check out Spongebob Squarepants Bendy Burger King BK &amp; McDonalds Patrick Plankton Premiums  https://t.co/9eZiZL8plc via @eBay"
"@Kyo_Foxtrot Jack in the box tacos!"
"RT @Wendys: Fresh, never frozen since 69\nTrying to cop that mixtape, better get in line\nGrabbed a couple wings now you're tryin… "
"Greatest bars from my two favorite restaurants. https://t.co/xFah1XACuu"
"Couple shares love of Taco Bell in wedding photo shoot https://t.co/oUlcfOpKmH https://t.co/1yl6YGUzOf"
"RT @Taylor_Montana_: All Day Breakfast Menu at Chick-fil-A https://t.co/QJGjYCEXwE"
"Bro wtf get off my car! https://t.co/7leFZEZ2Ra"
"What if I order something free do they give me money ???? https://t.co/jOPpuSapHt"
"RT @4029news: Couple shares love of Taco Bell in wedding photo shoot https://t.co/oUlcfOpKmH https://t.co/1yl6YGUzOf"
"@wingstop @Wendys My two favorite eat spots rap battling is awesome. Cajun and garlic parm classic wings soon. Love… https://t.co/g9ZilL6LIn"
"We now have a president that outsmarts everyone he comes up against that tries to attack him they're playing checkers now he's playing chess"
"RT @TheGabbieShow: FROZEN BEEF IS USEFUL BUT NOT GREAT FOR EATING. @Wendys has fresh never frozen beef that is great for eating! #ad https:…"
"@DMoore_63 @Wendys HOOK EM 🤷🏻‍♂️🤷🏻‍♂️🤷🏻‍♂️🤷🏻‍♂️"
"RT @Shawtyfeels: Kinda wanna look good in a bikini kinda wanna eat three burritos from chipotle kinda pissed I have to pick one"
"@LouDobbs I voted no because: they will become the victims. Just let them continue then next year they will be work… https://t.co/0lEH5YFy28"
"RT @HealthRanger: Skip the fast food. #health #McDonalds https://t.co/mgTArZjxCP"
