"Come for the #coffee stay for the #donuts. @ Krispy Kreme Jersey City https://t.co/nMDEVW2rwX"
"@ki_taughtyou Yea, right across from Starbucks lol"
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"i love u @Wendys https://t.co/6tv5Fk7kyM"
"RT @DanielDavalos: How am I not supposed to believe in conspiracy theories when even Chick-fil-A has a secret menu"
"RT @spookonic: my mood is krystal being upset at jonghyun /everyday/ for giving playboy away"
"Bugging https://t.co/bDsEVGxkcM"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"RT @RichieIsEvol: @Wendys why...? Spicy nuggets....... RIP 🙏😔"
"Forgot to tweet that I received my Starbucks giftcard &amp; Tarte teeth whitening pen from @tartecosmetics!!! Thank you… https://t.co/PF8tQX8AQ1"
"#BOYCOTT LIST https://t.co/f7mHn5weIV"
"RT @BoSnerdley: Actress arrested for 'trying to push woman on to Subway' https://t.co/ZOyJhAsmzH via @MailOnline"
"We playing chess while they playing checkers 🤴🏻👸🏻"
"@MarketUrbanism @PATHTrain @NJTRANSIT It would keep loads of buses out of the city, and offer improved NJ subway tr… https://t.co/XeD5Zl0FFG"
"cool story bro https://t.co/2tNijOB4JW"
"Brand accounts such as Wendy's, McDonalds, etc. I want to be Twitter famous and have a reply from big corporate businesses"
"saw a guy walk out of Dunkin Donuts with a box of donuts and roses... https://t.co/YkGYI9JIAo"
"I just checked in @Wendys with #mPLUSPlaces Download today!  https://t.co/WBbkME2ykZ"
"RT @AllyBrooke: Hahahhahaa. Omg. This photo is so old!! Major throwbaaaack 2014 I think? This caption is everything 😂😂😂 https://t.co/MADVqg…"
"all i’m trying to say is if you go to taco bell you should try a chipotle chicken loaded griller"
"RT @OliviaMesser: On the subway fuming at the difference btw reactions to Meryl Streep’s statement (too late, not genuine) and Clooney’s (w…"
"@RichmondTile We could have 1300 days of subway tile and be happy."
"i second this notion https://t.co/ekptfyvyoY"
"RT @Arbys: Sit boy! https://t.co/rwUIkYZ9bF"
"Ill be at the s train today at grand central station 3-6pm and penn station beside mcdonalds from 8-11pm. See you there :)"
"@brantjamesburke @thewopman @McDonalds It's more memorabilia than actual food people intend to eat."
"Peer leaders participate in year-long Chick-fil-A Leader Academy https://t.co/Q1Ce6W5Xjp"
"RT @KeahiJedi: These cosplayers (who were 2 of 3 Ricks wading around the restaurant) were nice, though. 😀\n#McDonalds… "
"How the hell do you forget the meat @McDonalds https://t.co/s9uV0reOlW"
"RT @ps4andchill: bae: why tf pizza hut keep texting you \nme: https://t.co/7upSqUqkl1"
"RT @PopsicleJokez: Thanks a lot Taco Bell https://t.co/mbWObd5fFF"
"The lady in the car behind me in the white castle drive-through looked like she was having a rough day"
"Talk about being 13 years late. https://t.co/IhHUOHrki9"
"@gfelix I'm reaching out to you today as id like to speak to you regarding licensing KFC and Col Sanders for a line of retail products."
"Some of KFC, Wal-Mart Chicken Comes From Private Prison Slave Labor Scheme https://t.co/PHZOdnZ2VM"
"Who doesn’t think @CarlsJr &amp; Amazon are relationship goals #ad https://t.co/YRgiTlYDVU"
"RT @itsZACJENKINS: him: get out of my house. we are done\n\nme: *leaves*\n\nhim: *calls 4mins later* babe im sorry where u at\n\nme: https://t.co…"
"Oh dear God NOT FAIR https://t.co/UedAi7Y5Ic"
"RT @MissLexiXO: I've drained so many #losers this week I've lost count. My starbucks for the week was paid 3 times 😂 #findom #domme… "
"RT @Simpboyz: yall see a criminal I see a entrepreneur https://t.co/1rjMo75vgd"
"RT @LUChampionNews: Do you like Starbucks? Follow us and retweet this for a chance to win a free Starbucks gift card!"
"RT @NBCNewYork: A group of subway riders got so tired of a man shouting racial epithets at them that they booted him off the train https://…"
"RT @JimAceman: Dear @Starbucks CEO Kevin Johnson (at #GWSummit), We want a 100% RECYCLABLE CUP! #BetterCup https://t.co/yE09f23Irk"
"ya nuggets almost broke my fucking teeth off smh 😂 https://t.co/9Bict6nxWl"
"@knoxwrites @NYCTSubway Check your account. They probably took the money and not credit your card. No response from… https://t.co/1qEvqNAcFq"
"RT @GirlfriendNotes: dont look at my twitter to see how my relationship is going I could tweet “I’m so done” n it’ll be cos my mom didn’t g…"
"got a sleepy kitty in my lap but a growling stomach and chipotle in the fridge what do I do"
"@Wendys what should i get from @BWWings"
"@Instigatorz889 Yes. His diet is 95% Chipotle"
"I'm at @Subway in Edison, NJ https://t.co/joNZfsgjpO"
"@Wendys bring back spicy nuggets bitch"
"I love New York.. dare to mess and you'll get ur shit rocked https://t.co/4GMt5eX3WF"
"ArBYS IS BLESS"
"RT @nihilist_arbys: It's Columbus Day, so we're gonna sail over to McDonald's, beat the shit out of everyone, wreck the place &amp; call it arb…"
"#starbucks truck has such a huge line... but coffee 🤔 https://t.co/YyQMBB1BzB"
"RT @emilyyfagan: i just really love chipotle"
"The Taco Bell Jar\n#FastFoodBroadway"
"RT @Pheramuse: West Side Arby’s #FastFoodBroadway @Arbys https://t.co/UhwoJSAkof"
"Scuse me... what the fuck is this? https://t.co/HvRVf1Sxpb"
"RT @BrendanMcInnis: The Burger King and I\n#FastFoodBroadway https://t.co/6wLYkP9zug"
"Love the petty https://t.co/N7cEODLnb1"
"@TRE4RMDC @Dileiny_cruz I go to Starbucks everyyy once in a blue moon and it's a risky financial decision every time 😭😭"
"Riders shove man shouting racial slurs off Brooklyn subway, throw soup on him https://t.co/W3FuEOCMNp via @pix11news"
"RT @ViraIMemes: McDonalds employee telling the 814th Rick and Morty fan that they don't have szechuan sauce (circa 2017) https://t.co/QB9Aa…"
"RT @Kidigi2lx: #FastFoodBroadway\n\nStreet Car Named Dairy Queen"
"RT @robyndwoskin: The Burger King and I #FastFoodBroadway"
"RT @WickedTags: The Lion Burger King\n#FastFoodBroadway"
"RT @impressmemedia: The latest #Coffee, #Starbucks and #Zen Daily! https://t.co/ubvY4s515h Thanks to @JenJencolo @Mookeyduke @ErinBklyn #re…"
"@yungjli @SUBWAY bro at 2:30 PM?"
"RT @JonHeyman: laguardi's a mess. subway sucks. manhattan traffic worse than ever. penn station as bad, per usual. good job, cuomo… "
"Good to know https://t.co/ATtCe5jpSb"
"@raehex Impressive!! I ate an entire 12 pk from taco bell and went to bed 30 mins afterwards"
"RT @PutinsMyPapi: Maybe Weinstein Got Turned On By Reading This Actual Bible Verse? #Ezekiel2320 Sorry Starbucks forgive me. https://t.co/d…"
"RT @Saressaa: I love New York.. dare to mess and you'll get ur shit rocked https://t.co/4GMt5eX3WF"
"RT @KarinaMRosado: @daria_catherine @yeahitsliv @binalovvesyouu us when we dipped to chipotle that day and all the gym teachers slid t… "
"RT @kfc: “Would you like to be playable in the WWE 2K18 video game?” they said. “As long as my physique is 100% accurate,” s… "
"@MowzTheRapper shiiiiid dominos, pizza hut, whole foods, my kitchen, a tortilla with toppings on it, etc"
"I luvvv dunkin donuts hashbrowns🤤"
"I wanna sucker punch this lady in front of me at chipotle I’ve been in line for twenty five minutes"
"Pizza Hut taste like shit bruh"
"I felt this struggle before but since I work at McDonalds I be giving out like 2 or 3 sauces no matter what amount… https://t.co/tLaccm6g5B"
"In the middle of a wonderful 🎵“@Starbucks afterno-oo-oon” 🎵 with @sammbringas https://t.co/THJsk9Tfh1"
"@SUBWAY The bullshit carved bullshit"
"I've got #Oklahoma to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/IaXCnblDsJ"
"Me when there was no prize in the cracker jack box. https://t.co/5mG70WDHC2"
"Toms River chipotle been off its game lately...."
"@Pheramuse @Arbys A bunch of white guys rhythmically snapping their fingers in unison.... https://t.co/Z4NiYd77tC"
"RT @K1NGR1ZZY: @BurgerKing Girlfriend: I wonder if he’s thinking what I’m thinking. \n\nBoyfriend: I still can’t believe @Wendys doe… "
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"M.T.A. N.Y.C. Subways:  A Train irregular subway service at W. 4th St. #traffic https://t.co/cLJ9IKsg5n"
"RT @zthunda: first of all @Wendys , who told y'all to get rid of spicy nuggets?!?"
"Bro what is Arby’s doing? This is the third anime reference y’all have made https://t.co/SoPJa1hCMQ"
"RT @GoldTeethXXX: \"finna walk into mcdonalds bout to make columbine look not so schwifty. shoulda had sheshwan\"\n- overheard at community co…"
"Burger King throwing shade 👀 https://t.co/oIVuiAmUp5"
"So does @Arbys .... https://t.co/FspMwpWzqf"
"RT @CatGee1989: Beauty &amp; the Roast Beast\n#FastFoodBroadway\n@Arbys https://t.co/ghumTnvEHM"
"firaga sauce and mtn dew shinra blast plz https://t.co/xOb3MP2TSu"
"New Yorkers setting a good example with how to deal with a shithead https://t.co/HRDAwgTHQS"
"@SLIKNIKTHERULER Omg do you know how angry I fucking get?! It's like when people post their subway sandwiches..... LIKE STOP OMG"
"RT @KlausBromi: Nerds getting rewarded for becoming dumb, angry mobs has been a terrible trend over the last few years. https://t.co/03h8RQ…"
"Crispy Crab Balls with Chipotle Tartar Sauce are the perfect holiday, game day, or party appetizer!… https://t.co/0xFpIhjtlb"
"RT @dumbbeezie: I told the Taco Bell guy NOT to give me any napkins. Reverse psychology shit."
"the kids build your own at chipotle🙌🏼"
"Want to work at Panera Bread? We're #hiring in #Princeton, NJ! Click for details: https://t.co/ewzeBhi0li #parttime #Restaurantlife #Job"
"Yo they're so dope for this lol https://t.co/otYm45m0AY"
"RT @Duragsandtacos: When ya mom ask ya to stop by McDonalds but ya remember on  March 16,1998 when she asked did ya have McDonalds money ht…"
"Yes but good burgers not mcdonalds burgers lol https://t.co/7str0sfEvl"
"This is great https://t.co/rJ3pyEbXmn"
"@brendanstl @Wendys Someone on our team who wasn't even in the presentation brought them up today too!"
"RT @MatthewNussbaum: Fact checkers know it's false. Tax experts know it's false. WH aides know it's false. Trump keeps saying it anyway: ht…"
"#FastFoodBroadway Starlight Panda Express"
"Micro business development! https://t.co/IFgTqpyhrc"
"Why are these girls at Starbucks talking about how everyone they knew were having sex in 5th grade?????? I’m scared and confused."
"RT @richardiancox: I approve of this tweet. I also approve of those fries. I also may or may not be the english voice of this dude. https:/…"
"@realDonaldTrump Don’t care if you endorse it. How is that even allowed? You like it because it comes with crayons… https://t.co/BtBpnysX68"
"RT @Polygon: McDonald’s proved that Rick and Morty’s smartest fans have no idea what the show is about https://t.co/D87jC9H3fF"
"RT @joanneofarclol: We tried to order a cheese only pizza at the Pizza Hut in China and they came back with this... https://t.co/sEflnqCGvn"
"RT @MrCreeperGamer6: Imagine being a fast food employee with low pay and no job stability and having these horrible STEM dweebs come in… "
"Hey Insomniac! Excellent review! https://t.co/DEEmzsVhFT"
"Hey @InsomniacCigars , excellent review! https://t.co/DEEmzsVhFT"
"M.T.A.   Metro North Railroad:  New Haven Line irregular subway service at Grand Central Terminal #traffic https://t.co/cLJ9IKsg5n"
"Chipotle lines are od"
"Join the Panera Bread team! See our latest #job opening here: https://t.co/7jLVxc3J1O #parttime #Restaurantlife #OldBridgeTownship, NJ"
"RT @hoteatscoolread: Get your cheese fix at your local @culvers on October 15th for National Cheese Curd Day! #CheeseCurdDay #giveaway… "
