"RT @The_News_DIVA: Second Avenue Subway’s Newsstands Are Shiny, New — and Empty https://t.co/kag29qhgol"
"I’m excited to get Starbucks after this exam"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"Join the SONIC Drive-In team! See our latest #job opening here: https://t.co/7HKykAxqGV #SONIC #Hospitality #SilerCity, NC #Hiring"
"RT @FACTmag: \"We stood together and kicked this disgusting racist off the train.\"\nhttps://t.co/DWQDUGfw8c"
"RT @BigBeard_Ali: Dove &amp; Chick-Fil-a just gone have to call me a nigger to my face 🤷🏽‍♂️"
"RT @msmarypryor: Rapper/fellow Bruja, @PrincessNokia Says She Threw the Soup at the Racist Guy on Subway ❤️ https://t.co/YC5NwcoBn8 https:/…"
"lmfaoooo oh nooooo https://t.co/yX9t1po10L"
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"RT @7evenSoFuego: Woke up to a racist getting his ass handed. It's a beautiful morning https://t.co/mSOKSI6kp2"
"RT @BrandiNico: I'm a month ahead and pre-annoyed at the inevitable protest of Starbucks holiday cups while we all out here complicit with…"
"@BurgerKing me: a big hurricane tried to blow us away, but we are ok. 3 year old foster child: A BURGER KING TRIED… https://t.co/ehvzO4bb1k"
"@TheOrangeCone @Arbys Can't wait to try the venison sandwich coming out on 10/21."
"Dude is that from the McDonalds AA game? https://t.co/yPnS7hmelw"
"RT @tonyposnanski: Scott Baio is so mad about the Boy Scouts so he is boycotting them by not allowing them to fundraise in front of the Sub…"
"Can someone love me the way @JonTLangston loves Chick-fil-a or the way @bretteldredge loves his dog?"
"RT @pirateradio1250: RT &amp; Follow for a chance to win 12 pack Heineken; $50 to @parkersbbq &amp; @AJMcMurphys; dozen @SmashWaffles &amp; Dominos… "
"RT @_LetMeRock: Nolan Carroll is Lil Toast. \n\nMalcolm Butler is sweet honey chipotle barbecue chicken. \n\nWho else? Lmfao"
"Plz tell your employees the diff btw Honey Mustard &amp; Regular Honey. I got the wrong sauce, no ketchup &amp; no straw w/ my combo @McDonalds"
"Ok #fuck #Starbucks #Breakmanscoffee in Matthews. Dude. It will put all you Starbucks stans to shame #drip #coffee #breakmans"
"RT @Sarah_Hyland: The problem with being single isn't the fact that you're alone. It's that you can't puppy dog eye a guy in to getting you…"
"Me, everyday, after I give birth... https://t.co/tVB6MNBQYR"
"@dominos took an hour and a half to deliver our basic pepperoni pizza for staff lunch! Back to work and eating at the same time now, smh."
"RT @Jonlyncia_Vee: 4 bc ik this chipotle gonna be life changing after work 🤤 https://t.co/ZOwNkZRqgj"
"RT @CarmellaWWE: I love it!! Thank you SO much! And the Starbucks gift card!! And the letter was very sweet 🙌🏽 https://t.co/WDgPO7GFBU"
"RT @ps4andchill: bae: why tf pizza hut keep texting you \nme: https://t.co/7upSqUqkl1"
"True legend right here! We love you mella https://t.co/6jncAThTjn"
"RT @gweeto: I went to get some of that Rike and Marty sauce this morning, but Taco Bell told me my SAT score was too low."
"YEERRRRRR https://t.co/2CYSYV6woT"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"Do I drive the 15 minuets just to get Krispy Kreme or nah?¿ 🤦🏼‍♀️"
"RT @x_FreshStart: Dove and Chick-fil-A going just have to call me a nigger to my face."
"RT @Whataburger: I don’t need a curve on a test. I need Whataburger."
"Smh They social media director must have voted for Trump. So @dominos what's up on a free pineapple &amp; pep pizza? Sh… https://t.co/StMFQRWLB2"
"@BustedOpenRadio had a Taco Bell employee #toosweet me the other day when he saw my Bullet Club hat. #BustedOpenLive"
"Can ever see why this KFC advert was taken off the air. https://t.co/IOGi8EX7PQ"
"RT @barstoolsports: Red Wings fan is facing a lifetime ban after throwing the first octopus on the ice at Little Caesars Arena… "
"I love this song https://t.co/tF2i86hye0"
"RT @transgirlsonic: you guys have no schezwan sauce? no- i want schezwan sauce! \nwhere's! my! schezwan! sauce! im PICKLE RICKKKKK, WUBB… "
"Absolute hell yes \nhttps://t.co/VNq9UO8DVk"
"RT @ClickHole: Still Human: 5 Times Nelson Mandela Got Stuck On The Roof Of A Pizza Hut https://t.co/Y1NlmjtPgm https://t.co/xdgeTqfK04"
"RT @DPtheMC: LMFAOOOOO https://t.co/xW4NCwcqfM"
"RT @marcuslemonis: I'll take it. Good young man with talent @JoeGibbsRacing https://t.co/7SOjXOXASD"
"RT @oraltwjnk: YASSS LADY WITH THE SOUP GO BEST FRIEND THAT’S MY BEST FRIEND https://t.co/lnxF22xPpQ"
"RT @gwufca: That’s our Vice President! Good luck tonight @GWUWSOC https://t.co/VHJsvkY10C"
"imagine coming home from deployment and seeing THIS. MAN. https://t.co/uIkK7NOSuC"
"Me did zombie mobile pawtrol @ Starbucks 2day. Not much zombs 2 bark @ today. Maybe next time. RAAAA!  #ZSHQ"
"Thank God @jillniski introduced me to @Starbucks iced green tea latte 😩😩 it is bombbbbb"
"@Sarah_Hyland Maybe Starbucks will deliver in the near future and resolve this issue for you 😉 #starbucks #coffee"
"I'm at Chipotle in Boynton Beach, FL https://t.co/c8G94urTX4"
"RT @Jordan_Bianchi: Camping World fills the void created by Subway’s abrupt departure following Donut-gate. https://t.co/TAe6bQ8Lkd"
"omg lalisasgemini legend sending blackpink scurrying for mcdonalds job applications"
"#Batman Forever The #Riddler Mug #McDonalds glass 1995 https://t.co/3XtMA2WyNi https://t.co/eS7tP2xa2i"
"Love this! &gt; Connecticut Chipotle locations to support American Cancer Society https://t.co/pn6Bm9SSHP https://t.co/6lK7vLDziK"
"RT @dookie_420: lmfaoooo oh nooooo https://t.co/yX9t1po10L"
"I've got #Oklahoma to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/s4vn0ElEOo"
"Y'all get on it, I'm 9 follower referrals away from a free sandwich. https://t.co/jqF0fka32i"
"Thinking about having Subway for lunch tomorrow then heading on over to Camping World to take a dump and not buy anything."
"I saw this video without the sound cheering for the person who threw it come to find out it was bae 😭🙌🏼 https://t.co/Aye4uw0ky0"
"I could really go for some Chipotle right now."
"RT @YouWont_GetMe: Chick-fil-A and Dove going just have to call me a nigger to my face. 🤷🏾‍♂️"
"RT @CautionClock20: Camping World has taken over Subway as sponsor of the No. 19 JGR Toyota for Talladega. Here is Daniel Suárez' paint… "
"@penchuk what are you doing for lunch? \nhttps://t.co/dhkSdpQrs3"
"Just left @McDonalds and bit into some nice plastic. Choking hazard much? #yuck https://t.co/th0Hz4BZe3"
"Wonder how many Starbucks orders are taken in a day? How many bags screened? WATCH: #CLT https://t.co/LlUY8tPFMT #DestinationCLT #CLTisPrime"
"Plain and simple https://t.co/vNtpoRgjPI"
"i really hate you lmaoo https://t.co/jPScBndgDs"
"RT @IPunchTHOTS: Dove &amp; Chick-Fil-A gonna just have to call me a Nigger to my face🤷🏽‍♀️🤷🏽‍♀️😂"
"Chipotle queso will be the death of my diet and health."
"Developer says new Triad Starbucks could be trial balloon for small markets https://t.co/nTLmohUlSH #Greensboro"
"I'm at @Wendys in Charlotte, NC https://t.co/yW8N4GM2HE"
"@ThomasBeautyy 🌟I want this bish played every time I walk into a Starbucks! 🌟🌈☕️ #jesusboughtmymachiato"
"RT @RichieIsEvol: @Wendys why...? Spicy nuggets....... RIP 🙏😔"
"RT @BEAT_TWITTAR: RICK AND MORTY FANS SCREAMING \"LOL OWNED\" AS THEY LIGHT THEMSELVES ON FIRE OUTSIDE A MCDONALDS THAT RAN OUT OF THE MULAN…"
"Why are fast food social accounts so savage, I am screaming 😂 “Promoted by @BurgerKing” https://t.co/9zODZ5rEw6"
"RT @iamduncc: if you really wanna impress me then bring me chick-fil-a on sunday"
"RT @18dMedia: Queso Fail, Other Headwinds Lead This Analyst To Remain Cautious On Chipotle https://t.co/OubTALOPSH #benzinga https://t.co/p…"
"El REY DEL TACO 🚚 @elreytaco today at: #Wiley E.S. 301 St Marys St #Raleigh from 4:15-7:15pm #Tacos #FoodTruck https://t.co/PuXGBMeERW"
"RT @CaryImpClub: Let's taco 'bout eating at Chipotle on Wrenn Drive this WEDNESDAY 4-8pm. Imp Club gets 50% back from all sales when… "
"RT @meechonmars: BRING BACK MY BELOVED SPICY NUGGETS @Wendys"
"RT @Mvriaan: I love this song https://t.co/tF2i86hye0"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"@BusterFiddlewig @masterjoe116 It’s also why Taco Bell is the only place you can get Baha Blast."
"RT @alexisnwilson: I live off subway bc all I literally have to do is walk ten steps from my dorm"
"RT @poon_goon: someone tell me why forever 21 and taco bell did a collab https://t.co/V7kpadEgpt"
"Please RT! Have you seen Checkers? #missing #lost #pet in #Bothell #WA 98012 https://t.co/YiDK0C9H36 https://t.co/7Y5FqS893w"
"Don't forget to eat at Chipotle TONIGHT 4-8pm!!! https://t.co/esqKW5aA6a"
"Anyone that surprised by Harvey #Weinstein? Did no one watch #Entourage?  Guy was a massive piece of shit. I wouldn… https://t.co/XwqJQtDmLI"
"Pizza Hut Is Nasty Af 🤷🏽‍♀️ Lets Argue"
"Chick-fil-A lemonade mix with sprite might be crack"
"@__justShanna Go get Starbucks or a smoothie lol"
"@khrystalized Hello Krystal sunbae, sure I don't mind. I'm SF9's rapper Zuho, delighted to make your acquaintance."
"RT @Arbys: Sit boy! https://t.co/rwUIkYZ9bF"
"RT @ChillySoSa: If you ever on the road and gotta take a shit use Starbucks bathrooms they have the cleanest ones im here enjoying a nice s…"
"McDonalds is fed up now 😂 https://t.co/ACZxEpJfQW"
"Cookout https://t.co/goSbBuZCkz"
"RT @Chicago_Styles: So I went to @Whataburger  and I just had to rap my order cuz I was mad hungry!! https://t.co/1AAwL2wa6h"
"RT @anallievent: Got leftover doughnuts? Make Krispy Kreme Bread Pudding with Carmel Pecan Sauce! Yum!  https://t.co/9aeTv4S1xp… "
"RT @Wendys: Well, we've had it four times this hour. (It was a 4 for $4, but we're counting it.) https://t.co/wAXGDniSTo"
"@Arbys Ok at eating arbys tonight what is this? I am ordering this specifically because of this post"
"Krispy Kreme Day will begin tomorrow from 4pm-5pm! Get here early before they are all gone!… https://t.co/rF3AtfPXnb"
"RT @SCEDPprez: Developer says new Triad Starbucks could be trial balloon for small markets https://t.co/VsK08k0MCI via @triadbizjournal Wel…"
"Love that fall flavor. #shopnorthcross #starbucks https://t.co/JO3dvnQKPi"
"RT @TheDweck: Why has Hillary stayed silent about this??? https://t.co/A8BR3J1lLe"
"RT @StarbucksPorn: friends and starbucks https://t.co/PnVYlDqntj"
"RT @SpursPortal: Why not have both🤔 https://t.co/qjwHaP1jYX"
"RT @Gothamist: Classic 1970s Vignelli Subway Map Uncovered At Midtown Subway Station https://t.co/SNpjiwYgUG https://t.co/Jy5NMRSitB"
"I need both! https://t.co/t9wYvToKhi"
"I just asked for a large coffee @ Starbucks and this chick actually replied with “we don’t surve those sizes, do you mean a venti?” No bitch"
"@CNN Did @realDonaldTrump have Taco Bell before that pic was taken?"
"Spice up your day with our Pulled Pork Sandwich. The chipotle sauce is the secret ingredient. https://t.co/ohaSHwhybu"
"RT @ajplus: Rapper @princessnokia confirms she was the person who threw soup at a man yelling n***** at kids on the NYC subway. https://t.c…"
"Nancy Drew 40 The Moonstone Castle Mystery PC white 1 EP by C by CindyBearsDen  https://t.co/i4PuyWcAv1 via @Etsy"
"Went to @Starbucks and they didn't put espresso in my latte. I'm actually hurt."
"Traveling from Raleigh to Florida! Getting some Starbucks before flight. https://t.co/2ucknqlNVh"
"@saratozaki How stressful can it be working at Panera Bread? Lol jokes."
"RT @vuurren: i eat at McDonalds now https://t.co/a2Kl6peMl3"
"RT @synewaive: The panda express lady gave me not one but three forks. Hello? Jenny craig? Yes I'll be down in a momentarily to fi… "
"taco bell sponsored daca protest \" think outside the border \""
"I went to NYU Law! I'm a lawyer! 👩🏻‍⚖️ https://t.co/qAsI7K2yQR"
"RT @m_shatts: not only do I feel bad for the guy at gun point, I feel bad for that baby knowing they’re about to be brought think… "
"RT @_crownxroyal: How the fuck McDonalds IN WALMART don’t have caramel???? Bitch go get it"
"RT @liveatdurham: Krispy Kreme Day will begin tomorrow from 4pm-5pm! Get here early before they are all gone!… "
"RT @MikeyMedinas: Yoooo @Starbucks why in the world are you getting rid of the mango and peach syrups???? All I ever get there is mango lem…"
"Visit: https://t.co/HCeW5i52PX Developer says new Triad Starbucks could be trial balloon for small markets https://t.co/kLMUy2xfdh"
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"#FutureCars via @TheRealAutoBlog Mid-Engine Chevrolet Corvette Prototype Spied Near the Drive-Thru… https://t.co/JRXiDQlind"
"are you ever on the subway and get the feeling the train is going waaaaaay too fast"
"RT @KenzieAlysse: A mood: eating a tossed Greek salad, drinking Starbucks and listening to Meek mill"
"Let's Welcome Krystal Bell to the Honda of Roanoke Rapids Family, with a purchase of a 2017 Honda Accord."
"Join us tomorrow night at McDonalds on Cedar Creek Rd from 4-7. Support Sunnyside"
"RT @TroyDreyfus: I can't win... but this is a kickass prize pack from @pirateradio1250 🎉\n#TheStationForWinners https://t.co/JcTNY9CSRr"
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"ISSA MEAL😋chipotle at home!😊🙌🏾 #chipotle #yummy #applecidervinegar #organic #healthylifestyle https://t.co/19D3U5DINP"
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"RT @LUChampionNews: Do you like Starbucks? Follow us and retweet this for a chance to win a free Starbucks gift card!"
"this made my day https://t.co/nnqLL9cQzP"
"RT @K1NGR1ZZY: @BurgerKing Girlfriend: I wonder if he’s thinking what I’m thinking. \n\nBoyfriend: I still can’t believe @Wendys doe… "
"This is so funny. So it wasn't in @CityPortStLucie like I thought it would be, but it's less than an hour away so t… https://t.co/9bl1yN0jQj"
"I want chipotle"
"WooHoo!! Can’t wait! https://t.co/aUmMStdfmg"
"Join us now until 8:00 @ McDonalds @ Cole Park!  30% of the proceeds go back to the school! https://t.co/WDvgYwckK1"
"RT @PureMichGirl: I wonder what the “UPROAR” will consist of? Rush’s analogy: you go to McDonalds to buy a Happy Meal and have to lis… "
"Comets come to Charlotte at the end of this month \n#Checkers https://t.co/U5JjZvpdpk"
"How do you say no to that? https://t.co/728kIJVtXr"
"RT @FunnyQuotees: The time when McDonalds gave out good toys... https://t.co/98UgJk4drM"
"#Starbucks sells caffeinated milkshakes. Exclusively."
"RT @GMA: Couple dating since high school take wedding photos at the restaurant they frequented for dates -- Taco Bell.… "
"Our customers are awesome! We installed our first Tesla Charging Station powered by Solar for Chick-fil-A at... https://t.co/oYnYxQrxxO"
"Still funny https://t.co/AcSgiVFOVU"
"You can't be mad and argue with me smelling like onions straight from Burger King and sour milk you just can't sis... 🤷🏾‍♀️"
"@TRUMP_CRUSHED @Omnibuscloud @keepingitspooky Dawww, but it's cute you think the cashier is the one in charge of Mc… https://t.co/QyiL5QQagg"
"Sitting in Target’s parking lot + eating Chick-fil-A while Jax sleeps. A break. \n\n#MomChronicles"
"Want to work at Taco Bell? We're #hiring in #Cameron, NC! Click for details: https://t.co/5mCpRtheAa #Hospitality #Job #Jobs #CareerArc"
"RT @HuevosDeChivo: Harvey Weinstein is now to Hollywood and the Democrats what Jared Folgle is to Subway:  \nA Permanent 💩-Stain!… "
"RT @Apvalk: @amazon, if you pick #Raleigh I will include some Dairy Queen Cakes in that incentive package. #TriangleDelivers and so will DQ…"
"RT @PrincessKima__: Hold on, you might’ve just did something 🤔 https://t.co/y0DybGY5g3"
"RT @its_niaa__: My little brother does that😷 https://t.co/RKEUXR96iM"
"RT @TheComedyHumor: The time when McDonalds gave out good toys... https://t.co/VDD273ZWi8"
"Been on that Wave bro🔥🔥 https://t.co/aBk6HOd7ih"
"It's cheap but you'll regret it the next day https://t.co/KEeJhxNvs8"
"RT @jonnyrocket941: Chipotle queso is awful. Doesn’t even come close to @Moes_HQ"
"RT @saaath_: Went to a Greek place that's Chipotle style ordering and it was as glorious as it sounds https://t.co/VgjIueYTpn"
"Arby's tests elk sandwiches and adds venison nationwide https://t.co/20isoVQIOP via @WCNC"
"My sweet man has made this anniversary so special 💕 Even though the @starbucks lady put that… https://t.co/iiuSCNMogi"
"@ConanOBrien Since lobster taste like chicken I just go to KFC. Its kinda brown though."
"RT @nihilist_arbys: It's Columbus Day, so we're gonna sail over to McDonald's, beat the shit out of everyone, wreck the place &amp; call it arb…"
"Today was so amazing. I am so thankful for meeting Lorraine and Krystal. Their level of talent… https://t.co/wSdEN5FOk0"
"RT @Tee2Times__: Been on that Wave bro🔥🔥 https://t.co/aBk6HOd7ih"
"Ok but the chick who KNOWS MY ORDER at this Starbucks isn’t here. \n\nDude that’s working? Slow as shit."
"Thought I was the only one https://t.co/kiMkVlzNDe"
"RT @ETCanada: Rapper @princessnokia throws hot soup at drunk racist on NYC subway https://t.co/O3scMzJEpV https://t.co/FwsBFqzbtl"
"FORGET CINNAMON ROLLS THE HALLOWEEN KRISPY KREME DONUTS HAVE RISEN AGAIN!!!!💀🎃👻"
"swear wendys don't be giving me enough napkins"
"@Leeward411 @dagenmcdowell @pizzahut pizza hut pizza is \"fast food\" pizza. It doesn't really count as \"Pizza\""
"This Pizza Hut is the best thing that’s happened to me in a while lmao"
"How many times is it acceptable to go to Starbucks/Dunkin' Donuts in the span of 1 day?"
"@lunablaise Yes. And after, we can go get some Pink Drinks and Chipotle, and gain it all back. Then, work out again. 😂"
"RT @_xofa: Thought I was the only one https://t.co/kiMkVlzNDe"
"Nahh I can say no to it https://t.co/phBx3hXq0q"
"LMFAOOOOOOO https://t.co/o2djMdprQk"
"Tim Hortons isn’t Dunkin Donuts Tee shirts #SuggestedTimsItems"
"@carlisleeeeeee @MichaelKeIIy Your both showing up or I am taking away the Little Caesars from catering"
"RT @GWU360: TONIGHT: Let's #FillTheHill as @gwuwsoc takes on HPU at 7:00PM! Residence Hall with the most in attendance, will wi… "
"RT @nola_creole: larry works at mcdonalds but worried abt digestion problems? #90dayfiance #BeforeThe90Days"
"The best one is them standing by the registers watching the Long ass lines. https://t.co/5CcBmHBe0S"
"The pettiness of the war between @Wendys and @BurgerKing keeps getting better. https://t.co/cJXidqFdD1"
"Oh, deer!  Arby's will serve venison sandwiches nationwide https://t.co/Hdu3uNYpiQ"
"RT @GiggsGotBeans: @ABC11_WTVD I mixed up drinks in Mcdonalds, so much I should be in Guantanamo Bay. WTF is this shit? lmao"
"Friday's home opener is right around the corner, get ready by discovering the Checkers with @discoveryplace! \n\n🎟… https://t.co/34iACuAfSK"
"RT @TybriaPless: Lmaooooo honestly. https://t.co/7Ghs6HH03S"
"RT @_Ciphelo: I'm weakkkk af 😂😂😂😂😂😂 https://t.co/CKzvKhaA0W"
"RT @CardoMP: Lmfao I'm fucking crying!! 😂😂😂😂😂😂😂😂😭😭😭 https://t.co/OwsPXfAFdh"
"Being rude and obnoxious like Starbucks and Dunkin Donuts Employees #SuggestedTimsItems"
"RT @_tasteofAsya: Yeah, they gon' keep getting my money. https://t.co/hV5arkg7lJ"
"I wish chipotle delivered."
"They're terrible https://t.co/B24ON9Jkhj"
"Lol @Ethan_Doby idk why but I felt like you should be aware of this https://t.co/TnqwEOtho5"
"Mental illness https://t.co/hYquArzfi0"
"Subway really hit the spot 🤤"
"RT @MettaWorld_Mack: Mental illness https://t.co/hYquArzfi0"
"@TooCocky \"blue birds...?  Wait, you mean Falco?  HELL no, he's too air-headed.  I chose Mystic because i like Blue… https://t.co/koqW6ziyWV"
"RT @Simpboyz: the race turned into a triathlon https://t.co/OzivbGhRWV"
"RT @Mumbology: Ok folk's this one is for all the marbles... When you eat a Meal from Mcdonald's/Burger King/What have you, what order do yo…"
"RT @Skratch: Never thought we’d hear Beef sound southern and Boo sound English, but here we are, presented by @Arbys. https://t.co/z6TvVJNN…"
"@Ethan_Doby @ColeLedford11 @Wendys Hahahahah I'm so sorry I just had a vague memory of you, spicy nugs &amp; 2am conversations 😂😂💕💕"
"That must be one delicious hamburger!\n#amsretail #wendys #expensive #overpriced #oops https://t.co/QzRPdgq8CX"
"Dinner Specials 10/11\nReady at 6PM\n\nChips &amp; Chipotle Red Pepper Salsa $3\n\nVegan Pumpkin Soup $4 cup/$6 bowl... https://t.co/Nqjsg8aENu"
"The employees at the Starbucks by my office officially know me by name. I'm a real adult now."
"RT @HoodJesusYo: Live by the 5 C’s and you’ll be alright:\n\n1. Christ \n2. Coffee \n3. Chick-Fil-A \n4. Chipotle \n5. Canes"
"RT @LiberalGribble: Title = what every suburban soccer mom\nwith an I'm With Her bumper sticker says\nto her friends at Starbucks and act… "
"RT @jimpjorps: at Taco Bell; woman ahead of me is trying to order a “chocobo supreme” and will not work with the cashier to figure out what…"
"@x_lilred we was just talking about this 😂😂 https://t.co/zQBKbZcTh1"
"Lock the doors it's white girl season. #YourBasicIsShowing https://t.co/bptMYWF5qy"
"RT @IamAkademiks: Police Release Surveillance tape from Chick-Fil-A where cops accuse Tay K &amp; friends of killing man.: https://t.co/Lxjac2W…"
"@kgounews @NPR 🤔 Popeyes, KFC and nutrish use meat from modern day slave labor and no protests? Nothing? Slavery! T… https://t.co/rf9MztaMmx"
"Bring the kids to the Downtown Park Thursday for Playtime in the Park! Art activites, giant checkers, jenga &amp; more!… https://t.co/tyamkVbAz2"
"@taeestackssz Panera bread they bomb"
"Thanks to @TownofCary Parks, Recreation &amp; Cultural Resources for providing so many opportunities for our community… https://t.co/gKQlP5FUh1"
"RT @McDonalds: You spoke. We’ve listened. Lots more #SzechuanSauce and locations. Details soon. And that’s the wayyy the news goes! https:/…"
"RT @rim_ari: This warmed my heart https://t.co/fYv6jNVdfi"
"RT @NEWAVE9X: \"How will you know that McDonald's has the best fries, if you have not tasted the fries at Burger King, or Wendy's… "
"RT @HenryMakow: Poster at downtown Toronto subway station. Society has embraced decadence/Satanism. https://t.co/O0mYYbqG7s"
"@iandouglas736 Tim Hortons was the best part of when I lived in Ohio, need one in NC!"
"@Starbucks I got the bingo Email but can’t join it. Says it was meant for someone else!"
"Burger King is hiring @TaylorTwellman That is your destiny"
"RT @CELEGlRl: you guys have no schezwan sauce? no- i want schezwan sauce! \nwhere's! my! schezwan! sauce! im PICKLE RICKKKKK, WUBB… "
"I don't usually get Pizza Hut delivered to my place but when I do it better be in a white mustang."
"It's Wed night! Order your pizza from the Manteo Pizza Hut &amp; tell them Manteo Redskins. Part of the proceeds go to the MHS football program."
"RT @BitchAssBowie: Burger King out here promoting slander LMFAO https://t.co/fNj3kKpi6H"
"Can confirm. Have seen his spirit form reside on top of my store multiple times now https://t.co/lmjyT7HqBz"
"RT @Shopkick: RT if you use your kicks for Starbucks! ☕️ 🙌🏻 #taylorswift #coffeeaddict https://t.co/280q4G2o5W"
"I liked a @YouTube video https://t.co/ob0dAETY9a MIXING 10 DIFFERENT STARBUCKS DRINKS TOGETHER! Taste Test!!"
"RT @chrissyteigen: It's in the first one dammit jorden https://t.co/E08E7KagZW"
"I want some Chick-fil-A"
"RT @MiiToons: Mulan didn’t deserve any of this. \n\nHope y’all  enjoy this piece I came up with in the midst of all the chaos!… "
"I want the Taco Bell X Forever 21 Tacos 4Evar shirt but its sold out in large =/ https://t.co/fxB7GWnZXl"
"@ChadSilber You don't drink caffeine? What was in that @Starbucks drink I saw you sipping on at the afternoon meeting today? Hmm...."
"officially able to twirl my mustache which means I can FINALLY chase my life dream of wearing beanies and writing in a starbucks year round"
"RT @nkorontzi: @jimmyfallon @Pink Pumpkin-spicito,\nGoing into Starbucks somewhat incognito,\nWarming up my hands while chasing a mo… "
"Pink Tickets at Van Andel Arena, Little Caesars Arena, KFC Yum! Center, and Quicken… https://t.co/Khl2to4zBp https://t.co/Ie9GoEV2lm"
"I'm glad you brought that up! I (unfortunately) only got 8 hours of sleep last night so I got a pick-me-up to avoid… https://t.co/318j6gfhOQ"
"Come out to Chick-fil-A in at Stone Creek village &amp; tell your cashier you want your dinner to support families in crisis in the hospitals!"
"Omg some Chipotle 😩"
"RT @espn: It doesn't get much better than this!\n\nVote for the winner of this week's @Wendys #RivalryBeef matchup below:   https://t.co/BcXe…"
"RT @MoonfaceMkveli: Looooooooool I’m sorry what... KFC are struggling 😂😂😂😂😂😂 https://t.co/r6fN3vABmk"
"Just found a hidden Chick-Fil-A 5 min from my house...there goes that diet"
"Just give me some White Castle and whatcha cheddar popcorn and I'll be so happy 😩👅"
"People dead ass let their kids do anything ... this little boy LITERALLY crawling in the window frame at mcdonalds… https://t.co/9kTLWUWM7D"
"RT @dril: i love \"Going hollywood\" by retweeting burger king and lock heed martin 1000 times"
"RT @Hardees: If a burger needs anything but meat and fire, it's not our kind of burger. https://t.co/rPabUrJ1TT"
"Dunkin' Donuts dropping \"Donuts\", eliminating some donuts from menu. And that's how Dunkin' died - https://t.co/ww2N4NWLaS via @Inc"
"RT @ThereGoesWill: Dude hit the manager with his car twice and drove off. He’s facing felony robbery charges over a soda at McDonalds… "
"RT @Shuhenaz: Ryan Brown Snaps the Frenzy of Morning Subway Commute in New York City: https://t.co/rs6cTTxtEm"
"RT @tinaaturner: Go to chipotle today and show them this picture to support the athletic training student club! https://t.co/qlY4LGsrtS"
"Nothing will compare to the shit 2016 was ok https://t.co/7F9Vig6G9D"
"RT @vadreamcatcher: Why the Chipotle hype? Moe's has more topping options, gives free chips, &amp; tastes better. It's like iphone vs android.…"
"Celebrating&amp;Congratulating Soror Roz 💕💚on your appointment as COO @Starbucks#Starbucks @akasorority1908#RosalindBre… https://t.co/FEnyW8SIh4"
"“Promoted by Burger King” 😭 https://t.co/yO2c0mshLs"
"Wendys &gt; Burger King https://t.co/kcAvkXXqhw"
"I fucking hate checkers https://t.co/u5naeAkmB5"
"Just saw the Taco Bell naked egg taco advertised. I'm in."
"RT @Scaachi: Laguardia is a great airport if you've recently been held hostage by large rats and just need a quiet place to eat some off-br…"
"RT @lisacrost: I just found this beauty at a U-Bahn station in Berlin: A subway map that shows the amount of passengers with line… "
"Same https://t.co/UVvP2nORiJ"
"@GeorgeFoster72 A bunch of red Coca Cola cups from old Pizza Hut restaurants and a Chilis margarita pitcher"
"When I was 16? I worked at a Pizza Hut &amp; fellow employee walking by smacked my ass while I was bent over scooping ice. I hit him in the 1/"
"He looks like he wants to be alone just for a min and people not know who he is just peaceful by himself celebritie… https://t.co/k8SnC31Kfq"
"RT @ZmbabweH: He looks like he wants to be alone just for a min and people not know who he is just peaceful by himself celebritie… "
"RT @mrdaddymanphd: at cicis pizza with my boy and the only way i'm leaving the all you can eat buffet is in a god dam ambulance"
"Bethune 😋 https://t.co/mOfD1cj7Ut"
"RT @Drops: dont call yourself goth unless you travel with ravens on the subway https://t.co/IJ9yvMGCHE"
"I'm craving crab legs, sushi and chipotle all at the same time right now....."
"You gone learn today. https://t.co/87zzeIN0cL"
"@Wendys  Is your Roast Game better then @Arbys Roast Beef?"
"@nyulaw, this is how your alumni behave? I am appalled!!! He was proud to shout out his alma mater! https://t.co/87zzeIN0cL"
"And you look like u gonna work at Arbys for the rest of ur life cuz u have never sold one of ur trash ass beats and… https://t.co/Eoe9LwwSaI"
"@Laura_ToGo taco bell hack: ask to replace the meat with beans. beans have fiber and fiber means a happy colon and happy poops"
"@Luke_Lyddon @ChadSilber @Starbucks Call him outtttt https://t.co/KrVhykBfgU"
"@Hardees Y'all are my favorite! The best freaking Burger's Ever... https://t.co/PlkWmHFW6c"
"Ouch ☹️ @starbucks https://t.co/RmYonjDmDD"
"RT @meghantonjes: I’m watching Lorde in a McDonalds on her IG story and JUST IMAGINE IF THAT WAS A FAT WOMAN the response."
"Half way in-between the psats ; is working at McDonalds that bad.... https://t.co/KKI4KaKrwD"
"OKAY https://t.co/PcS5rTHaVZ"
"RT @officerjeon: \"yes this is mcdonalds how can i take your fuckin order\" https://t.co/lJjSWbjbea"
"@Houtz @FinkleIsMyMuse @Alpha6Phinsider @PhinFan305 MMMMMM ARBYS"
"I just started crying at dairy queen &amp; Ana going look at me like \" don't start \" 😑"
"RT @ZoeWilkins6: @greg_doucette @JJGass In UK = chains eg Macdonalds / KFC. Indies have burgers, chicken wings,  beer in frozen glas… "
"RT @PeaceNOLove: I don't use dove but chick fil a 🤷🏿‍♀️😂😂 https://t.co/MaakszVf9G"
"RT @C_Royalty124: I'm screaming! https://t.co/rkIFmXX9lg"
"RT @WuanLevar: And then even if they do ima turn the other cheek like Dr. King wanted us to https://t.co/DSt462Ag6p"
"Yo the guy at taco bell gave my white friend hot sauce and gave me mild sauce. Dats white privilege."
"I go to chipotle and I get a water cup with my food and I’m filling it up with sprite and kid no older than 14 goes “that’s not water”"
"“Imaging thousands of dieticians being trained the McDonalds nutrition institute” @iamKSealsAllers #BFinwhoseinterestsAUS"
"@Houtz Can you win an arbys gift card?"
"RT @dzmt_: @Crowell_ YouTube video title : STORYTIME: TACO BELL EMPLOYEE RACIST?! (True Story)"
"RT @donnascalise: @wendi1760 @giselessecret @JoeDoggers @metalheadjs @anitakearney65 @AlloccaMirella I’m sure he’s having at least 3… "
"Ok yes https://t.co/1MbBsjWIPQ"
"Girlfriends about to be taking their mans Pizza Hut hoodies all winter 17 https://t.co/DvCgviiSbw"
"RT @PDChina: Subway in southeast China starts pilot run of #BRICS Summit-themed trains https://t.co/V8IFp3S2lM https://t.co/GikRKpn8HJ"
"RT @LimitedRunGames: Our physical release of Skullgirls on PS4 has arrived! @Skullgirls @Arbys https://t.co/gZ5J5PZERA"
"Why is Burger King promoting a tweet for Wendy’s ? 🤔😂 https://t.co/nKgXZm73sN"
"@tacobell just got outta this taco Bell and it was terrible :/ https://t.co/AI0DkAYlh5"
"RT @MACSchools: Come out to Chick-fil-A Thursday night and support Jones Intermediate!\n\nTell the team member serving you that you …… "
"RT @BuffaloSabres: Nothing goes better with hockey than the new Tim Hortons Lattes! #TheFoamoIsReal https://t.co/IWgZOQSEUL"
"RT @LocalSoundwave: Since I am Mexican I dedicate this Starbucks cookie I'm about to eat to Eddie Guerrero"
"RT @Browneyedbethy: “Okay, best idea ever and exactly what the people want. Taco Bell clothing line.” - someone from Forever 21 who makes t…"
"When you realize your timeline is talking about “Strasburg” instead of @Starbucks https://t.co/jlSqVjGth1"
"I hate that this country ass town doesn't even have a chipotle"
"@DiceParadise @WatchItPlayed When did McDonalds get cloth napkins"
"@TheLionheart_22 Wtfs a whataburger 😂🤣"
"@rader5thgrade @quailridgebooks @RaleighWakeRead @rader5thgrade we need to go to @quailridgebooks together!! Coffee… https://t.co/Rtv7nVG9Ee"
"The only reason I went to Wendy’s!!! https://t.co/AZlt0J1y2U"
"Should I get the this taco Bell bodysuit from forever 21 or like...not? https://t.co/7G0h46xA5x"
"RT @HPUCAT: Krispy Kreme donuts will be coming to campus for our Midterm Exam break! Come to the arcade this Wednesday anytime… "
"oh my god.... this is a thing?! https://t.co/DhVX69JC9o"
"RT @beatlesjad: Woman accused of abusing dog aboard TTC subway appears in court - 680 NEWS https://t.co/9PAYtio1xZ via @@680news"
"When life sucks, live brave, fight back and eat a taco in a taco shirt! #Forever21 #tacobell https://t.co/1Xl9ggJ6lG"
"so what's the official word on this queso at chipotle before i waste my time"
"RT @254isabella: Father, son, and the Holy Spirit https://t.co/eEy1MdkYd3"
"RT @QueenCanaan_: Polynesian &gt;&gt;&gt;&gt;&gt; Chick-Fil-A Sauce.\n\nNot a debate."
"RT @K_dollaazz: I just started crying at dairy queen &amp; Ana going look at me like \" don't start \" 😑"
"@Wendys really started selling chicken tenders instead of bringing back spicy nuggets. https://t.co/QbQ8ZhOSSp"
"What kinda question girl 😂😂 Japanese ofc https://t.co/XY67tPllnV"
"@pizacowhore @tydahighroller Taco Bell is disgusting"
"I only made that video saying Taco Bell because we were eating tacos lol https://t.co/h6FleZLBzl"
"@tydahighroller @pizacowhore Tyler Taco Bell is nasty af! 💀"
"On me Taco Bell is nasty as fuck https://t.co/XOdwtAt8sh"
"RT @oledirtybastard: On me Taco Bell is nasty as fuck https://t.co/XOdwtAt8sh"
"PREACH!!! That’s what I tell all the Chipotle lovers @Moes_HQ https://t.co/8pAbVbJuYi"
"Yes because I always ask for some https://t.co/e25DAYHpJd"
"Didn't want to believe it, but I can now confirm... Chipotle queso is just not good"
"RT @callmeshitto: haha brooke i see where u wished happy national boyfriend day to taco bell on instagram. i get it like taco bell is ur bo…"
"Congrats to @drewWmoss our RT Winner today! Stop by between 9a-5p M-F to pick up your prizes\n#Stations4Winners https://t.co/7LfIwz3BZw"
"RT @andrew1k_: zaxbys &gt;&gt;&gt; chick-fil-a 🤷🏾‍♂️"
"Here’s the real reason why Chick-fil-A is closed on Sundays https://t.co/ItCixo2Pnr https://t.co/XTdQcM97sP"
"RT @BieberBonerz: My mom won't even buy me McDonalds https://t.co/PcTP5rozbK"
"RT @runnergurrl13: When @_halanakristi has her boyfriend come over and he surprises her with chipotle AND hella Victoria secret stuff.. wtf…"
"RT @mijames82: Check out @subway Share  Color Event &amp; Giveaway @mommybknowsbest https://t.co/d7Djvouu5A #giveaway #spon #charlotte https://…"
"RT @neithtextiles: Loving this - perfect beach game 👍🏼👍🏼👍🏼\n\n#womaninbiz #wnukrt https://t.co/gpvaLkb4i1"
"RT @SHUTUPitsASH: stopped to clean jane krakowski's subway ad. nothing but respect for MY president. #RaisedRight ❤️ https://t.co/1j0OarAMoG"
"RT @brett_dchek: Instead of being a disrespectful douche bag you could have been a normal person and asked them to fix their mistake https:…"
"@Wendys Riverdale is on CW right now. Whats your opinion on that?"
"@Hazama95 @gogothegamering @Skullgirls @Arbys 56 page manual with move lists, fully-patched game, CD soundtrack, re… https://t.co/aFv2Ce2niC"
"RT @lejonpettis: Taco Bell: *announces they have a clothing line at Forever 21* \n\nMe: https://t.co/L7dMn7bDt2"
"\"I will wash your mouth out with sweet tangy chicken\"\n- well played @kfc"
"Just had zaxby’s for the first time.. I was not impressed"
"RT @SBTigerPride: Join us tomorrow night at McDonalds on Cedar Creek Rd from 4-7. Support Sunnyside"
"RT @invisiblemario: @theburiedtruck Not to mention the cringiest of cringe (especially after the whole McDonalds thing this week lmao)"
"RT @KodakWhite4Real: Dudes be cheating on there pretty gfs with chicks that be looking like a KFC potato wedge 😂"
"RT @_xoemily: checkers 🚫 https://t.co/hUJIXn1oeT"
"RT @WorldLatinStar: Let's Wait ... ⌚️... 👀😳😳 WTH just happened here ? 🤔 Yikes Only in _____ ? #MTA #SUBWAY 🚇#WORLDLATINSTAR.com… "
"@jbarbernc @quailridgebooks @RaleighWakeRead @Starbucks You should come to the monthly @RaleighWakeRead  meeting at Meredith with me"
"I'm at @McDonalds in Columbus, OH https://t.co/AmcIZHKDx1"
"RT @joefrancis: Taco Bell’s Fashion Collab with Forever 21 Is Here — See the Whole Collection https://t.co/gugQ28cZgZ #fashionwee… https://…"
"RT @RevDamico: Congrats to all! The achievements of @ciw, @FairFoodProgram &amp; @WSRNetwork are honored thru Greg Asbed's 2017 award!… "
"15 for Steel, Speed, and Sweat at #houseofpain. Welcome FNG Checkers: https://t.co/JjJpbLHX3C @F3Churham"
"RT @ohmyyymanda: 🍃 Starbucks, fall scented candles, Halloween movies, fuzzy socks &amp; cuddles. Nuff said. 🍂🍁"
"Just went to Panera and they were OUT OF BREAD. No bread bowls, no baguettes, no nothing."
"I'm at @Subway in Durham, NC w/ @jclarkcni https://t.co/94q6XSzWt8"
"get stuck behind someone with a \"pray\" sticker going 10 below the speed limit, they pull into wendys. fucking of course"
"Who is as excited as I am about Starbucks... https://t.co/TmbtCFajEC"
"What I Learned from Reading the Saddest Customer Service Complaints to Starbucks https://t.co/oGjiU1NRKK https://t.co/nYXv4vkSte"
"RT @WXII: Here’s the real reason why Chick-fil-A is closed on Sundays https://t.co/ItCixo2Pnr https://t.co/XTdQcM97sP"
"RT @Mr_Han_SoloDolo: Forever 21 came out with a Taco Bell inspired line of clothes for guys and girls. 🔥 https://t.co/l9VqXX2FnP"
"RT @flawlessk_: mcdonalds be acting so fucking stingy with they sauce."
"RT @danavento: AD-New spin on a Potato Medley. #RediscoverLaMorena https://t.co/PKWAub2nmd #VivaLaMorena @lamorenausa #Chipotle Ga… "
"RT @FieldRoast: We made two pizzas for #NationalSausagePizzaDay with crumbled Field Roast Italian Sausage and sliced Field Roast Me… "
"Lmk why I just spent an hour &amp; a half of my time with a guy awkwardly eating dinner together &amp; then going to a starbucks off campus 🤔"
"@jonhein Did McDonalds send you a bottle of this? https://t.co/c0GNAvJnCv"
"Bring back the spicy nuggets pls @Wendys https://t.co/M5Z0qeDOpA"
"@Megara11 with taco bell or my presence? 🤔"
"When @Tinder notifies me I'm liked and I'm swiping but none are matches I wonder: was it the @Starbucks cup or the chocolate lab? 🤔🤔🤔"
"RT @CFMT: Music City Cares Fund Gets Boost From Starbucks Foundation, Sends More Grants to Aid Las Vegas Victims https://t.co/wVfZUv8ymB"
"RT @Jonathan_Dunphy: This is hilarious. Pizza Hut keeps innovating. https://t.co/6VXtyCr0wn"
"You fucking moron that’s a MKIV, what were you thinking https://t.co/03XPjjKO3V"
"RT @taylorBEE_sayin: Because I’m still supporting https://t.co/XQkKh35Q6Y"
"RT @iRap4Food: thIS APP https://t.co/SPfcCoNlLm"
"RT @lyriicmonae: lmfaooooooooo mannn https://t.co/vjCSZPySwQ"
"RT @cashhshonn: Lmao this not funny😂😂😂 https://t.co/OX2jZ7TTz0"
"RT @ssentience: RT to win a $10 Starbucks gift card ☕️\n• must be following me and @glowradiant 💫 https://t.co/uQnvo3fiBv"
"I’ll see ya at @Forever21 😂🌮‼️ https://t.co/yYEp5d9m6j"
"Honey Chipotle Chicken Pizza Recipe https://t.co/695z0NhUpI via @TonyaStaab"
"@_AlexGleason @_sarnantha @Wendy hahahah omg hi Wendy I’m so sorry, anyways @Wendys you fake af bring back spicy nugs"
".@CleanAgencyInc got me a @culvers gift card for winning EOM. Shoutout to my coworkers for knowing the way to my he… https://t.co/FXScitlWxv"
"RT @WEEZYonYourTL: LMFAOOOOOO https://t.co/C5yJ0ZReV1"
"@elisewho @sarahmccammon @Starbucks Where did this happen? That is messed up."
"If he wants to memorize my Starbucks order so he can bring one to me in the library on those long nights, homeboy can like... get it"
"Y’all go work at Taco Bell and you’ll never want to wear this crap again https://t.co/9r1Z7OJHpZ"
"Who Got The Best Cookies? Subway Or McDonalds ?"
"lol, not even close. thanks, fact-checkers!\n\nhttps://t.co/ONWPqA0YmO"
"Mans was too lit off the LimeARita tho 💀 I was done once that soup got thrown 😭😭 https://t.co/A2QHVMb2kr"
"i want chick-fil-a to have spicy nuggets. or strips. pls."
"Queen. https://t.co/RfHJQ2jmSl"
"RT @CapeFearSolar: Our customers are awesome! We installed our first Tesla Charging Station powered by Solar for Chick-fil-A at... https://…"
"White Castle time. I don’t remember the last time I’m had one haha!! @ Fremont Street Experience https://t.co/11GVwtCtT8"
"Yes! QUICK! 🤣😆😂😅 https://t.co/QsRXYvvujB"
"@HollywoodHoller This nut can go join the guy who berated the Chick-fil-A employee on camera. No one wants to work with him."
"@Arbys What kind of deer is this venison from? New Zealand Whitetail?"
"RT @UpUpDwnDwn: Are you ready for @kfc's #WWE2K18 SHOWDOWN?! The Colonel and Puppers the Chicken will face off on UUDD tomorrow! https://t.…"
"RT @ShaunaJ1776: Five followers away from 2500! If I reach that goal by week's end, I'll break tradition by going to Krispy Kreme &amp; stalkin…"
"@ChickfilA get spicy nuggets &amp; I'll drop the whole not open on Sunday grudge https://t.co/VXKDR0auQ2"
"@KFCBarstool Reverse kfc mush?? @KFCBarstool"
"Sometimes the best therapy is a salted caramel hot cocoa from @starbucks #comfortdrink… https://t.co/9B1R1GMKSI"
"RT @Hanthenaniking: @ChickfilA get spicy nuggets &amp; I'll drop the whole not open on Sunday grudge https://t.co/VXKDR0auQ2"
"I think you meant \"better\". Subway and McDonalds do NOT have the best cookies https://t.co/awTAe25BRb"
"RT @_AiMegan: I don’t even eat Arby’s but I enjoyed this https://t.co/7jZPhLGpMG"
"FOOD REVIEW: BURGER KING CINNAMON TOAST CRUNCH MILKSHAKE: https://t.co/fnk90jFFgl via @YouTube"
"I added a video to a @YouTube playlist https://t.co/fnk90jFFgl FOOD REVIEW: BURGER KING CINNAMON TOAST CRUNCH MILKSHAKE"
"RT @55mmbae: Way too good https://t.co/YB0fKrgmeF"
"RT @jackiekcalmes: He's confusing his proposed rates, calling things \"a 1st\" when they're not &amp; promising tax cuts so big even an R Co… "
"RT @ScotLouie: That audience was accurate. If I saw them outfits/ heard that remix I would've been down to the Chipotle until it w… "
"RT @DamienPrinceJr: I went from working at Little Caesars Pizza to a millionaire in 1 year #TBT https://t.co/02Ss9B8bqD"
"Brown Rice Carrot Fritters with Chipotle Sunflower SauceFollow... https://t.co/NfpsHQ883q"
"Man doused with soup for explosive rant on NYC subway https://t.co/5xvOzqhJ8h"
"RT @TheNBABulletin: This kinda random but the fruit loops shake from Burger King wet af."
"@Wendys can you please tell me why I found a rock in your baconator fries and how it got in there?"
"THESE SUBWAY COOKIES IS FUCKING GOOD, GIVE ME 2 MORE https://t.co/ot5xdx3R9w"
"RT @MarcoVaIor: Burger King on some other shit https://t.co/MMW2QPp1Wn"
"In other news this is the greatest thing that’s ever happened to me 😭🌮❤️🌯🙌 https://t.co/3ULirZsCP9"
"Promise? https://t.co/QiifNK744I"
"Convicted Islamic Jihadi Mulumebet Girma - Jailed for Helping Subway Bombers - Gets Top Council Job... https://t.co/X1lR78uONy via @FPPTim"
"RT @invertedwAvess: @SellKicksSunday $171 shipped with promo code “KFC”"
"RT @KMaddify: Did the same thing just to get to a chic fil a... Ended up getting jackinthebox instead @saltinesquad https://t.co/8AfJF6sEM7"
"Something to wear under your Pizza Hut parka! https://t.co/rUWSlYnIk3"
"RT @riccialexis: Start your day out the right way with a @McD_CentralAR Pumpkin Spice Latte!! #McCafe #ad #McDAmbassador #PSL… "
"RT @vickyloebel: Visit the blog tour for a chance to pick up a starbucks gift card. And, you know, sample my audiobook :) https://t.co/4xwr…"
"RT @SpeedyArroyo: Subway 🤷🏻‍♂️ don't @ me https://t.co/GcxrzLWyJ7"
"@McDonalds I'm already fat, thank you."
"RT @treydaymartin9: Chick-fil-a is a blessing upon blessings"
"Facts.. a nice lil bussdown especially w/ that half HI-C half Lemonade 😩 https://t.co/kNgmv7KKmm"
"I eat it every now and then https://t.co/FSFBv7ZNy8"
"Subway https://t.co/jQ1X3pNrpf"
"The amount of extra cups McDonalds has given us today is amazing. Thanks for the love #ExtraCup https://t.co/cT6pDReLp8"
"Deer meat sandwiches return to Arby's locations nationwide\n\n(Via WATE News) https://t.co/utKU6nZFyd"
"\"Sales associate at Chipotle Mexican Grille\" is a new one for me"
"@leaderyongs Which starbucks did you go omg starbucks is always full house 😧"
"That jacket is hot. https://t.co/Rm2iW6hRnr"
"Panera Bread donates food that &amp;quot;helps heal the soul&amp;quot; to East Tenn. officer https://t.co/Qf81BeZavf https://t.co/ksCDPQBvg3"
"@_little_old_me @DadandBuried @dominos 11am, 10 on days they have to make pizzas for the school cafeteria. #pizza"
"Can Starbucks put this in there coffee https://t.co/81wVJCxIVp"
"RT @CptnClout: The way my bank account looking rn, Taco Bell too good for me. https://t.co/5zVEUMBScf"
"There's a lot of deer hunters (and others) who will be licking their chops for this sandwich. https://t.co/KK8KbqBT8A"
"I second that, McStud. https://t.co/5liMQS9Xps"
"RT @TheCubicleChick: Cheese lovers unite! National Cheese Curd Day is 10/15. Read how to celebrate at @culvers! https://t.co/U7dZGgxAPs #Ch…"
"RT @365DaysofBaking: #ad Celebrate National #CheeseCurdDay by visiting @culvers with a friend and you could get some Cheese Curds FREE!… "
"@emamar_ @SUBWAY that is SUBpar"
"IDG this marketing strategy burger king https://t.co/1YkYq8njrw"
"@bri_maguire Chipotle is as toxic as this relationship."
"@WORLDSTAR Subway by a mile!"
"RT @KedAdams7: 🦉CAT DADDY SAYS TAYLOR SWIFT IS LOADING UP \nON A GRANDE CUP OF STARBUCKS CAUSE SHE \nLOVES THAT ITS LIKE A SUPERCHAR… "
"RT @emamar_: @jmbrowne97 @SUBWAY Jake Browne strikes again, amazing 🔥"
"RT @YourGfAdmireMe: I love a nigga that take his time instead of 2 kisses n now your dick out😂😂 like holdon swiper put jack back in the fuc…"
