"Update: Subway has not seen my dad... https://t.co/MmJEY3MpYR"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"RT @Jacobt66: McDonald’s is literally the best company on the planet 😂 https://t.co/fFOQ13rsq3"
"@erinsorensen Happy birthday! May we all love something as much as you love Nebraska and Chipotle!"
"The drive through window guy at Burger King just told Emily to “have a delicious night” 😶😂"
"@meigheyburn That's even worse than going to Subway and having them put everything you ask for on a Sandwich!"
"RT @oraltwjnk: YASSS LADY WITH THE SOUP GO BEST FRIEND THAT’S MY BEST FRIEND https://t.co/lnxF22xPpQ"
"RT @K1NGR1ZZY: @BurgerKing Girlfriend: I wonder if he’s thinking what I’m thinking. \n\nBoyfriend: I still can’t believe @Wendys doe… "
"@westandfortrump @1GigiSims @ChicagosFines19 @RealMikeWilbon @alozrasT @carrieksada @JrcheneyJohn @michaelbeatty3… https://t.co/yhSgHlSp3f"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"RT @nihilist_arbys: Mommy, why am I so sick?\nShh. Save your energy, baby\nDoes God hate me?\nDon't be silly, there is no God. Eat your arbys…"
"Sweet Potato Cornbread \"sausage\" Muffins, Chili and Chili \"burgers\" w Cashew Chipotle \"Mayo\" on… https://t.co/qZlcX18q3G"
"#HonestCakeMessages I told you not to eat Chipotle https://t.co/bDmJTHxzpi"
"I know I complain about @McDonalds ice cream machine being broken all the time, but this seems excessive. https://t.co/vXEFgSsACA"
"i wish i could say what i wanna say but people would get offended https://t.co/XGKt6FR9eJ"
"RT @Arbys: Sit boy! https://t.co/rwUIkYZ9bF"
"RT @OkigboHTX: This is literally the same burger that killed spongebobs health inspector https://t.co/MS4obmvCA9"
"Chipotle Blue Ash Reed Hartman - m4m https://t.co/mylamoQmp7 #MissedConnections"
"RT @yashar: I love this - Burger King doing sponsored tweets of people complaining about Wendy's https://t.co/TqUR15XfKH"
"Im tired of seeing burger king PROMOTE tweets about @Wendys getting rid of spicy nuggets."
"@ByAnyMeansMo @Wendys SOMEONE HAD TO FUCKING SAY IT"
"@jnrupard Are you going to Pizza Hut"
"I once tried to drunk text #911 cause I didn’t know where the nearest taco bell was."
"RT @jimpjorps: at Taco Bell; woman ahead of me is trying to order a “chocobo supreme” and will not work with the cashier to figure out what…"
"RT @maggieunz: Easy and Scrumptious \nSlow Cooker Honey Lime Chipotle Pork Loin \nRecipe: https://t.co/2sNdlMdu8C #crockpot https://t.co/CyvG…"
"cody got me taco bell, reese’s cups &amp; a huge thing of sweet tea after my doctors appointment, &amp; i’m in heaven 😫😍"
"RT @itsZACJENKINS: him: get out of my house. we are done\n\nme: *leaves*\n\nhim: *calls 4mins later* babe im sorry where u at\n\nme: https://t.co…"
"Starting to hate working at subway , cause every time a boy walk in , they always come up with some little corny pickup line 🤦🏼‍♀️🤦🏼‍♀️"
"RT @tacobell: Want a sneak peek at the #F21xTacoBell collection? Watch Taco Bell’s first fashion show with @Forever21 live on Ins… "
"ICYMI: .@pizzahut delivery is getting hotter ... 15 degrees hotter.\nhttps://t.co/LHooBvVjry"
"RT @RedbirdMenace: Rick and Morty fans are behind the times; Bojack Horseman fans have been lining up at McDonalds to get depression for ye…"
"RT @Svage2times: Hoodrich \nLil Baby\nFuture\nTI\nLil Boat\n21 Savage... basically the whole industry https://t.co/qtlN7XWMWt"
"RT @ps4andchill: bae: why tf pizza hut keep texting you \nme: https://t.co/7upSqUqkl1"
"I just got really happy when I realized tomorrow is Wednesday and Wednesdays are subway lunch dates with @kasey_jamison17 😍❤"
"RT @BTiYS: Project Life students discussing employment at McDonalds And YMCA! #BTinnovate https://t.co/BLitu5JZd1"
"I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/CnRA8ppZNk"
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"RT @ashweekaee: @kfc Today they found a body behind your store in Kennewick Washington and it made me sad"
"Why this tweet promoted by Burger King https://t.co/Ue4foJ0dEZ"
"@MLSist I’m eating Taco Bell and the sadness hasn’t gone away please advise"
"@thisisbrookeb the taco bell event"
"Oomf needs to come get her man!!! https://t.co/6zPbMxoMOK"
"@Kevinish You know what would cheer you up?\n\nArbys."
"Pizza Hut Parka keeps you as warm as a pizza https://t.co/zxLA3hBLoq"
"@_HMoney #NBD but @McDonalds has added new Chicken Tenders to their menu."
"They should at least get a real meeting for this creativity! @CarlsJr @amazon @prweek Props to the #marketing team! https://t.co/7ewC3kNk0g"
"@alliahdw98 @VanillaNean @LynnetteCavelli I WILL ALWAYS HATE WENDYS 4THIS https://t.co/FeoAHjP9QO"
"RT @NiaJaxWWE: True that I love my @Starbucks especially the drive thrus 🤣 @AlexaBliss_WWE https://t.co/N96bT7PlpP"
"RT @slimm__808: I’m convinced that I need a second job just for my Red Bull and Taco Bell addiction."
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"You know you live at Subway when you find food in your hair after work 🙄"
"Someone please bring me cinnamon twists from Taco Bell I’m begging"
"RT @McDonalds: You spoke. We’ve listened. Lots more #SzechuanSauce and locations. Details soon. And that’s the wayyy the news goes! https:/…"
"Burger King out here throwing hella shade https://t.co/43sHxBj8kT"
"RT @gsazetapi: Help support GSA tomorrow! Go get Chipotle from 4 to 8 PM and show this flyer! https://t.co/xR08oG4I0W"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"RT @Abella_Danger: I workout so I can eat all the junk food in the world, tonight I trained at Barrys then went to Taco Bell immediate… "
"Clouds at graduation guac Zita gabby Diaz ah showing go UCLA Di fish DHL ox you flax sickbay KFC con blow do dish J… https://t.co/Q5KHdx7xg2"
"RT @TheyCallMeChew: This chipotle worker really said this is my third day in a row. Like what are you so loud for? 😂\n\nI asked for extra ric…"
"I love this song https://t.co/VzGvB1mC3r"
"RT @jmiguelsanto: Windsor man faces lifetime ban for tossing first octopus at Little Caesars Arena https://t.co/eyLeB9zQt7"
"RT @BruceF03: Love New York https://t.co/c6IU04zp7V"
"Guy at taco bell apologized for startling me when he opened the window because I wasn't paying attention...."
"RT @winniethap00h: “for papa johns sake, dude”"
"i despise eastgate chipotle"
"Dude from Starbucks told me drive safe , wonder if he heard me do a boosted launch from the stop light🤣"
"RT @TheDIYideas: How McDonalds Fries are Made https://t.co/Dtdsof6yjK"
"RT @RichieIsEvol: @Wendys why...? Spicy nuggets....... RIP 🙏😔"
"The thin crust pizza from domino’s is so fucking good im only ordering from dominos from now on."
"Turn around and die @Wendys"
"Fuck you @Wendys https://t.co/RkGqrHssWS"
"RT @BurgerKing: @RichieIsEvol @Wendys we resurrected the spice. 10-piece spicy nuggets are here at BK starting 10/12 for $1.49."
"@fangirlphantom_ omg next gift for Jess 😂😂😂 https://t.co/o6GFJFnh0J"
"Locals tweet this three times a day https://t.co/RzLFPGPHfg"
"@_MGRalph boy i know i seen u at the red box at mcdonalds an u was wearin skullcandy headphones with a George colla… https://t.co/p8ZvqMxCKF"
"This wasn’t me @Wendys but is this vandalism or advertising? Either way it’s a good marketing scheme https://t.co/tN8g8TwzqH"
"RT @tonyposnanski: Scott Baio is boycotting Eminem by refusing to turn the radio to Shade 45 in the break room at Subway."
"I'm sorry but every time the Colonel from KFC says \"Finger licking Good\" it makes me highly uncomfortable"
"About chipotle. Lol"
"RT @lisacrost: I just found this beauty at a U-Bahn station in Berlin: A subway map that shows the amount of passengers with line… "
"RT @HoodJesusYo: Live by the 5 C’s and you’ll be alright:\n\n1. Christ \n2. Coffee \n3. Chick-Fil-A \n4. Chipotle \n5. Canes"
"@skoorbkcin @Wendys How’s their water tho?"
"RT @OmarGoshTV: Dropping the NASTY SUBWAY sandwich PRANK video in a few minutes. Wait till you see the workers faces."
"Does sign Diaz Xbox Foo idiots womb gofag CNN bay spat soak Dixon FL KFC GM fag clash floods AC bulb cock gay foots… https://t.co/Mpu3Zwlivo"
"My son said bring him some cookies home, but I’m bringing subway instead 😂😂 I eat Subway every night now lmfao"
"@Wendys you just gonna let them promote this level of shade on twitter? https://t.co/NqHXzxfOpJ"
"@Wendys why must you do this to us 😭😭😭 https://t.co/niTyuc39VR"
"Lmao bet he ain’t a lawyer anymore https://t.co/usL7AlNYz5"
"RT @AshyGod: Your mcm paid $300 dollars for some McDonalds cartoon dipping sauce but refused to donate to Puerto Rico, he 27"
"RT @PBrennanENQ: Cincinnatians: I'm currently holding office hours on the sidewalk outside the Taco Bell on E. McMillan. No need to knock,…"
"@ameliafunk_ @Morgan let’s go to mcdonalds"
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"RT @kstarbrite: Wonder if Aaron will let me be the woman in the new Escalade at Starbucks at 1pm after her Pilates class super stre… "
"I just really want Taco Bell"
"I always said to my friends I don't eat checkers or shoprite cakes but to them it's like I'm being petty.. they tas… https://t.co/bAQb1fyjC2"
"@mackenzieeee_d I only beat you in 2 of 3 because you got me in golf but that shit was confusing me😂 but now we’re settling it in checkers😂"
"RT @GroovyTi: Boy what Chick-fil-A you at??? https://t.co/zv2waluQsL"
"@mace_suee pleasing the wendys gods"
"I want chipotle tomorrow 🤔"
"RT @snooki: Yes please! https://t.co/40vnDUKpsj"
"my america https://t.co/npoFHSuOKD"
"RT @baileyybond: lmaooo Burger King really promoted this https://t.co/j1zAm94cYD"
"@RecklessC_4 I had Taco Bell &amp; I’m up with severe stomach pains. I gotta get up at 3:30 for work 😭"
"RT @meechonmars: @Wendys .@Wendys I just wanna say.... Yall better get it together before another company does.… "
"\"Promoted by Burger King\" 😂😂 https://t.co/wRL3zNxRru"
"RT @MikeAdamOnAir: when u get a 10 piece nugget at mcdonalds and they only give u one sauce https://t.co/1f3wAuafni"
"RT @Ashncoll: I haven't even tried Chipotle's new queso because Chipotle is known for 2 things: Causing diarrhea and being inferior to Moe'…"
"i really want a peppermint mocha from mcdonalds"
"blue raspberry freeze from taco bell 😋😋😋"
"Me ordering chipotle and they stuff me on the chicken https://t.co/JjoeSM7KFC"
"at Starbucks rn"
"Working at chipotle is a fuckin blessing 😌"
"gal bartender in nashville - her great grandma invented the shamrock shake i swear to god.. said she was the first woman to own a mcdonalds"
"any em fan who liked frump completely missed the point of his music, like rick &amp; morty fans shouting at mcdonalds fans about nugget sauce."
"RT @AliceSpecht: @McDonalds did you really get 17 packets a store or did your managers just make buku side cash #pissed… "
"McDonald's runs out of Szechuan sauce, and police are called to handle angry crowds https://t.co/Zx9CqR3QLi"
