"RT @StayTooned_: Chipotle https://t.co/VI0AfGK0Mg"
"RT @CauseWereTexas: Whataburger https://t.co/h3JB1QvQOv"
"I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/7wdTEoDzTV"
"he’s fine tho https://t.co/rVeWZ9s9Tc"
"@livelovealways_ @Dilf_Hunter_ l will eat or drink anything McDonalds, because of the extra l got in an order.{BUGS… https://t.co/LZTM6NDDy0"
"This is exactly how we SHOULD be handling racist people https://t.co/sXCIFIk3aN"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"He said MCDONALD'S FOOD IS BETTER THAN SUBWAY..  What state he in? https://t.co/KvZjHlhe44"
"RT @foodevolutionph: Leo Martinez schools millennials on how to enjoy @kfc teriyaki shots in different ways\nhttps://t.co/2d5Muj3Kxn https:/…"
"RT @ToddBergin: 'Rick and Morty' fans are not happy about how that Szechuan sauce promotion went down https://t.co/9k3WCJLXzO"
"@kurtzennn @2Dnot3D I dunno, I don't go to KFC anymore. It's on the other side of the interstate so I may get shot… https://t.co/6lFHQ5La7y"
"Murfreesboro, #TN - Panera Bread Company - Cashier Line Cook Delivery Driver - CASHI... https://t.co/qBn37yGEKR #DRIVING #JOB #MURFREESBORO"
"RT @CHELS_EnvY_me: Play chess, not checkers :)"
"Everytime he pulls up with Taco Bell without you asking https://t.co/K64FYS0CMv"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"Burger King so petty tho 😂😂😂 https://t.co/0MViZzizgi"
"RT @DenkyuuMedia: Subway stations could soon allow you to walk through without needing to tap your card https://t.co/DvDsKA8O6D https://t.c…"
"@SUBWAY One day later and I still can’t make up my mind 😢"
"RT @tcox5470: #BBM17 Presented by Papa John’s To Feature Blue Carpet Entrance https://t.co/AbW161jyd1 https://t.co/RpCuXsbMJf"
"RT @FrenchCalhoun: Play Chess Not Checkers https://t.co/W9nOLrDcY0"
"Jeff it was nice meeting you at Chick-fil-A in Smyrna a couple months ago. https://t.co/TnTYf7R629"
"@Starbucks is there a problem with the app?  It keeps blinking off before I can order or pay."
"RT @YallSomeCoons: Not only did he say the “n-word”, he got drunk off a lime-a-rita. He deserved to get his ass beat. https://t.co/wQNob4dD…"
"RT @nihilist_arbys: Sure, shit's bleak, but remember: we're all gonna be so fucking dead soon. None of this matters.\nEat arbys"
"I just pulled up to Krystal to order a cold brew instead of Starbucks... who allowed me to get up this early"
"RT @ScullyCoffee4NF: Back to the daily grind after NYCC. \nLike/follow on Twitter, FB or Insta by 10/13 for chance at a Starbucks card (p… "
"RT @max_tesnow: Or McDonald's, Taco Bell, ECT. https://t.co/KXrcEQlkYI"
"@nytimes Take a look at this @budweiserusa @Ford @gmc @PapaJohns @GEICO @Visa @pepsi @McDonalds @Bridgestone #BoycottNFLSponsors"
"Take a look at this @budweiserusa @Ford @gmc @PapaJohns @GEICO @Visa @pepsi @McDonalds @Bridgestone… https://t.co/FosJ9ojqAq"
"Someone threw soup at him! 😂😂😂 \nNot all hero’s wear capes https://t.co/lixRqQmp54"
"It’s October 12 and I’ve officially ran out of money on my Starbucks gift cards. Sad. 😅"
"Did you have your STARBUCKS☕🍵 @ayerscg497 ❤😍 @JannealFranklyn https://t.co/ElX0zQ4qB4"
"@Ibrycehall i just want to drop out of school and still make cash to pay for panda express fym"
"@CarlsJr Y'all need lessons from @Wendys. SMH"
"Taco Bell and Forever 21 are linking up to create fashion https://t.co/8x5wIokqKI"
"“He was the reason @McDonalds started selling chicken nuggets” -@Robert_Post #GladeStaffSays"
"Pizza Hut made a jacket out of delivery pouch materials - https://t.co/IeJEf8FITx https://t.co/9zG0zkExQh"
"I figured @codylowe88 would be more upset about not being able to reach back row on kfc buffet than them taking out! McDs has happy meals!"
"Quick should I go to krispy kreme even though it’s like 20 min away"
"Jessica gets to work early to do her makeup and I am only here early to eat my chick-fil-a #Priorities"
"— TODAY —\n\nBible Break @ Starbucks on Paul Huff from 10-11AM. Bring your bible and get a drink… https://t.co/QQdiYbUmNn"
"#starbucks is cracking me up #today ... I read it like the #book of #rupiah 😂😂😂 #jokes for days. https://t.co/CMst8gbsPw"
"Still don’t feel good but at Chick-fil-a finna go to work"
"\"For a low price of $12, you can smell like Starbucks in October.\" Great line from #6 in Daily Briefing.  Subscribe! https://t.co/dpN2eFqwrS"
"I had a dream I had some Taco Bell, I woke up looking around my room for it 🤦🏾‍♀️"
"Starbucks gives Music City Cares Fund a boost to help Las Vegas shooting victims: https://t.co/QbLSJjTyLM"
"@andrewkwilliam Can I get 4 mcdonalds hashbrowns coffee two creams please"
"RT @MariaBartiromo: Coming up @MorningsMaria @FoxBusiness @kfc #HappyHalloween @dagenmcdowell @LBellCFRA @FreemanWSJ @cherylcasone https://…"
"I liked a @YouTube video https://t.co/DD10ZIoxC7 FIRST TIME TO CULVERS"
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"RT @TTUGoldenEagles: Join us for \"Biscuits &amp; Basketball\" on Saturday, October 21, 2017! Free Chick-Fil-A biscuits and an inside look int… "
"Fine. Hire some fact checkers. Start with @FoxNews and we'll go from there. 😊 https://t.co/VDN870Kg6F"
"I finally realized that the reason I never have makeup on the end of my nose after classes is Starbucks lids🤦🏻‍♀️"
"RT @thewritingj: @ColeLedford11 @BurgerKing @Wendys PROMOTED BY BURGER KING. I AM DYING. https://t.co/4bBI0nFvpY"
"WHERE ARE THE SPICY NUGGETS. https://t.co/7MOFWJoYHe"
"RT @meechonmars: BRING BACK MY BELOVED SPICY NUGGETS @Wendys"
"RT @Jacob_Pinecone: McDonalds in Japan Vs McDonalds everywhere else. https://t.co/HSpBK2ZBXE"
"Another sign of cultural decline: Taco Bell is offering a clothing line. What? PJs under a flak jacket (soft-n-crunchy)? Adult diapers? #fb"
"Yeah this needed to happen for sure https://t.co/sVCILZK3r8"
"RT @VictorLee: Another sign of cultural decline: Taco Bell is offering a clothing line. What? PJs under a flak jacket (soft-n-crunchy)? Adu…"
"RT @mrmedina: Dominos &gt; Papa Johns, Pizza Hut, Little Caesars\n\nGlad we settled that."
"RT @RedNationRising: Democracy Alliance was created in 2005 by a handful of major donors, including billionaire financier George Soros a… "
