"Picked up something like that in south America once😩💩 glad I could write a script for a paragoric elixer. https://t.co/YLluMegKLh"
"why is no one talking about this legendary battle https://t.co/dJsPFNbDEI"
"I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/yV7l94uHsu"
"1 Week Away! This is a free event for Principals, Teachers &amp; Counselors! Starbucks coffee &amp; finger foods! Giving aw… https://t.co/8pBcvqubQN"
"RT @alxaesa: TEXAS has Khalid\nTEXAS has Beyoncé\nTEXAS has Blue Bonnets\nTEXAS has Pluckers\nTEXAS has Selena Gomez\nTEXAS has Daisy… "
"RT @northsidecal: When the employee says “you’re welcome” instead of “my pleasure”. https://t.co/Yh6PLpFJvf"
"RT @CauseWereTexas: Whataburger https://t.co/h3JB1QvQOv"
"Brunch https://t.co/JqDqKzjLIe"
"RT @JPII_belles: Mark your calendars! Our Chipotle Give Back Night is Wed Oct 11 from 5-9. Show this flyer and Belles will receive 5… "
"RT @_AyaPapaya_: whatacharm https://t.co/lpQilyKXE3"
"Can't forget whataburger https://t.co/zmGgRgP1e8"
"RT @stearman_joey: Whataburger https://t.co/UpueRW8Dv5"
"RT @MarkCarey232: I'm waiting in the whataburger drive thru and some guy really just tried getting in my car. I looked at him like https://…"
"@StrikeVixen i havent been to kfc in so long damn"
"RT @JZientz: Taco Bell https://t.co/icL9N6jYm7"
"I’m craving Chick-fil-A soooo bad 😩😩😩"
"When your friend lets you eat some of their HBCB @Whataburger https://t.co/yFGGw7Wmsn"
"500 calories has never been more worth it 😋 #pumpkinscone #starbucks… https://t.co/25r5bQf7y5"
"Okay, but who wants to take me to taco bell?????????"
"Whataburger sells out of James Avery charm hours after release https://t.co/TFn22Z8RTm"
"RT @fox7austin: James Avery creates Whataburger charm for sale https://t.co/XuAFHDUrPC https://t.co/fdSnxZjOXS"
"RT @alibaty23: whataburger https://t.co/vM1nJ4GJvW"
"RT @jimpjorps: at Taco Bell; woman ahead of me is trying to order a “chocobo supreme” and will not work with the cashier to figure out what…"
"Take out 1,4, and 5 ill be good https://t.co/TJQh2VzKny"
"6.Cody https://t.co/Dt9O05EJcq"
"If homeboys coming through with like McDonald's it's quiet.. but if he comes through with some Taco Bell homeboys gonna like.. get it"
"This. Is. Magical. https://t.co/ZdK8BHVyw2"
"This movement has my support! https://t.co/GPtdc2APae"
"Dunkin' Donuts?? What white person tweeted this from your account https://t.co/Tbt85Ve8LH"
"One of these days @Starbucks is going to follow me and my life will be complete"
"RT @antoniodelotero: there is nothing more satisfying than seeing racists get what racists deserve https://t.co/NTcgEGTCtS"
"RT @nowthisnews: Passengers forcibly removed this man from the subway for repeatedly screaming the n-word https://t.co/GNoF0uIgCA"
"Uh bets believe I’m gonna cop that https://t.co/5a25pm9AOQ"
"@SpookyyPanda It’s time for you to grow up and leave Taco Bell behind"
"RT @zackfox: Bro pulled up on a Sunday we've all been there https://t.co/9Bm8inKifl"
"RT @ColeLedford11: So @Wendys just stopped selling their spicy chicken nuggets and honestly 2017 is officially even worse than 2016 💔"
"Blocked. https://t.co/Iwp4AClK6c"
"People if you don’t want to get wet or get your car wet please I insist don’t come through drive thru at Whataburger. 🙄😒"
"RT @awid__: @Wendys why did you get rid of spicy nuggets? I am heartbroken."
"RT @EmiraLynsay: A Racist Just Shouted The N-word On The Subway And Immediately Got What He Deserves https://t.co/Brj0vzX69o https://t.co/B…"
"@Qlovesblink182 I need any negative references to taco bell lol"
"RT @b_ettymoreno: yall still trynna argue in-n-out being better??? LMAAAO https://t.co/CXcZCmHSG2"
"RT @ParkerMcCollum: Buying this for the gf I don't have. She better love it or I'llbreak up with her. https://t.co/yMI6aja9aV"
"Hell yes we are getting @ChickfilA !!! We moving up @BrianaBakerRD https://t.co/utxE9Xhe44"
"I would totes wear this.😍 @andytheaggie https://t.co/V0cQj53a7m"
"RT @chris_rota: I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/DbMfm95ukI"
"RT @bigtuna___: Whatagift https://t.co/grXoFgHEeD"
"RT @adelinamarie7: @freedom_loverr What is next Is me bringing u chick-fil-a rn"
"RT @ksatnews: Whataburger, James Avery join forces for one-of-a-kind Whataburger charm https://t.co/78rCr4sqFw #KSATnews https://t.co/HyqLS…"
"🤘🏾I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/7oKw6SSfYY"
"RT @r__rodriguez: Need https://t.co/L2x3PH1326"
"RT @yagirlemjan: @adelinamarie7 @freedom_loverr bring me chick-fil-a too plz"
"Stopped at Starbucks this morning and right away realized why I never stop at Starbucks lol"
"RT @MiiToons: Mulan didn’t deserve any of this. \n\nHope y’all  enjoy this piece I came up with in the midst of all the chaos!… "
"Okay, so while I was in Alaska the \"4 for $4\" was \"4 for $6\" at @Wendys \nI was thoroughly SHOOK."
"I never thought the day would come but I think I'm finally tired of taco bell"
"RT @MadisonBourque: Go treat yourself Friday and support a great cause by buying cookies @ Chick-fil-a in Nac!! #sfazta 💕👑 https://t.co/9Rm…"
"It’s acceptable to get Starbucks and Chick Fil A after a good workout right ? 😅😅"
"Thank you Ms. Quinones &amp; our EKIS volunteers for making us these large posters for our chipotle event to hang aroun… https://t.co/PXpdyCFA4I"
"RT @teddyjvanity: Thought I had juice when the Starbucks girl said she knew who I was. That changed when she gave me a cup with the name “P…"
"Wya bae? After this we getting whata https://t.co/MSAI0R82lR"
"Can the Starbucks line at UC move any slower????"
"RT @_katbarr_: i know you didn’t just forget whataburger https://t.co/BZYqxD15Dz"
"RT @MBMBAM_LASTQ: Do you think the KFC in heaven will have a bigger menu? (Ep 300)"
"RT @RichieIsEvol: @Wendys why...? Spicy nuggets....... RIP 🙏😔"
"Only 1 of these things is good for you https://t.co/FbrZeR0mHf"
"this vanilla bean shit from starbucks so good 🙄 i’m addicted"
"RT @simple_irvin: Whataburger over this trash anyday https://t.co/XZ4QduVis1"
"RT @HoodJesusYo: Live by the 5 C’s and you’ll be alright:\n\n1. Christ \n2. Coffee \n3. Chick-Fil-A \n4. Chipotle \n5. Canes"
"** el agave https://t.co/PgxFmyxgEi"
"RT @nieto_kayla123: You forgot that \nTEXAS has Selena Quintanilla \nTEXAS has Travis Scott\nTEXAS has George Strait \nTEXAS has whataburge… "
"RT @McDonalds: You spoke. We’ve listened. Lots more #SzechuanSauce and locations. Details soon. And that’s the wayyy the news goes! https:/…"
"\"The fans of Rick and Morty don't understand the way commercialism stepped in to cash in on nihilism\" https://t.co/24Skur6Dz4"
"If you really love me you’d buy me a Whataburger charm from James Avery for Christmas #hint"
"RT @Arbys: Sit boy! https://t.co/rwUIkYZ9bF"
"RT @JeremyTrojacek: Honored to be the owner/operator of Chick-fil-A Red Oak projected to open in April 2017!  #blessed#faith https://t.co/L…"
"Shout out to the people on the train. You're doing amazing sweeties. https://t.co/w9BZRrHch3"
"RT @Onesimom12: Chick-fil-a service is unmatched https://t.co/zhzoYGYwtp"
"RT @sluttysunflower: now this is a group assignment i can get behind https://t.co/IJYmrHl35N"
"Chili is a date! Applebees is a date! Whataburger is a date! Torchys tacos is a date! Where ever you wanna take me is a date! Im grateful💞"
"@zee_getsbuckets I got you https://t.co/4E1AX8Z8Cb"
"RT @LexTesha: NYC Subway In The 80s Was Called 'Hell On Wheels' And These Pictures Are Telling Why https://t.co/t29X3MoFkI"
"Rip to pizza nights with the old roomy 😪😭 https://t.co/8KNARApa58"
"Chick-fil-a is giving free meals to military members from 5-8 today, life is good😌"
"RT @EhJovan: that wrist flick when she threw her soup 😍 https://t.co/OQ7kdmZ5um"
"me: shit i'm never gonna eat all this food\n\ntaco bell: okay, that'll be 6 dollars\n\nme: fuck I should've gotten more food"
"signed up for cycle class tonight, class got cancelled, to Chick-fil-A I go"
"This was tweeted by some chick in sigma beta apple pie https://t.co/BU5fsZpczp"
"RT @Mechopara: @Arbys It seems as if fast food has come to realize anime is popular. https://t.co/I6WrqB6GWK"
"RT @_bluegangsta: this is the most texan thing and i’m all for it https://t.co/bAvsdlwG22"
"Want to work at Starbucks? We're #hiring in #Huntsville, TX! Click for details: https://t.co/afpH2YpxF1 #CustomerService #Job #Jobs"
"Join the Starbucks team! See our latest #job opening here: https://t.co/oxSqZrRRWm #CustomerService #SanAntonio, TX #Hiring #CareerArc"
"RT @transgirlsonic: you guys have no schezwan sauce? no- i want schezwan sauce! \nwhere's! my! schezwan! sauce! im PICKLE RICKKKKK, WUBB… "
"@dominos Pineapple pizza lovers to the direction the pineapple pizza is"
"@russdiemon What I say to myself in disappointment when I drive to  Chick-fil-A on a Sunday forgetting it's closed 😥"
"RT @heyoshane: ryland: shane did you eat an entire bag of taco bell again\nshane: https://t.co/EBqQ2WwwPa"
"These @starbucks employees are with our girls at Trimble Tech HS this evening, sharing interview and career advice.… https://t.co/xMPoJaORIA"
"All I see Texas state student drink is Starbucks. Starbucks isn’t even that great. Why not make your own damn coffee"
"RT @American1765: @snowconejustice @Bose @budweiserusa @Barclays @Bridgestone @Campbells @Castrol @COVERGIRL @DairyMgmtInc @Dannon… "
"The end https://t.co/3dXZQJ1lfp"
"@dwilks81 I’m off at whataburger lol"
"I still don't understand this hand drawn sign at a McDonalds in Odaiba. https://t.co/F6m6vfoPgW"
"Hillarys' been conditioned to ignore accusations after 4 decades with her perverted husband.. https://t.co/wQqdDg9a8l"
"Trimble Tech HS students were mentored by @starbucks employees from around DFW. #careers #starbucks @FortWorth_ISD… https://t.co/TSRwP58zXO"
"it went down in that mcdonalds drive thru... and I was loving it!"
"Come support 1520 THIS Thursday by mentioning our name at Chipotle! https://t.co/OgyMTTCui3"
"My dog is so extra, I gave him some leftovers from chipotle and picked at everything BUT the lettuce 🙄😂"
"RT @CataldiBrandon: I really want some whataburger rn 🤤"
"whataburger is the mf best place to eat I swear 😍😍🤤🤤"
"RT @aardvarkwizard: I hope mcdonalds employees stole all the Szechuan sauce and are ebaying it for what they make in two weeks at work"
"RT @BaillieMcgown: I NEED THE TEXAS WHATABURGER CHARM😍😍"
"Chipotle for dinner!!! https://t.co/p38fOvjhDt"
"even when me and becca aren’t eating taco bell together, we are"
"RT @perez_zeke: @Whataburger @Lamont2g It's definitely what the people want. 👨🏽‍⚖️"
"RT @espn: It doesn't get much better than this!\n\nVote for the winner of this week's @Wendys #RivalryBeef matchup below:   https://t.co/BcXe…"
"RT @Lamont2g: @Whataburger Time to implement 24 hour breakfast. #24HourWhataburgerBreakfast"
"Step 1: Don't be a little bitch and go for the Triple cheeseburger https://t.co/XoT1LHqjFU"
"@Lamont2g @Whataburger Jack in the box  offers that"
"Social media tips from @starbucks employees. Plan for your career. Be smart about what you post."
"my friends really trying to get me this since I eat it everyday smh https://t.co/lu50ezI967"
"RT @roach_nigga: nigga lining look like the pizza hut logo https://t.co/j1QVpZYWu7"
"@stephsalzler Well when I get them at chipotle I just kind of rip pieces off and eat them 🤷🏻‍♀️"
"Enjoying McTeacher night at McDonalds. @duryeaschool  @McDonalds https://t.co/HWlDNpi4EB"
"RT @hannarox365: \"promoted by burger king\" man i love 2017 twitter. https://t.co/ymjZabyBww"
"RT @SkylaLePoris: 50% off fall flavors at Starbucks from October 10th-13th. RT to bless a basic☕️"
"Girlfriend: I wonder if he’s thinking about another girl?\n \nMe: I wonder how many Burger King Nuggets it’ll take to fill a hot tub?"
"RT @vlonemonique: whataburger’s #13 will always b the goat"
"RT @AlphaOmegaSin: Finally had In-n-out Burger, doesn't have shit on Whataburger\nNot bad but not as amazing as people said it was"
"Taco Bell https://t.co/2Vd8Pd9AoU"
"RT @amiiirraaaa: When she threw the soup! We love talent! https://t.co/5P4VcCF5oS"
"RT @Whataburger: Introducing the Chorizo Burger with chorizo, 2 beef patties, 2 slices of Monterey Jack cheese, fire-roasted veggies… "
"#Dead promoted by Burger King 😂😂😂 they so petty https://t.co/WW3qpue33T"
"I've gotten a large coffee everyday at Jack in the Box just so this cashier can ask for my number and it hasn't happened yet 🙄"
"Some dude in my class just gave me 7 jack in the box tacos, we're friends now I think"
"@Whataburger @Ruthonkulous Honey butter chicken biscuit is life"
"RT @UncleGoodAdvice: This is the most positive story that you will read today. #NYC #subway riders kick racist man off L train https://t.co…"
"RT @Chicago_Styles: So I went to @Whataburger  and I just had to rap my order cuz I was mad hungry!! https://t.co/1AAwL2wa6h"
"RT @Tzonick: Why even call it a burger https://t.co/ZXkkC10Slr"
"RT @chelseaLynn2310: Starbucks and wing stop sound good right now"
"RT @kirstin_1120: @Whataburger needs wifi &amp; breakfast all day"
"RT @ps4andchill: bae: why tf pizza hut keep texting you \nme: https://t.co/7upSqUqkl1"
"I just wanna know how you leave out Whataburger lol https://t.co/n92woAI3l1"
"RT @astros_dude: You probably think In-N-Out is better than Whataburger too, you damn commie! https://t.co/41EdawyfVG"
"Home is where whataburger is."
"I'm at Starbucks in Richardson, TX https://t.co/VTF8ldvd7s"
"@awid__ @BurgerKing @Wendys @Wendys got rid of spicy nuggets? WTF, WHYYYY? I do still love @Wendys though Bc they s… https://t.co/0hsszUsOmx"
"PSA Tarleton: Undercover cop off Washington right before McDonalds fuckin don’t speed or do anything stupid"
"You real if you meet me at Starbucks"
"@bearkatsteve I'm not so much worried about their bad take on Shipley as I am about their praise for Krispy Kreme b… https://t.co/AzunjRCDc7"
"@aaronberry723 @Wendys @kris23db Don’t mention me in this weak shit lmao"
"@GetmulaGilbert @Wendys &amp; you still can't read. Smh"
"Does WENDYS"
"@g_skweres when they start saying McDonalds is better than Whataburger, I'm out."
"@Jdaimler5 Krispy Kreme sucks"
"RT @moegabrielle: dont check my social media for life updates. might tweet niggas aint shit and'll be referring to the mcdonalds worker tha…"
"RT @lizzieabruzzese: someone please https://t.co/HdyFOJKWa7"
"*breathes heavily* https://t.co/uxT4uFOF6z"
"BRING THEM BACK AND KEEP THEM ON THE VALUE MENU😉 https://t.co/22ez1fdmv1"
"7/11 taquitos &gt;&gt;&gt;&gt;&gt;&gt; Anything from Taco Bell\n\nDO. NOT. @ ME."
"@alexshay1 watch \"Texans Try Chipotle Queso\" on YT"
"RT @SanAntonioZoo: New at @Whataburger Zoo Boo! Professor Pepper performs all kinds of science-based magic during the Mad Science Magi… "
"RT @autumnnmarieee_: been craving whataburger for the longest🤕🤕"
"RT @MollyyBrynn: That's because I can get 10 chicken nuggets at Burger King for $1 and a salad cost me $10 https://t.co/YBzqIzzLSv"
"RT @PopsicleJokez: Thanks a lot Taco Bell https://t.co/mbWObd5fFF"
"@Starbucks Any chance at a Wassail drink during the Holidays?"
"Burger King really petty asf for promoting this lmao https://t.co/hnOlgRBTiE"
"@Wendys Why @BurgerKing out here trying to bring you down sis?!! https://t.co/GrVAcPTlJe"
"What the hell is wrong with Texans players man.. these dudes saying Krispy Kreme &gt; Shipley and another who doesn't believe in dinosaurs"
"@blackshirts57 @Wendys I freaking love you!"
"@Cont451Miguel @jwoot32 My lil baby might love whataburger more than me if we're being honest 😂"
"RT @jacee_plunk: How about an FFA emblem? https://t.co/aKlV1MAZCn"
"RT @Texas_4Ever: I literally don't trust a soul that likes Krispy Kreme over Shipleys. https://t.co/R6HeUr3bE4"
"Rule #1 of Queso: Texas-based market testing a must for a national chain. #GetItRight https://t.co/jJk0uGc1mF"
"@Jarrett_Medders @Wendys Well at least Texas can beat Iowa State😂 OU SUCKS!"
"@MikesMMAPicks Kfc barstool earned a follow. That dude is cold...."
"RT @bakbakbakkerr: mommy and daddy bought his ford f150 but he bought the rollpan and 2% tint - hangs out at the Eagle River Taco Bell… "
"@McDonalds your attempt at pleasing Rick and Morty fans did nothing more than make us worse, Pickle Rick will avenge us."
"RT @YourFavoriteZoe: Bring back spicy nuggets @Wendys"
"Check out Starbucks Espresso 3 Oz Demi Cup Mug Spring Watercolor White Red Purple 2016 New  https://t.co/lfBJ6NCSId via @eBay"
"Men: \"I'll never understand what woman want\"\nMe: \"I want loyalty, quality time, a puppy and chipotle\"\nMe: \"a mystery never to be solved\""
"In a year that has seen nothing but bad news @Whataburger may be coming in clutch #fingerscrossed https://t.co/feW3a6RPyR"
"@netw3rk Don’t think @netw3rk will appreciate the Porg - KFC tie-in much. They look kinda Chic-fil-a sized? Burger King Porg nuggets?"
"THIS is what I call Americans coming together ❤️ https://t.co/Ta4I4MxGTZ"
"@helloNOMAHAWK is giving away 10 Starbucks vouchers, and I am in! #nomahawk #giveaway https://t.co/rgQeNyoy4D"
"Starbucks playing Suavemente has me enjoying this bone marrow aspiration assignment even more 🙂🙂🙂"
"RT @Tyler_Grigsby: Whataburger https://t.co/19CvkFqXqX"
"#fastfoodbroadway In-N-Out On the Town Burger"
"RT @AstrosCounty: That’s fine because *Shipley* is better than Krispy Kreme https://t.co/cTpGfguBK7"
"RT @Wendys: Please\nThey eat us now, they eat us later\nAdding up our Wins on a calculator\n\nYou're a laughless clown, or a king t… "
"My friend's son photo shoot @Whataburger 🍔 🍟 #whataburger #ifyouwannaafrenchfry #cutebaby #HoustonStrong https://t.co/B3OBfYyjIe"
"Vanessa came clutch with Starbucks 🌬🍦☕️👅"
"I already told you! Green tea frappe is the way to go https://t.co/0qymi4gyJR"
"RT @loveuzumaki: I feel like I’m the only Texan who doesn’t love whataburger this much https://t.co/GA0Xtp1Ltl"
"RT @SanOGram: Really only want 7 million dollars and a chipotle bowl , honestly .....🤷🏾‍♂️ https://t.co/yH3BaZe2pj"
"RT @The_Crackulator: Whataburger https://t.co/7e4JwW1LBo"
"When you're a broke college student, but also....Starbucks #uttyler https://t.co/fb3GD1sof5"
"RT @itsLuceero_12: I want Starbucks 😭"
"RT @okayaleexa: wrong https://t.co/yGgQa1FPeX"
"I'm so mad ain't no Starbucks here 🤦🏼‍♀️"
"RT @youth_gateway: We are flying over to @Whataburger after church this week! Who you bringing? #4twelve #whataburger #flying https://t.co/…"
"what do you want for Christmas?😍😍 https://t.co/ktSOGvDVsj"
"@Wendys and to think we share names 😤 #RIP #SPICYCN"
"@MzMoe204 Haha. Getting you some Whataburger! It's good for the soul"
"Hey @SUBWAY I just ate a sub from you guys you think you can sponsor me? I'm good for it I swear."
"RT @sorcierebaby: TEXAS has Selena Quintanilla period . \nWE WIN https://t.co/cMTci5smqv"
"All the #Halloween delights are here! (@ Dunkin' Donuts/Baskin-Robbins in Euless, TX) https://t.co/XnVJgCqA9o https://t.co/yWuWpLPG0W"
"RT @itsZACJENKINS: him: get out of my house. we are done\n\nme: *leaves*\n\nhim: *calls 4mins later* babe im sorry where u at\n\nme: https://t.co…"
"RT @lovelyanjanette: currently craving a milkshake from whataburger with some fries"
"@Jared_M51 You can't buy ass at Starbucks jared"
"@BurgerKing, trying to get people to fight @Wendys for you?! https://t.co/PCz6FlJq3Y"
"@SHPawdcast Oh and Krispy Kreme donuts are trash.   Would rather eat a dunkin donut."
"@espn @Wendys Sooners are gonna kill the Horns....Horns are kinda like Michigan....Good defense but the offense is horrible"
"Just ate Taco Bell.... so good #tacobell #livemas https://t.co/0Aukh8JXl7"
"Me singing Gardens like I'm not at CC in front of Starbucks with 30 people around me https://t.co/uJwSFosgzQ"
"@StrosBros1 @HoustonTexans Fuck a Krispy Kreme donut!!! They can take their donuts back up north!!!"
"I stole these flowers from a jack in the box drive-thru. https://t.co/pvAo0XrL9i"
"the iced pumpkin spice latte from starbucks has been the only thing keeping me awake lately:,)"
"RT @Aynsley_Broom: @YourFavoriteZoe @BurgerKing @Wendys I love food Twitter accounts👏🏽👏🏽 #Foodiechats https://t.co/PbJInpx346"
"i want some whataburger"
"RT @EricDanielll_: Ya MCM would buy this for u and take u to Whataburger afterwards to celebrate it's me I'm ur MCM https://t.co/Cg5n7hz5yu"
"RT @KaylarWill: Mcdonalds sprite will wake up a dead person https://t.co/8dJTeUqUG6"
"I didn’t know Baskin Robins was still open"
"RT @ChanceBratton20: oh me too! https://t.co/2YvYpRS1Jr"
"Got @Whataburger bbq #sauce on me britches https://t.co/z5fd0Hg4kr"
"RT @ElkinsHSCheer: Knights, tonight is our spirit night @ Chipotle! Grab dinner there &amp; tell the checkout person that you're there for Elki…"
". We went to Corpus and I finally ate in the two story Whataburger but this man was playing w my food and I don't p… https://t.co/4b8poVAarg"
"@Jimenez15MOG got me craving chipotle every time I watch his story"
"Free Halloween Doughnut at Krispy Kreme on 10/11 for When you Download their App via /r/freebies https://t.co/lSX54Wqfm4"
"Not the noodles https://t.co/pYzCin32ig"
"RT @KennyBounce: This kind of pizza https://t.co/BiGLeSEkCt"
"i love this song https://t.co/oukKvs3TGa"
"RT @kfc: “Would you like to be playable in the WWE 2K18 video game?” they said. “As long as my physique is 100% accurate,” s… "
"“That’s assault “\nI ain’t gone assault you. Imma kill you. https://t.co/PmfAduijOG"
"@marinabobeanaaa Sounds like the amount of corns I get at chipotle"
"RT @ultncts: omg there’s me.... feeling famous https://t.co/TdfAcNMhx1"
"RT @SimplyYR: I don't think #OGJason is talking about Starbucks, lol #GH https://t.co/rCnWtK5W8z"
"I love the whole ambiance of Starbucks."
"@arg82901 @Whataburger That sounds awful"
"RT @zmirich: When I was 13, I had my first love.\nTherewasnobodythatcomparedtomybabyAndnobodycamebetweenusorcouldevercomeABOVE. S… "
"I love Houston and everything about our culture...... But Krispy Kreme is absolutely better than Shipley's. It's not even close."
"RT @anaxb_: TEXAS HAS WHATABURGER WE WIN https://t.co/tuK1vOt9vQ"
"RT @casssandra_19: i want some whataburger"
"RT @MindOfPryze: Shawty dumped her Au Bon Pain Mac &amp; Cheese on him 😂😂😂😂 https://t.co/AkwPae9ve2"
"@badkaratemovie It's across from the new Starbucks on NW HWY"
"Satisfying. https://t.co/1WGyHZYuQ4"
"🙌 YASSS It's time for #liveme's show krystal😜😜😜 : https://t.co/x5Kug8cG7K https://t.co/QWRafCN8mC"
"@hollygibson46 u need this https://t.co/Y2di9agkWg"
"RT @Braveheart_USA: Government owned aircraft use is being scrutinized, so @NancyPelosi flights will all be reviewed? \n@realDonaldTrump… "
"RT @AllyBrooke: Hahahhahaa. Omg. This photo is so old!! Major throwbaaaack 2014 I think? This caption is everything 😂😂😂 https://t.co/MADVqg…"
"Yes, that’s a burger patty between two Krispy Kreme donuts. And yes, I did hate myself after… https://t.co/xbAGB3CRdv"
"RT @oraltwjnk: YASSS LADY WITH THE SOUP GO BEST FRIEND THAT’S MY BEST FRIEND https://t.co/lnxF22xPpQ"
"If you look up \"cruel joke\" in the dictionary, you'll see a picture of my gym and its painfully small distance from a @Whataburger."
"Creating a Robotic (Haunted) Jack in the Box for Halloween https://t.co/Xx1vwjLC4e #futuretech"
"@ChuckCollier76 @jeff_gringo @Dekedee @lindaxxxx51 @mzlott68 I prefer Subway...."
"I wish dominos let you order 3 slices of pizza and that’s it ion be tryna have to pay $16 smh"
"I have a serious addiction to chipotle."
"Glad you said it https://t.co/6JpVmD6Ydi"
"you thought i was done with my demands? nope! 9th demand: make @Wendys bring back those sandwiches with the pretzel buns. I'M DEADLY SERIOUS"
"@roqchams Try the new chorizo burger at Whataburger it's good"
"I love communities and teamwork https://t.co/SuVJsjcBzA"
"@tr8ss McDonalds on University!!"
"I liked a @YouTube video https://t.co/HAOUeIThBd Caillou hijacks the Car/Crashes into McDonalds/Grounded"
"21+ Starbucks copycat recipes https://t.co/0y3z2a6q16"
"yeah sex is cool but have yall ever gotten a $4 for 4 and a frosty at wendys"
"When burnt out, I always just scoop Whataburger"
"This why I live 20 ft from Whataburger"
"Yes!! Why!! https://t.co/TslOiPsroT"
"RT @cumonejay: Girls talking bout \"mcdonalds unhealthy\" bitch so is yo relationship mcstupid ass 🤣"
"RT @meechonmars: @Wendys .@Wendys I just wanna say.... Yall better get it together before another company does.… "
"I really want an iced pumpkin spice latte from Starbucks💛"
"RT @Brii__14: I’m just trying to go get some Starbucks"
"The one time my mom gets Panera bread I can't taste it bc I'm sick 🙄"
"RT @mayrragarrcia: Craving Tacos and Whataburger 🙄"
"The fact that burger king promoted this tweet 😂😂 https://t.co/0mq74W5VB6"
"RT @ssentience: RT to win a $10 Starbucks gift card ☕️\n• must be following me and @glowradiant 💫 https://t.co/uQnvo3fiBv"
"Same here lol https://t.co/dTVDQCwp8t"
"RT @KlausBromi: Nerds getting rewarded for becoming dumb, angry mobs has been a terrible trend over the last few years. https://t.co/03h8RQ…"
"RT @jaaaay_cool: I miss White Castle. Even though it tore my stomach up every time, it was good af 😩"
"Create your own Whataburger homecoming mum - https://t.co/I1mVUYAvHD"
"@chasity_v27 Bring me some whataburger thx"
"@ItsDiegoG @Whataburger YES! all fake chorizzo haha i want the buffalo chicken strip back :("
"Couldn’t decide which pastry to get...\nStarbucks"
"Ordering #13 with creamy pepper sauce from @Whataburger reminds me so much of @robjimz \nMiss you roomie"
"McDonald's, Chickfila, &amp;' Starbucks with a friend is always good💞"
"Temperature dropped, so Im treating myself with a small chili. Thanks @Wendys for being there like always."
"Jack in the box always hit's the spot ✊"
"Replace chipotle with Caleb https://t.co/5iKLesSFJ5"
"The only C’s I know are\n-complete \n-concise \n-clear  \n😤😤thnx tapia 😤😤 https://t.co/jGtHr6xai7"
"Hey @Starbucks I received horrible customer service at your pearland location off 2234"
"RT @ClutchPointsApp: Marcus Smart's murky future with #Celtics.\n\nhttps://t.co/JPgDLbZO1F"
"Donuts are not very good. Way better breakfasts. Even way better sugary breakfast pastries https://t.co/ObbjcpaqN1"
"RT @TheReal_Shani: Someone tell Bo Deitl he is not selling subway sandwiches this is a debate 😂😂\n#NYCVotes"
"If you go to jack in the box and don't get curly fries you actual trash"
"RT @austinwest10: I've got #Texas to take the W in this week's @Wendys #RivalryBee! Who's got your vote? https://t.co/uqI7DmNAiZ"
"RT @katie_chambers3: hey @Whataburger how many retweets for you to make breakfast available all day??"
"RT @ManorHSPTSA: Upcoming MHS PTSA Meeting scheduled next Tuesday, 10/17 at the Starbucks in Manor 6:30pn-7:30pm..you are invited! https://…"
"Talk shit get hit my dude https://t.co/aFfjsSRH8V"
"I Want Whataburger"
"THIS!!!!! they use to be hitting man https://t.co/JMKpEOm7y2"
"RT @sheehan32: @kmcorder @Dyls13 Sell me on why I should give this sandwich a shot jack in the box?"
"RT @audrynolen_: Replace chipotle with Caleb https://t.co/5iKLesSFJ5"
"RT @nihilist_arbys: It's Columbus Day, so we're gonna sail over to McDonald's, beat the shit out of everyone, wreck the place &amp; call it arb…"
"@andrewmason_w @Whataburger Because it’s lunch Andrew"
"🍃 Starbucks, fall scented candles, Halloween movies, fuzzy socks &amp; cuddles. Nuff said. 🍂🍁"
"Apostrophes: Ruth’s Chris and Carl's Jr. https://t.co/87hHWDNmOf"
"@malorie_hdz @Whataburger I want it to be 24/7 😅"
"If he only wants your breast, legs, and thighs..... send him to KFC- Drake 💯🐓"
"RT @brennan_hosa: ‼️PRE-SALING KRISPY KREME DONUTS AT LUNCH. PICK UP ON 10/12 BEFORE 3RD. $5 FOR HALF A DOZEN‼️"
"@WWEgames @kfc Best Character 10/10"
"NEITHER #WRECKEM https://t.co/wAlHwJRVPq"
"MUST BE NICE https://t.co/e5ykKFGfVM"
"I checked in at Chick-fil-A on #Yelp https://t.co/acmPSSDnlE"
"need to cop: https://t.co/rc6BSxvylN"
"RT @thatsoreyvin: Whataburger https://t.co/mLhZXa3nqi"
"RT @UglyGod: LMFAO HOW IS SHIT NOT VIRAL. WINGSTOP AND WENDY'S HAVING A RAP BATTLE 😂😂😂 https://t.co/C4EusWWMlQ"
"@ms_krystalmarie Nice going Krystal 😂😂🤦🏽‍♂️"
"Every time I go to the Starbucks inside of target, the baristas are so freaking RUDE."
"Getting Starbucks cause it’s been awhile 🙃"
"They stopped like a year ago in my area I feel your pain man. #lostMyBusiness https://t.co/elHyQ5AUfi"
"RT @Esmemoni21: I just want wendys 4 for 4, is that too much to ask for?"
"@VoiceOfTheStar Or the Patty Melt meal from Whataburger"
"To whoever spent $75 on our money at the bridge city Whataburger, thanks a lot."
"Petition for @Whataburger to serve the HBCB between two mini waffles as an option"
"RT @sexorpizza: Haven’t ordered Pizza Hut in a while I wonder if they’re worried about me"
"dressed like I'm going to the gym, actually going to whataburger. absolutely nothing has changed since college"
".@Whataburger needs to make the Chorizo burger a permanent part of the menu!"
"When you just absolutely love Whataburger lmao https://t.co/hDx7AyjTXT"
"@Austinzgilbert  this is what you say🙄 https://t.co/seP2ZN9nPH"
"Who want it https://t.co/pxjq2vY1Tb"
"@alxaesa Texas has Whataburger"
"RT @jenld58: I've got #Texas to take the W in this week's @Wendys #RivalryBee! Who's got your vote? https://t.co/bRztDIzu06"
"I come to the target on ware cause they have a Starbucks inside, so it's like killing two birds with one stone 😂"
"@KennyBounce @Kujawski_ Right? Lemme know what Little Caesars this guy is hitting"
"RT @authenticxa: Legit Edwin was drunk on our wedding night and we went to @Whataburger https://t.co/Xz6tO96ryv"
"i can't believe i wasted my starbucks gift card"
"RT @WWEgames: .@kfc's Colonel Sanders is ready to throw down in #WWE2K18! https://t.co/yWnF6Tpf3i"
"RT @garyfromteenmom: starbucks cashier: whats ur name\nme: what are we"
"Are y’all gonna take that @Wendys ??? https://t.co/Qb0jbFjKqQ"
"I slept on chipotle until today"
"@jas778 I plan on coming to taco bell from now on #fataf"
"RT @joy_lyon: Take out #4 &amp; we’re good to go https://t.co/iF8Pqu9q0a"
"RT @DontCallMeCorey: @BurgerKing @RichieIsEvol @Wendys Your nuggets are nothing compared to Wendy’s nuggets how dare you try and compare"
"RT @_its_not_emily_: This is the most Texas thing I've ever seen https://t.co/Gg0tdGkzP5"
"BWW, Canes, or Subway????!?"
"Instead of Eating Taco Bell I eat El Taco 🌮 or Jalisco's"
"RT @NYDailyNews: The subway bigot who had soup dumped on him for a racist rant on an L train insisted he’s “not that sorry” https://t.co/Cy…"
"RT @BazalduaYudith: I went into whataburger trying to pay with my license🙃"
"Y'all why did Burger King promote this😂😂😂 https://t.co/5Ppl4Hbgb6"
"@Gnaatt_ Burger King is like top 3 best fast food burger smh"
"✖️Subway today. Travel adventures continue✖️ @ New York City Subway - MTA Metro https://t.co/Fz5ODFbKz0"
"Tonight's java and a book... an arc of KILL GAME by Cordelia Kingsbridge with Starbucks veranda… https://t.co/tpnu0b39CS"
"And water is wet. Thank you for your whatawisdom. Never change. https://t.co/r9gGUJ3B7O"
"i cant tell you how many times ive handed my license to the person in the drive thru on accident https://t.co/t9MKBbNwI6"
"2 more hours to join us at WHATABURGER!!!! https://t.co/M5QTPVo5Ds"
"RT @ThyArtIsMemes: 1. Carnifex\n2. Counterparts\n3. Citizen https://t.co/McM2p4Wami"
"RT @TweetLikeAGirI: Taco Bell https://t.co/LQiNOI1KhH"
"Helped a kid find his dog\nKilled work\nShoes got delivered\nGot @Whataburger \nTime for 2k18\n\nToday was a good day!… https://t.co/rrQiwe8jbt"
"RT @Meg_Ann_Yan: “It’s Meghan, with an ‘h’...” #starbucks #fail #misspelled @ Troy, Michigan https://t.co/5RDvHmbMST"
"Explain this @Wendys https://t.co/uVNbk93AHk"
"good https://t.co/MkW8gMF3Yx"
"RT @MagiccLove: the biggest lie eva https://t.co/EJ4gjuh4mD"
"RT @CantonHSChoir: Only 2 more days to fundraise!! All money and brochures due Thursday! The students with the most items sold, the whole c…"
"@Barb_Randolph1 @eissolomon11 @DonnaWR8 @jaketapper @CNN @MSNBC @realDonaldTrump @MichelleObama @HillaryClinton… https://t.co/aV5et3CSUq"
"this makes me so happy https://t.co/xv1TJkvRW8"
"The more colors a meal has, the more nutrients it's packing! We've got our eye on this chipotle steak bowl recipe:… https://t.co/8D86INHud4"
"RT @whscharmers: 2 more hours to join us at WHATABURGER!!!! https://t.co/M5QTPVo5Ds"
"Me at Whataburger at 3 am: https://t.co/78cB9HKg2D"
"It ain't Texan approved. https://t.co/r0FqGqwUdu"
"RT @Los_G: @TilmanJFertitta since you're the new owner can we get Papadeauxs n Whataburger at toyota center?"
"Don’t sleep on them girls that love Starbucks"
"RT @TStar: Don’t sleep on them girls that love Starbucks"
"I honestly love El Taco 🌮 in Plainview way better than Taco Bell"
"RT @_raychelmacera: S/o to the random doc in Starbucks who gave me a motivational talk to hang in there with school and don’t give up. So k…"
"RT @cierramtgh: Basic white girls are shaking https://t.co/EdXqJS2rJt"
"When he brings you Panda Express in bed 😍"
"I want Taco Bell."
"Papa Johns is bottom of the totem pole pizza"
"This 🗑 is in but not Cien Almas, Liv Morgan, Tyler Bate, Pete Dunne, Mustafa Ali, Daivari, Lince Dorado, Tony Nese?… https://t.co/cIfG4MQJtc"
"RT @BurgerKing: @meechonmars @Wendys too late. https://t.co/q2xjvyMGmH"
"Congratulations to our Chick-fil-A players of the week for Heights High School! \n\nOffensive Player: #3 Jalen... https://t.co/LwF99zJOXH"
"Not to brag, but my town just got a Dunkin' Donuts!!"
"@JimB_85 Heck, lobster's so common in Maine, they serve it at McDonalds."
"RT @alesc___: I've had Starbucks for the past two weeks due to @MikaNicole3 and @kimOrrrwhat  🙄💖"
"RT @wideopencountry: It ain't Texan approved. https://t.co/r0FqGqwUdu"
"I want some Starbucks"
"RT @ABRod_17: TEXAS has Z-Ro \nTEXAS has Slim Thug \nTEXAS has Bun B \nTEXAS has Paul Wall \nTEXAS has Lil Keke\nTEXAS has Whataburger https://t…"
"RT @pedropscl: kylo ren is a white dudebro who stans rick and morty and only killed han because han wouldnt take him to mcdonalds to get sz…"
"so today my sister and i went to get canes for my dad and when we were on our way home we saw him so we decided to stop at jack in the box"
"RT @thejohndante: Whataburger https://t.co/i6FfCW9qkq"
"and we got the homeless guy a meal from jack in the box cause we didnt know if he had eaten"
"RT @NavyWifeVirata: Looking for an out of this world adventure? @RoswellNMTrue offers up aliens and the coolest @McDonalds you've ever… "
"It's the time of day, to go to subway and eat by myself 🤷🏻‍♀️🌧"
"@Faithanador10 Jimmy johns?"
"RT @JulienSolomita: when your dad supports you 😍 https://t.co/YCONRR9yXy"
"@Cody6652 @Wendys Win or lose I'm having one of these bad boys https://t.co/EZ2ixbRulm"
"I got whataburger my heart is complete ❤️"
"WHAT IS THIS, MCDONALDS FOR ANTS? https://t.co/xlYV3Hmevp"
"I like going out and eating by myself, I don't know why. That's what I'm about to do, I'm going to get get subway. 🌧☺️"
"RT @Lyric_lgl: I bet Starbucks' sales of Pumpkin Spice Lattes just skyrocketed today with this rapid change in weather. #summoningthewhiteg…"
"Just when I start to have faith in the @HoustonTexans again they stab me in the heart with these Krispy Kreme truthers."
"RT @alxisbrown: what in the hillbilly heehaw red state country line dancing that’s what i like abt texas mess is this https://t.co/kYPMe5Qc…"
"I agree https://t.co/oNfLgNXV6w"
"DM@wendys. Fort Worth , TX"
"I moved to a different city yesterday but I already found their chipotle so everything is going to be okay https://t.co/o2y9nD18RF"
"https://t.co/W4Iw490VVU (at @KFC in Dallas, TX) https://t.co/1QN7ddLl2p https://t.co/VU1LGQPMZW"
"I almost called the mcdonalds I went to an told them their food or drink made me sick"
"Is called brunch https://t.co/LWvd5bzAmF"
"‘DM @Wendys 2926 W 7th Fort Worth, TX 76107"
"im the soup https://t.co/U7Nyqv3Icq"
"@CJNitkowski You can ALMOST get a cup of coffee at Starbucks for that!"
"Wait they don't wtf 😱 https://t.co/mE0zvFdoVJ"
"RT @MarketWatch: Pizza Hut's new delivery pouches use the same materials used in ski jackets and astronaut space blankets https://t.co/gD5R…"
"RT @RickMortyTV: Get to a local McDonalds for a taste of Szechuan sauce, today only.. This is not a drill. https://t.co/3uFtv8Mbbo"
"RT @jonraff: Man grabbed 7000 pussies since 9-11 and everyone acted like they didn’t know/care.. this mentality let @SUBWAY Jared rape mino…"
"@OmarGoshTV @SUBWAY It doesn't look THAT gross! 😂"
"RT @OmarGoshTV: Had a super gross sandwich made at @SUBWAY &amp; ate it. Gave the girl a nice tip for being so nice. Ewwwwww! https://t.co/EMev…"
"RT @hondadeal4vets: Fuck starbucks for serving peepee water https://t.co/FSA8wdg54C"
"RT @karlarteagax: I want some Starbucks"
"RT @lindsey_labrier: Whataburger https://t.co/lQ2VERrfGQ"
"RT @rlx_nxth: @DaviSchilipake @bobbysoxer120 @McDonalds Its a glorified sweet and sour dip for fucks sake"
"Every game! Then we go get Whataburger, his favorite! https://t.co/YKbyIzifHg"
"RT @Kaagesen: I love how extra my state is 😂 https://t.co/sbBj2f2rNx"
"Sorry Tx but #Boomer I've got #Oklahoma to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/ROHCncNkHK"
"WHY WAS MY $5 FOOTLONG FROM SUBWAY $7.57???!!!!!!!!!! FALSE ADVERTISING"
"I'm here at checkers eating a delicious chili dog"
"RT @ocell: \"The Szechuan sauce fiasco proves Rick and Morty fans don’t understand Rick and Morty\" https://t.co/MIOWMlzAqx via @Polygon"
"Do you want free Chick-fil-A for a year?  Of course you do!  Enter our First Freeze contest for a chance to win.… https://t.co/esLuFgexqV"
"RT @TheLifeOfRel: when does taco bell not sound good"
"RT @chanelsface: god i fucking love taco bell"
"I'm so hungry! I can't wait to go to Chipotle in a minute. I ♥️ Chipotle! Why do you think @ElkinsHSCheer spirit ni… https://t.co/0Q34gW0QfN"
"RT @_zolarmoon: Imagine being a teenager in subway waiting to order ur food &amp; a customer pulls a gun on u bcus he &amp; his wife felt \"… "
"@kfc @whiteandfaded Looks like he bout to beat some \"slaves\" for not standing for the anthem"
"RT @FOX4: James Avery creates Whataburger charm for sale https://t.co/JhTkPchrMY https://t.co/FiSOtxRXOz"
"RT @Serrels: Kylo Ren is the perfect villain for our times: a tantrum throwing, know-it-all standing outside McDonalds screaming for Szechu…"
".@BurgerKing promoting this random tweet might just begin the Wendy’s Twitter vs. Burger King Twitter feud I’ve alw… https://t.co/56CJflkMJ1"
"i ain't ever eating taco bell again"
"RT @JayNoHoes: \"Yea lemme get uh number 5 with a large COKE” https://t.co/zJvr3zN7Bj"
"RT @SHAWNHINDRIIX: WILL MCDONALDS PLEASE HIRE THIS NIGGA https://t.co/P7Pp10DwuT"
"RT @eXOlence: New Yorkers, you're doing great sweetie💙 https://t.co/usWM0KbmHZ"
"Only bc I hate OU\nI've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/GsJ11m0JkZ"
"Sooooooo this is happened.. https://t.co/egII9kpvLO"
"THIS IS THE 3RD FLOOR OF EVANS NOT STARBUCKS AT 3 PM"
"RT @soulwhisper2016: I think we all should send in droves some baby rattles , jack in the box, etch a sketches to WH to keep Trump entertai…"
"TEXAS WINS https://t.co/35WSr91rhz"
"Show them tits babe https://t.co/QkVAatIxO5"
"In the fast food world, Chick-fil-A is like that handsome genius friend you'll never catch up with. The ladies, teachers &amp; parents favor him"
"RT @MojoJojo78: To the lady who paid for my @Starbucks order - Thank You! Not for the free coffee but for the #kindness given when I needed…"
"Get you a boyfriend who buys you chipotle and then hides it in a place you can’t reach 🤗"
"RT @RealAlexRubi: Chicago activists hold subway demonstration against planned $95 million police academy https://t.co/MncejT3haa"
"@PlusPollsLead1 @OmarGoshTV @SUBWAY Same so grosss"
"RT @LILBATRI: might fuck around and buy happy meals all month https://t.co/nrW9DrOVpC"
"Who tf is this? https://t.co/yzGmQDfU7s"
"@kenan_garner @kulinacs you guys not doing this at Whataburger is very disappointing. https://t.co/MAVFaThmYL"
"@MyLifeAs__LIZ @maribelsaenztx @Wendys This blowout should be fun to watch😴"
"RT @kevjr9: Krispy Kreme &gt; Shipley’s"
"Posted menu price- $1.94.....actual charge $1.99, guess it's bonus time for the @Whataburger books!  Wonder what el… https://t.co/Ywt3Ty8ypy"
"I told Josh I’d buy Chipotle, if he cleaned the dog kennel."
"@SLBCTexas He should have played it safe and brought KFC. Maybe sweet potatoe pie if he needed something sweet. Enj… https://t.co/GGSyKrFEkJ"
"Does Dairy Queen Count as a Ice Cream 🍦 Shop ?"
"RT @_Moufasa: This is how it feels to drink McDonalds sprite https://t.co/otB3nMTTAt"
"Rick and Morty is great. The Online Fandom, and the idiots lining up at McDonalds for fucking sauce isnt great."
"true https://t.co/Rc8HVkEJWd"
"LMFAOOOOOOOOOOOOOOO https://t.co/b9GFXd6hVG"
"Need to call the 2nd number for Brayden’s chick-fil-a addiction. @AwbreyBrayden https://t.co/VK8QcBzwY2"
"@Saabreezy_ @McDonalds can’t believe y’all are still doing this, tell him to dm if he wants to beat the base it’s light work"
"@katarmstrong1 Literally crying in a Starbucks. I can’t even."
"I want a Cherry Cheesecake Blizzard From Dairy Queen !!"
"RT @DDB_Lawrence: delete this https://t.co/Qbt3yIKL5X"
"My parents first visit to Frisco and had their first taste of @Whataburger and had to have it for both lunch and dinner today they are in ❤️"
"Someone gift me a pizza hut egift card. Thx friends https://t.co/6yGyZhvybj"
"Love @Krystal like us? Text code ‘SDS’ to ‘37793’ and you'll get two free Krystals and a coke."
"All Day 🤘🏽 I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/nepwDMln0C"
"\"I'd rather have KFC\" - @jenaasheriee  not going to say compared to what but you can go ahead and guess #smh"
"@kenziebug21 @Wendys -mer Sooner!"
"LOL what do you mean attempt https://t.co/nFZcq7vapZ"
"Me: planning vacations and a new wardrobe.\nAlso me: finds $10 and goes to Chick-fil-A"
"RT @bhasik3: I have a serious addiction to chipotle."
"Puppies love whataburger too @ La Grange, Texas https://t.co/xDu0LdWof6"
"@thatkidjose27 @Wendys Bro you’re tripping lmao"
"dear anyone whos ever worked at chipotle: i have a burning question. at the end of the night, are u allowed to take home a bowl of leftovers"
"RT @amber_garcia98: Whataburger https://t.co/JTjDYqKcxz"
"\"I went to NYU LAW!!!\" Says the angry white racist man 😂 https://t.co/Y079vHewF8"
"Just posted a photo @ Sonic Drive-In https://t.co/w8BWdjDtQH"
"I've never been to Panda Express"
"Hey @torchystacos, step up...\nhttps://t.co/33fWI2GAP2"
"RT @GaGilbert23: I've never been to Panda Express"
"@CarlsJr @amazon Are y’all realizing that y’all food sucks? And that’s why y’all are begging to be bought out?… https://t.co/sGaM6xScob"
"Shoutout to ashley for buying me Taco Bell today 💖U DA REAL MVP👌🏽👌🏽👌🏽😩😩"
"RT @broke_mexican: Throw that soup sis! &amp; btw drunk words are sober thoughts for anyone saying \"but he was drunk!\" https://t.co/fcTpy98STT"
"RT @lauferlaw: Keep enough KFC around so he goes for the chicken instead? https://t.co/Jz4YW8cDva"
"@rubiom Damn! Lol Oh well! 🚗 💨 it looks soooo good!!! I couldn’t drive Saturday so we ordered Pizza Hut 😤🤦🏽‍♀️😒👎🏽👎🏽👎🏽"
"RT @NISDJaySEA: Chick-fil-a calf at #NNO! https://t.co/d2dpw6FTxv"
"RT @Iron_Spike: I made a friend in the subway. :V This is Matthew Christian! (Don't worry, I asked if I could film him, first.) https://t.c…"
"I want whataburger 😭😭"
"@NICKFRESH @Whataburger But you got it during lunch??"
"RT @xoxsaraiii: idc i want it https://t.co/0MFM8fnQYF"
"TEXAS also got Chamillionaire, Mike Watts, Post Malone, THE REAL SELENA, Whataburger, Buc-ee’s, Blue Bell, SXSW, AC… https://t.co/awRprLWTfZ"
"RT @all_in_yo_girl: Imagine bein a black person in subway ordering ur food &amp; a customer pulls a gun on u bcus he &amp; his wife felt nervous ht…"
"RT @RedbirdMenace: Rick and Morty fans are behind the times; Bojack Horseman fans have been lining up at McDonalds to get depression for ye…"
"Homeless Man Sobs In Burger King But Doesn't Know His Photo Is On Facebook https://t.co/W8TZNxzxkd https://t.co/svQjthpWa0"
"Dove &amp;; Chick-fil-A just gon have to call me “Nigger” to my face😬🤷🏽‍♂️"
"RT @MrBrowntown956: @alxaes This post could have been 1000 times better if you mentioned Whataburger, put the correct Selena, removed Daisy…"
"My goal in life is to meet up with @SelenaGiancola and just spend a day getting starbucks and roasting people. Sounds like a day in heaven"
"I always make a mess eating chipotle"
"RT @CiCiAdams_: Bring back Orange Hi-C, @McDonalds"
"Krispy Kreme donuts are harder than your first name https://t.co/eJpyybhF4K"
"RT @philvolcy: @BurgerKing @snedegascar @Dustin__barnett @giselle_sancen @awid__ @Wendys 😂😭Who is running that Burger King page? https://t.…"
"@Wendys no one wants chicken tenders we want spicy nuggets back"
"RT @DJHooligan109: @soccerreform @LillyAnnFraizer @McDonalds I wonder how much Grimace would bring in the transfer market. https://t.co/iLx…"
"RT @DesireyMunoz: I need one lmao https://t.co/gBuu1y6dpf"
"You spelled chiloso and chicken express wrong https://t.co/SSWCtT0J5K"
"RT @ohmyyymanda: 🍃 Starbucks, fall scented candles, Halloween movies, fuzzy socks &amp; cuddles. Nuff said. 🍂🍁"
"Craving 2 honey butter chicken biscuits and a chocolate shake from Whataburger 🤤"
"RT @_cmervin: Krispy Kreme donuts are harder than your first name https://t.co/eJpyybhF4K"
"I mean not that it's any of my business or anything, but next time you go to Starbucks order a hot caramel macchiato and thank me later"
"Got high and experimented, fried chicken patties, cheese, lettuce, tomatoes, pickles, sautéed onions and chipotle r… https://t.co/Jb2n7Hx3k0"
"Lights off. Roommate on my bed editing photos. Other roommate bought me Starbucks while I fell asleep 😭"
"@Texas_Daddy_ us yesterday 😂 https://t.co/iStIokiE8e"
"biked for 3 miles &amp; now ruining it with whataburger"
"@mercc__ We have whataburger"
"You really need help if you have a mom and pop pizza spot near you and you order Pizza Hut or Dominos."
"RT @CowboysGoddess: 😂😂😂 @ got high looks good tho https://t.co/dKboqlx3mp"
"Subway is ridiculous...I just want a pizza😕"
"*gets free meal*\n\n“I pull up at Chick-fil-A doors off, top down, drive thru girl sees me, pantys drop, looks at me &amp; boom free meal” -brotha"
"Today I've concluded I don't like chipotle"
"@OPEIU298 That’s my point. I’m expounding on the greatness that is @Whataburger while pointing out In-N-Out is lame."
"RT @Yajairaa_a: *gets free meal*\n\n“I pull up at Chick-fil-A doors off, top down, drive thru girl sees me, pantys drop, looks at me &amp; boom f…"
"Definitely just went and got a burrito and then chicken nuggets from Wendys. #itsthemunchies"
"RT @UrScootrBro: This sounds good asf https://t.co/eoMIYSQSNx"
"Lmao I’m trying to get high with my niggas and eat some little Caesars pizza again 😂😂💯"
"Taking a break to heed the siren's song\n\n#photooftheday #caffeine @ Starbucks https://t.co/sWVv7QwZ1c"
"@GaryTheNeutral What about RICK AND MORTY FANS in Mcdonalds just there for some sauce?"
"Me trying to order whataburger at 2 in the morning https://t.co/VcHeFZXGyT"
"RT @PSS_FoodBlog: When left over #eggplant and smoked #chipotle #shrimp is just as delicious the next day #food #homecook… "
"Perf https://t.co/V3NL17HBCx"
"#HookEmHorns 🤘🏽I've got #Texas to take the W in this week's @Wendys #RivalryBee! Who's got your vote? https://t.co/ERo62hfBLB"
"RT @SheepishWolf1: @NYCNationalist 100% agree. The subway is completely messed up and he is a walking abomination towards 34k of New Y… "
"RT @xcxmario: Me when Chipotle employee barely puts meat in my bowl &amp; still charge me when I nicely tell them to add a bit more o… "
"all of my problems could be solved with a pan pepperoni pizza from pizza hut, a bottle of sprite and Carlos coming over and cuddling w me"
"RT @RedNLovelyy: You might've did something 🤔 https://t.co/ZCv9FWTkTh"
"RT @adamhernandezII: what's this nonsense 🤔 https://t.co/FKNpO7JivM"
"idk how y’all eat whataburger."
"RT @CodyWody925: Got high and experimented, fried chicken patties, cheese, lettuce, tomatoes, pickles, sautéed onions and chipotle r… "
"Didn’t make it to the gym and I ate @Whataburger for dinner 😅 #yolo."
"@sassygayrepub Whataburger 🇺🇸"
"@Wendys I would love it if you bought back spicy chicken nuggets"
"RT @jaaasmin0: I’d cry if someone gets me this https://t.co/xaBDr3mbvr"
"@maribelsaenztx @MyLifeAs__LIZ @Wendys Get to a bowl game then talk to me"
"LMFAO THEY DONT HAVE ANY😆😆😆 https://t.co/aJ3V9i3xMM"
"RT @JuiceboxCA: Remember when Subway $5 footlonged Quizno til they died? Kinda feel like Netflix should've followed that model. https://t.c…"
"Helll yeahh https://t.co/rlVuoJIqJk"
"RT @K1NGR1ZZY: @BurgerKing Girlfriend: I wonder if he’s thinking what I’m thinking. \n\nBoyfriend: I still can’t believe @Wendys doe… "
"RT @ShehanJeyarajah: Chick-Fil-A customer service is UNDEFEATED \n\nhttps://t.co/sXgBwHDq5b"
"RT @Garcia_TatianaM: Am I the only one who woke up super happy this morning because of this weather? Makes me wanna get Starbucks and go sh…"
"ahhhh hell na def cancelled! im pissed @Wendys https://t.co/bSPlAPScrV"
"@_yungpresto @espn @Wendys This same Sooners team just lost to Iowa St....."
"RT @brooklyngohard: Ima make this sober https://t.co/qaiTVq180Y"
"RT @naomivaazquez: Ok but where's the Chick-Fil-A one at?! https://t.co/5wV0v483xV"
"RT @paulstiga215: Jesus Christ this looks unreal. https://t.co/vCEUkQKbgc"
"@Han_Tam70 i convince myself to buy myself starbucks every day of my life is that the same thing?"
"@AshleySpivey Yes it is! Wish we could get you some great queso up there to y'all, but at least you do have queso. Good for Chipotle!👏🏻"
"@The_Claire_Bear Krispy Kreme is trash ...and my location is turned on 😜"
"@ThatOtherAlcala @espn @Wendys They’ll be fine as long as they beat TCU"
"All I can think about... https://t.co/5dg1iYqxoP"
"@Cynthia_Cruz021 @Whataburger omg i havent had some in forever, now i want some! :/ Miss you too!!"
"Can I just get rice from Panda Express or what ?"
"Pizza hut is the best Pizza place mmm"
"I used to eat like this when I was high https://t.co/rPKu3gLHMl"
"I don’t feel like getting up but I want some rice from Panda Express real real bad or a taco .. idkno lemme go see bout that tho"
"RT @ilove_vonnie: Krispy Kreme donuts have no real “bite” or “chew” to them. They taste like disappointment, dreams deferred and broken pro…"
"@stogequeen Taco Bell or time whataburger?"
"I just checked in at Starbucks with #mPLUSPlaces Download today!  https://t.co/VaUTr9Zfrh"
"RT @DailyUpdatesWDW: Jack just bought fans starbucks and won’t let them pay him back 💕"
"@hunnersag whataburger"
"RT @PrimeZeke: Ayee ma boy this looks amazing https://t.co/CR1MksQQfz"
"Good job https://t.co/TtHRZwki12"
"You snapped bro https://t.co/E3WtTWVedJ"
"RT @d8than: You snapped bro https://t.co/E3WtTWVedJ"
"@karlarteagax Karla w the Starbucks 🤔"
"RT @grimeyravemama: @alxaes @daisymarquez_ we also got whataburger"
"@Codyshane_14 @Wendys Baker is a poor man’s Landry Jones"
"RT @gord_mackay: Sonic Drive-In credit cards for sale on underground forums - acknowledged a malware breach - https://t.co/ddqXVynquQ"
"ONE hour remaining to join us at WHATABURGER for dinner!!!🍔🍔🍔 https://t.co/4CNiCROQMD"
"@sara_marie_27 c’mon I need money for Starbucks :/"
"What a little bitch. A man drinking a Lime-a-rita https://t.co/SpVSGmqleN"
"I met all these young impressive men &amp; women at Starbucks in Dallas today. #AgsFutureIsInGoodHands \nI was very impr… https://t.co/ElVjfPRu7c"
"Pizza Hut in Ruidoso New Mexico and a few cold Bud Lights"
"RT @ABCBTom: McDonalds employees have heard pickle rick, schwifty, and wub a lub a dub dub 300 times today, they deserve $15.00/hr"
"He should be on the receiving end of plenty sexual assaults in prison now!! #JusticeWillBeServed https://t.co/JVMFu9Fseu"
"Keep driving https://t.co/1cjDXAHVTk"
"RT @TheDIYideas: How McDonalds Fries are Made https://t.co/Dtdsof6yjK"
"RT @callmeshitto: haha brooke i see where u wished happy national boyfriend day to taco bell on instagram. i get it like taco bell is ur bo…"
"Giant bird on a crunchy shell with a side of fire sauce. Duh, obvy. https://t.co/rkLS8KR1Jn"
"And subway it is 😋😋😋😋😋😋😋"
"RT @hanniajac: When ur sister give you her birthday reward @Starbucks ♥️☕️"
"Lancaster whataburger is so slow 😐"
"lemme go to taco bell"
"Texas has @Whataburger too :) https://t.co/sYuAKFHhW7"
"RT @ryanridley: The joke that shook capitalism. https://t.co/qVkoFmfuD4"
"RT @DankMemesPlug: KFC ain't fucking around https://t.co/rIAWCpXaGY"
"I love @HEB. It's a @Whataburger kind of love. But there is no eggnog at this location and I want to cry."
"RT @jaclynng_: Not a want BUT A NEED https://t.co/RYamSK2Bgr"
"@Kyle_Korenek can get me this because this is where we met @Whataburger https://t.co/PCyjqOasvN"
"RT @Fatboy_sse: THESE SUBWAY COOKIES WAS TOO FUCKING GOOD 😂😂😂😂😂😂 #FATBOYGANG https://t.co/TM1iCVTNqe"
"This made my night https://t.co/pszjVhCWRW"
"LMAOOO THE SOUP https://t.co/SKN22oe0Ib"
"@JimmyH1eld @TCloudSubs is a sub @jerseymikes is a sub @LennysSubs is a sub @SUBWAY isn't"
"The lady with the soup ❤️ https://t.co/uQAZi0Z8T2"
"@elegantErikka_ @TayHomezz Update the @Whataburger was great"
"This is why you’re my bro https://t.co/L8CGKPJ1gy"
"RT @americanIife: New York youre doing amazing sweetie https://t.co/H8HmX3UZ2e"
"@WesleySliva18 @Wendys I like the way you think bubs"
"so @McDonalds are you guys gonna kick back any money to @RickandMorty or you just gonna cash in on this one?"
"RT @iSJG_: ima go ahead and say I quit .. @Whataburger https://t.co/PSjFg6ZJpq"
"Only reason I ate Wendy’s🙌🏼 https://t.co/4Hur3teDbK"
"RT @yslbg_: Lancaster wing stop is slow 😐 https://t.co/U5YfzUeEmf"
"@ChocoLatino_ @BurgerKing @taytaytayallen @Wendys We didn't ask you. Let BK and Wendy's fight it out. Just stop talking"
"@mgrado71 @Wendys Never forget about me"
"yall the group of people whos gonna be strugglin to pay for a $2,000 car while yall workin at mcdonalds in yalls mid 20s"
"I wish whataburger served breakfast all day"
"besties that bring u starbucks and food are the best wow &lt;333"
"Chick-Fil-A Spirit Night ‼️ Thank you for supporting PHS Class of 2020🐾 #LOBONATION https://t.co/itGUyHeLyC"
"Good gosh that does look gross hope it tasted netter than it looks https://t.co/Cwwdp1Fn9x"
"Anyone down to go get some hot chocolate from Starbucks"
"I fucking love this song!!! https://t.co/9yBG5XEF0Y"
"RT @phsclassof2k20: Chick-Fil-A Spirit Night ‼️ Thank you for supporting PHS Class of 2020🐾 #LOBONATION https://t.co/itGUyHeLyC"
"RT @Phat713: Dove &amp;; Chick-fil-A just gon have to call me “Nigger” to my face😬🤷🏽‍♂️"
"Apparently the boys at Starbucks are in love with me"
"@KXAN_News @Whataburger @jamesavery I can think of at least 25 people I know who would buy this"
"RT @caliwarren_: need starbucks and some takis to make me feel better"
"Oak Forest police investigating armed robbery at Subway\n#crime\nhttps://t.co/WISY8MJSne"
"What’re the odds somebody buys me the Whataburger James Avery charm? #pleeeaassseeee 😇"
"@titanicsinclair pizza hut"
"We had an awesome turnout at our 1st Spirit Night of the year at Dairy Queen. Thank you parents, students, &amp; staff.… https://t.co/jAu7637iaD"
"Like Chipotle? Wanna help a brother out? Go to the Chipotle in Greenville this Friday! Show them this flyer or ment… https://t.co/8xs0ZjQIpC"
"Oh you gon be in there for a FAT minute if you tryna order. https://t.co/Ht6uh89oru"
"Just met a fellow Clash Royale player at jack in the box, my life is complete"
"THIS TWEET IS SERIOUSLY PROMOTED BY BURGER KING IM CRYING https://t.co/v0Mhwi3CSt"
"@kevjr9 TRADE THIS MAN!!!! 😂😂😂😂😂 Krispy Kreme will NEVER be better than Shipley’s!!!"
"@Michael_G45 @mgrado71 @Wendys Let’s bet a sixer"
"RT @Jman0190: I wish whataburger served breakfast all day"
"@CesarHuerta62 @mgrado71 @Wendys I'm down"
"RT @gustavonever: Passengers you're doing amazing sweetie https://t.co/spk6RPMbIh"
"a must have *drools* https://t.co/JpSg4ehoGw"
"Lmao why is this a @BurgerKing promo https://t.co/K554gunq8C"
"Shipley’s&gt;Randy’s&gt;&gt;&gt;krispy kreme"
"RT @rayreyna28: Chick-fil-A https://t.co/aodoF8cqDh"
"RT @ColeDavid: @KamalaHarris That’s not the purpose of a minim wage job!  Working at McDonalds isn’t suppose to be a career."
"Subway got the best cookies"
"*Brunch. https://t.co/Q1AI4c8xhH"
"For those Starbucks(SB)gurus out there ordering chai tea: chai is another word for tea, the SB brand literally labe… https://t.co/2Ennl7K8h7"
"@Braungardtanner @The17thSteven Taco Bell or McDonalds"
"Shoulda kicked his ass https://t.co/gDxxvLkaY7"
"No....way..... https://t.co/069lbtrHgh"
"Naked taco from Taco Bell? Nah breh"
"Yoo 😂 def Christmas present https://t.co/xh6jWgqGBx"
"This is @TheRealMMMcCoy to me everytime https://t.co/0QqdY159r2"
"My son 28 now got these in his Happy Meal as a kid &amp; we still have them! Still my favorite Halloween deco!… https://t.co/VpMpBxBo7J"
"Thanks for the reminder 😜 https://t.co/fqQRMucljZ"
"RT @SteenSN: @awid__ @BurgerKing @Wendys And they didn’t comp you!?!? Double ouch!"
"RT @dominos: Which type of pizza is better? Pepperoni or just straight up cheese?\nRT for pepperoni\nLIKE for cheese https://t.co/3QSfMPXL3R"
"RT @brenda_rangel22: Or whataburger https://t.co/2WysTErDzn"
"@mybootycute You prefer taco bell over taco TRUCKS!!!!?????????????????????????????????????????????????????????????… https://t.co/yenTnpZFKj"
"BURGER KING IS PROMOTING THIS 😂😂😂😂😂 I’m deadddddddedd https://t.co/bOZ8T4SXaW"
"Thanks Nuna Wendys for following me on Twitter! Read more on https://t.co/ckGScRsMdk https://t.co/MQ1MAcGqxZ"
"WWE 2K18 to Feature KFC's Colonel Sanders as a Playable Character 😂😂😂 I’m dooooone lmao https://t.co/EvKfWJyQoq"
"want https://t.co/x4vG3QaEkk"
"@jonykaacosta51 @AyitaTrevino Okay look😂 we are all alive and well and we got McDonalds too so it’s all good"
"They sold out of the whataburger charms in 35mins and I’m mad bc I didn’t get one :((("
"I had a two entree meal from Panda Express for lunch and I’m starving again????? Explain that atheists"
"Aaaaand Pizza Hut goes crazy as Honduras goes up 3-2 against Mexico with a goal from Quioto! USMNT currently in fourth"
"RT @Lalanobonez: My life is complete, they didn’t show the cocaine part but it’s all good https://t.co/0bXkPlivsu"
"@aleg207 Friday or Saturday! Let’s go chismiar at Starbucks"
"@Saul_Espino18 @Michael_G45 @mgrado71 @Wendys Bet me saul double or nothing"
"Bring me a starbucks sick tea if you a real friend"
"RT @DanMoreno_: .@Whataburger, always you bby😘 https://t.co/VYVDFxSebJ"
"I actually want one 😇 https://t.co/OKumBntCeA"
"Worth it. https://t.co/jwKmmZfXzd"
"@rebekah_vald Must be nice sitting inside of Starbucks all cozy instead of sitting outside like us peasants"
"@Wendys should I eat McDonald's tonight??"
"RT @FrenchCalhoun: Play Chess Not Checkers https://t.co/W9nOLrDcY0"
"Fuck I want some Whataburger rn"
"Working at whataburger now 😛😛😛😛"
"@marshallsheldon Just visiting illy. \n\nOn another note: those are the rudest people I have EVER met. Throwing you o… https://t.co/QPYCJorwZE"
"I got u https://t.co/hgPICNHgZm"
"RT @nadiaanis714: I NEED IT https://t.co/QvogR6EB2V"
"RT @ThatMick_Kray: For as many people who say they don't/stopped eating McDonalds long time ago, their shit damn sho be booming all 24 hour…"
"Love Domino's! And I always love a deal on pizza. @dominos https://t.co/DyKu0Nh3sV #ScoreDominosPizza"
"@jacob550666 But what If I also had subway for dinner?"
"@Wendys (1/3) 10th and FINAL demand: i want an army of kids. good looking kids. they'll all wear hoodies that say \"daddy fun\""
"RT @beyonseh: i love this song https://t.co/vkPvMyO13X"
"At Starbucks 💝"
"if this isn’t every Texas girl’s dream I don’t know what is https://t.co/rcEQBHwFmT"
"RT @KaiJalomo: I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/4okarmlJae"
"RT @yashar: I love this - Burger King doing sponsored tweets of people complaining about Wendy's https://t.co/TqUR15XfKH"
"@IanFortey @meganromer @rigatonimonster @tacobell @Hardees @WhiteCastle @Wendys Not one mention of @Whataburger... delete your accounts."
"@kbl301md @WWEgames @kfc Customization"
"RT @lara__campbell: not a want, A NEED. https://t.co/9oFDQNwDmn"
"Once again @McDonalds will have pokemon Cards&amp;Figures! \nThat means once again I'll collect 3/4 of a set I'll never… https://t.co/m9GYaCq51E"
"@MatthewMccon man that chili can't be good anymore, need to check out @Whataburger chorizo burger. #becoolerifyoudid."
"@such_A_frknlady @Acquired_Taste I wonder if he got whataburger"
"Be very cautious of people who eat McDonalds, if they don't care about themselves, I promise they don't care about you."
"I want the whataburger charm"
"Beggars can't be choosers bitch this ain't chipotle"
"Oh and also if you hadn't noticed, I hate Starbucks"
"RT @Jake_Vig: They called my name for my drink order at Starbucks, but I’m not answering until they say it with some goddam passion and con…"
"I'm insulted https://t.co/HEpQGLyKsj"
"Was super excited to eat my Subway sandwich and opened it and saw that the guy gave me Italian bread instead of Italian herbs and cheese 😒"
"RT @IanFortey: @KrazIIvan @meganromer @rigatonimonster @tacobell @Hardees @WhiteCastle @Wendys @Whataburger I've never even seen a whatabur…"
"RT @TheDemoScout: @WWEgames @kfc A lot of dumbasses are forgetting that Colonel Sanders is not a superstar for #WWE2K18 but for create a su…"
"RT @wtfisaiah: me at McDonalds when my card declines after trying to buy a mcchicken https://t.co/h4V732x0RE"
"RT @_jacielynne12: Somebody open a fast food place that has everything on the menu from whataburger, Taco Bell, Chick-fil-A, and canes bc I…"
"yes, physics takes over my life.\n(good news, i FINALLY understand it.) @ Starbucks https://t.co/euEkphjG5L"
"@MikeyOUDNA @Wendys I had OU last week covering."
"Fuckin right https://t.co/JB0ibwlfJc"
"RT @lexxbarrera_: Perfect day for a Starbucks date 😩"
"@FreindTrey @McDonalds i high key want unique cards lol not the same cards given out at TRU and found in the @GeneralMills Packs xD"
"@WafflesCat @McDonalds @RickandMorty @danharmon @JustinRoiland @ChairmanGao @cartoonnetwork @McDonaldsUK @McDonalds_DMV Too cute ❤️❤️❤️"
"LMFAO . Why did.  @BurgerKing promote this tweet ? 😂 https://t.co/asDUPbKgKR"
"RT @jollyrobber: I like both hard and soft tacos. I guess this makes me a bitacosexual. \n\nMe flirting with a lady at Taco Bell"
"RT @PhatIcon: WHOOP DAT ASS CAMILLA https://t.co/0JYt4r85n8"
"i find myself having Starbucks for dinner a lot"
"@KrystalBanda Thank you Krystal 😁"
"Texas always manages to win 😅 https://t.co/NbkCLddUvs"
"“Reminds me of my boy Ricky, he died though. RIP Ricky” 😭😂 Id you know where that’s from, I’ll buy you Starbucks"
"And you ate at subway, so you’re a child molester. https://t.co/hcJ4KHPWux"
"Yuh America doesn’t tolerate that https://t.co/fsfSaZaxOZ"
"Replace Chipotle with ctacos and canes with cwhataburger https://t.co/zFVVZJQ4Fn"
"@ChipotleTweets I found a hair in my Chipotle https://t.co/G1PNaprRFv"
"@AmyMek I prefer Whataburger!"
"@GabeWootton @Whataburger The big question is did you take the cheese to Whataburger or did you bring the burger home?"
"22 minutes left to go get your Whataburger on Broadhead rd."
"@GrayTrayce @Wendys Uhohhh Tia will be going for the Sooners"
"RT @nuffsaidNY: Trump supporters are gonna try to boycott #Eminem’s new album the way they did Starbucks. Good luck with that.… "
"RT @DAVlD4: Whataburger https://t.co/05fXvVz32o"
"RT @moralesbpxx: I want Starbucks:/"
"should i tell the cute boy in starbucks i’d be ok with him talking to me"
"RT @juanvaladez17: I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/XN9UIlitLJ"
"RT @destructoid: KFC's Colonel Sanders is in WWE 2K18...this is not a joke https://t.co/W8J344g0JN https://t.co/35ymeEH3bV"
"RT @arden_cho: Lol my gf was at my house &amp; saw I had these from @McDonalds then she sent me this... what? Is this for reals? Huh?… "
"Craving whataburger fries 🙁"
"Damn I should've waited a lil longer @toomanybrendas https://t.co/GR2El6Bo9d"
"that bitch.. this why I tell people not to drive off until we quadruple check our bag to make sure we got ALLLL the… https://t.co/h5MOsfUE31"
"Fuck you @Wendys"
"RT @TheCosby: You ain’t never experienced the hot sign being on then...them hot off the presses  Krispy Kremes like Day 1 Manna i… "
"ion even eat mcdonalds like that but I HAD TO try this sauce people dying over lmao https://t.co/yLdIsuhUNh"
"The site formerly served as a Sonic drive-in https://t.co/vxCsbUqxLf"
"EVERYTIME!! 🤣🤣 https://t.co/hPsIZBmRJV"
"Diamond 💎 Families join us tomorrow, Wednesday Oct 11th from 4PM-7PM @McDonalds! See you all there! https://t.co/y6ZnT9IIBb"
"RT @qdiggs6: Quit lying to these people! https://t.co/Fgke6lFzSs"
"@SebGorka @markknoller You ate at subway, so you are Child molesters. https://t.co/hcJ4KHPWux"
"Can this chipotle bowl fill the hole inside my spirit?\n\nFind out next time on Dragon Ball Z."
"RT @luishinojosaa: Fuzzy’s is better than torchy’s and qdoba is better than chipotle. I only speak in facts"
"The soup was like the cherry on top. I luv it. https://t.co/bxWLuAUHJP"
"I don't mean to brag, but when it comes to identifying the actors who play Colonel Sanders in the KFC ads, I'm easily over 75%."
"Colonel sanders in these kfc commercials always looked like a slave master to me"
"@afreakingmazing over there by that Mcdonalds and taco bell earlier we almost hit cars i was tryna roll my window d… https://t.co/aB8Kcu5MmT"
"RT @mishelleyAF: Debating if I should spend my last 5 dollars on starbucks..."
"RT @SluggerStyle: LIVE on #Periscope: Me and @enemy_stand driving to a nearby McDonalds to pick up some #SzechuanSauce they had left… "
"i looove this song https://t.co/5siiKGc4Ka"
"i waited over 30 for fries at whataburger 🙄"
"RT @jshor10: I hope everyone have a good day expect the person who closed down all the jack in the box’s in Lubbock"
"RT @laith322: Chipotle’s queso was terrible 🤢"
"RT @CopelandCFISD: Thank you to Whataburger for the great breakfast for our staff @CopelandCFISD ! What a nice treat! #coltslead https://t.…"
"RT @DavidInAlief: The chorizo burger at @Whataburger is legit!!"
"My roommate just asked me to GO GET Starbucks FOR HIMbbdbbabsshslakhsks I need to leave college right now. https://t.co/HnahutiExj"
"RT @kelseyuhlich: me walkin into work every morning 10 minutes late with a Starbucks like wuddup get the fuck out my face good morning peop…"
"Free Krispy Kreme Halloween Doughnut https://t.co/pK9v1KnPUK via @po_st"
"RT @817_ASH: This why you my nigga fam https://t.co/vBWrfZGvBa"
"RT @HvrrisonLdn: When you just chilling and your girl questioning you why Pizza Hut is texting you \"Miss the sausage Meat\" https://t.co/2OO…"
"RT @tonyposnanski: I just left Starbucks because no on there would help me\n\nThey were too busy talking about ESPN’s ratings since everyone…"
"I dropped my phone at whataburger and it made a small crack that looks like a spider and it’s bothering me lol"
"I want Whataburger sooo bad rn"
"This makes me a teeny bit happier https://t.co/lPreG6dBal"
"I asked this bitch for onions at chipotle seeing they were out &amp; I was willing to wait for it, but she said NOTHING &amp; gave me nothing"
"RT @luluramadan: Cops are at Wellington McDonalds where tons of angry people lined up for hrs for Rick and Morty Szechuan sauce only… "
"@AstrosCounty Also, the playdough donuts my kids make are better than Krispy Kreme"
"Y’all forgot... \n\nTexas also gots Selena Quintanilla &amp; Whataburger https://t.co/AkXMAV9pNV"
"RT @Chauncey_Boy: Here at the San Jose Mcdonalds. This is our reaction to the shortage of #szechuansauce #giveusthesauce #rickandmorty http…"
"Lmao Luke named Ross owning Wing Stops and Checkers. That’s cute. 😂"
"I'm out here trynna get Mala Luna ready but all I can think about is Chick-fil-A :((("
"R2 is a little scary here. He almost looks like the killer robot in the movie Hardware. 😨 https://t.co/7P2sCLLLuw"
"Omg everything about jack in the box is so obnoxious. Obnoxious sizing, enclosed drive thrus, &amp; they're all in someone else's parking lot."
"\"I don't see why Whataburger is a big deal.\""
"Ugh craving subway 😅"
"@Jacob_Perez27 and me went to whataburger and saw @_L03RA in the drive through then we walked in and saw @JMoreno_03 inside. Crazyyyy"
"@justdreanna Ily and Imy, Starbucks date it is 😂"
"We had 5 dollar med papa johns pizza here today https://t.co/qWaPo7gypM"
"@Brown_master13 @Wendys do not diss wingstop like that. 😤"
"RT @AyyKristian_: Yalls In &amp; Out could never https://t.co/MgAAbcCwAj"
"Bruh.. the closest Checkers to me is in Houston 😩😩😩"
"So I’m going to be a Taco Bell sauce packet for Halloween"
"RT @Kendalltheman: Y'all reallly out here eatin KFC huh 😷"
"RT @iWorkTheHardest: I’m from Kentucky and I don’t even eat that shit https://t.co/lBzQXBUT3A"
"these are so cute to me https://t.co/f0wwm4zwkr"
"Why is Dairy Queen always sooooooo slow?"
"I can never say no to subway lol"
"#jackinthebox @ Jack in the Box https://t.co/G8FUwxWL2H"
"Texans try the new Chipotle queso!! Awesome stuff (the video, not this particular queso.) https://t.co/KjFm246jze"
"@Wendys hey Wendy’s. I just ate your food. It was a genuine treat. Everything was delicious. Thank You for being Rad. #spicychickensogewdRad"
"@tylercstafford @AstrosCounty This is #FakeNews. I grew up on Dunkin' Donuts in New England, as did my wife. We bot… https://t.co/V65UxJleIL"
"RT @TerriShoop: Instead of a bootycall, how about a foodycall? Like, I text you at 2am and you bring me Whataburger."
"oml , they fucking tweakin. https://t.co/QEIjnOB9Y1"
"RT @21savage: Mcdonalds fries don't taste how they used to when I was young"
"@cliffordlevy This makes me think of the Taco Bell night manager warning his employees a mystery shopper is coming by."
"RT @Swoosh61: @espn @Wendys #BoycottESPN until #JemeleHill is fired."
"Yes. Beautiful. https://t.co/qHEoWJ29VV"
"RT @Kimbraov1: Dearborn: Judge tosses Muslim's (frivolous) $100M lawsuit against Little Caesars https://t.co/ps7aS6AtqA via @creepingsharia"
"RT @jacobissagoat: @jillian956 This weather is amazing. I just want to roll the windows down and get a drink from Starbucks and just chill…"
"I'm starving stop whataburger"
"RT @ZaneVanover: @Jacob_Perez27 and me went to whataburger and saw @_L03RA in the drive through then we walked in and saw @JMoreno_03 insid…"
"RT @jeremycabo: 61. high af at Subway https://t.co/iwN8DFlkar"
"RT @JacobJenkins116: I don’t like chipotle. https://t.co/nK1VPxRm8w"
"Lolololol @ anyone that has ever gone to Whataburger with me https://t.co/UwmAIdJtfD"
"RT @_twerkqueen: TEXAS also got Selena la Reyna de tejano, Spurs, George Strait, Whataburger, Ciara, Hilary Duff, TEXAS WINS ☺ https://t.co…"
"COME GET CHIPOTLE TOMORROW AND MENTION THE OLE MISS EQUESTRIAN TEAM!!!! https://t.co/Ft0m0PdvcR"
"This would have been more satisfying if the racist got his face stomped on https://t.co/D9yZCDi0Bz"
"RT @ViraIMemes: McDonalds employee telling the 814th Rick and Morty fan that they don't have szechuan sauce (circa 2017) https://t.co/QB9Aa…"
"@cole_stef @OKCThunderHeads Whataburger"
"@bm1157 How dare you sir, Krispy Kreme is boo boo! #shipley's1 # https://t.co/Eqw0KELWYQ"
"Did you get yours? The James Avery and @Whataburger \"one of a kind\" charm sold out hours after its release.\nhttps://t.co/gmHaB3xRTO"
"I hate it when I’m on the treadmill and accidentally hit the stop button and go to chipotle and eat a burrito. #oops @ChipotleTweets"
"So like what ever happened to lakeside dates with some whataburger? I mean I sure would enjoy it lmao"
"Me when they tell me Quac is extra at chipotle.  @emilyjewel57 @abbyfrry_ https://t.co/grQBzoQiLI"
"Truly https://t.co/4annJrZbFQ"
"@Vanessa65490405 starbucks in the am ???"
"Can’t wait to eat some whataburger   ⏳"
"The James Avery whataburger charm kandhsvsliacskeiveldudbs"
"@G_ME_LFC They looked so bad i literally left for Taco Bell after the og"
"LMAO @BurgerKing PAID TO PROMOTE THIS JUST SO THEY COULD REPLY TO IT https://t.co/8bfQ93r3dS"
"@Gator_Dont_Play @Wendys Y'all better lay the wood on ol Mayfield... that's all I ask 💪🏼"
"AndCampbell’s soup. Duhhh https://t.co/eb1nTdVp68"
"RT @WizMommma: Me : “I had Panda Express for dinner”\nMom twitter : “YOURE NOT EVEN CHINESE” *blocked* *subtweeted*"
"Dominoes &gt; Papa John’s &gt; Pizza Hut https://t.co/2dXoiJhH2D"
"RT @elpasotimes: Did you get yours? The James Avery and @Whataburger \"one of a kind\" charm sold out hours after its release.\nhttps://t.co/g…"
"I'm at Dunkin Donuts in Nash, TX https://t.co/gGZyO9IMiB"
"@Wendys bring back spicy nuggets or Ima kill myself"
"RT @shanedawson: these @JulienSolomita pins go really well with my taco bell stains! get yours today! https://t.co/P8KDUkiryp"
"In other news, a Starbucks was found next to the truck stop."
"RT @renerxdriguez: the city of allen is shaking https://t.co/jKkTXAIAag"
"@Arbys Love this! brought a HUGE smile to my face! thankx"
"I have to eat chipotle once a week"
"Honestly @Whataburger was extra stingy with the spicy ketchup I asked like 4 times and only got 1 🙃🙂"
"RT @AgendaOfEvil: A Woman Converting To #Islam Is Like A Chicken Converting To KFC https://t.co/WHXk2FmIHX"
"@Political_Rott Agree. Tump continues to play chess, while everyone else plays checkers."
"@Gus_Bus13 @Wendys Hahahaha oh cmon now. I'm funny. I have lots of good tweets"
"I need Whataburger tomorrow."
"DAY TWO! #restockthecharms #wishcometrue @whataburger &amp; @jamesavery! #thatarilife https://t.co/onKTHHlJVV"
"RT @House_Feminist: [mcdonalds drive thru]\none McGiving Up please"
"@Arbys commercials are the food for the soul that our nation needs. That man’s voice could soothe a honey badger."
"You aren’t missing much. https://t.co/a3xEn6ey8x"
"The guy at whataburger just told me to have a nice day and I narrowly avoided a breakdown at the drive thru window. #usmnt"
"Whatacharm! https://t.co/s5VUe1mniH"
"RT @jason_poppabear: Jimmy johns has a sense of humor I see https://t.co/J0lfuf9N1X"
"#HookEm #TexasForever  I've got #Texas to take the W in this week's @Wendys #RivalryBeef! Who's got your vote? https://t.co/P07U7l24Rh"
"You won’t see me wearing this, as I much as I love whataburger and Texas... this is tacky. https://t.co/RbdOw13nEV"
"RT @squidetor: @McDonalds For those who didn't get a chance to get a taste of the Szechuan sauce, here's the closest you'll get. T… "
"RT @yaniraaa17: I could go for wings, chipotle, sweet tea and tutti-frutti but you know skinny girls"
"a starbucks date on a cloudy, rainy day https://t.co/3RYEURi7Fq"
"Yeah, I like a lil weight to my donuts https://t.co/2AmPSMzQ5m"
"RT @Obey_Ellee: Target is not a date, McDonalds is not a date, parked car conversations is NOT A DATE.Don’t play with me ok? Twitter is get…"
"RT @IsaacMata03: I want good grades bruh https://t.co/kTl7Nmzgsc"
"RT @ella_celestia: \"Whataburger's great, that's my happy place\""
"This is me everytime I go 😂😂😂 https://t.co/ZuZCOkFutO"
"#whataburger spicy ketchup is the best dipping sauce known to man"
"My first time trying pasta from Pizza Hut &amp; it wasn't what I expected. It was alright."
"@lnzhue @Starbucks Ultimate letdown."
"@drknstormynite @RookieCityCop True. Not discounting that. I’m just saying, the mcdonalds drive thru worker isn’t e… https://t.co/Bno3a7NxnV"
"Not in years https://t.co/FmsGth3Xtd"
"HAHAHA BYE NOTHING WILL EVER COMPARE TO WENDYS SPICY NUGGETS https://t.co/AxC14A7Jgs"
"#callmejoannethescammer I asked for a large queso at chipotle but they charged me for a regular"
"RT @Karina_Eliza15: I want Chick-fil-A but I think Caity and Anna are dead"
"Anything I do with my woman is a date don’t be bitter because no like you sis 🤘🏾 https://t.co/kqZz99RicK"
"I order so many pizzas to the lib that I had to set up a Pizza Profile  🤷🏻‍♀️ https://t.co/rTZD2GDDbP"
"brooklyn, ny, you're doing amazing sweetie https://t.co/pwNUCGhLF1"
"They’re already sold out 😫 https://t.co/JGqxAUAqAn"
"@SinisterHorsie Someone called him out for getting mad that mcdonalds used R&amp;M to sell a sauce when he cribbed his… https://t.co/452i76RxZN"
"THIS MAKES ME HAPPY. DONT TAKE THIS SHIT ANYMORE. https://t.co/6mUUhCzVr0"
"RT @Alknightjr: She should have to take a yellow cab. That way we'll see and hear less from her. https://t.co/he3pjNFURL"
