"alright cherry on top of the cake. where can you fix a cracked iPhone screen in morgantown?"
"No meme is greater than Ghost Pumpkins Soup... For Pumpkin Hill from Sonic Adventure 2"
"@KatyKreation Can't help with that,but you could come over for cauliflower fried \"rice\". It turned out really well. And you should eat. ☺"
"RT @ChrisMurphyCT: Trump's decision to stop ACA payments is nuclear grade bananas - a temper tantrum that sets the entire health system on…"
"@SwampRabbits like carrots... we prefers goals. \n\nNICK SORRRKKKINNNN 🚨🚨🚨🚨 Nailers lead 4-3!"
"Homemade brown fried rice and chicken, broccoli, &amp; mushroom stir… https://t.co/KIlQWvHY5S"
"RT @Mark_Beech: Butcher's Bloody Mary at @BirdSmithfield - Smoked pork-rib infused vodka, Ruby port, tomato juice, Srircha sour... https://…"
"@Cody_Sun1 You guys should be getting as much shit as them.. Good to see ya in a cherry mood, not like beating yourself up would help."
"Love a lady who can eat 😂🤷🏾‍♂️❗️💯 https://t.co/Cz7dKV5e02"
"We'll leave some carrots in the locker room when we leave. :) https://t.co/ZwBUp1fX7V"
"RT @wineladyjo: Low Carb Cauliflower 'tots' so easy to make for #gameday #snacks #sidedish or #party #appetizers… "
"RT @ImShamakian: @jwilli4404 @XvegasheatX @TCJimPeters @WatchChad @Eminem Vegas odds say a 50% or greater chance he’s impeached or q… "
"Oh, you know. Just passing a pineapple on USA Network's Pysch page.… https://t.co/k2lIwRO6RD"
"RT @lyricsupply: Hozier // Cherry Wine https://t.co/mWiSMETIAP"
"@Seleigh_ ...no, god, no porn of the innocent sweet pure potatoes, please"
"RT @AHart1982: @realDonaldTrump comparing #ATA to truckers is like comparing Apples to Oranges. #eldorme @Land_Line_Mag  #HR3282"
"RT @wishesNdishes: Avocado Chicken Salad Pinwheels made with @GoAvo for a healthy lunch or game day snack!🥑 https://t.co/BkXY8TITm5… "
"@saingirl101 I forget pears don't have a lot of flavor so it tasted just like apples lol"
"📍 Campbell Springs Farm https://t.co/O329Az9HyY"
"How we adventure. This is Ethan with the Sheriff, who asked Ethan what his favorite part about the evening was… https://t.co/SWgqrdTSDO"
"@spruzilla My shopping spree today: Pinot Noir, sweet potatoes, quinoa, combat boots (pleather/vegan), cushion made… https://t.co/67m4ljtKCi"
"Good night. 😴🌘\n\n11:50 PM https://t.co/vBONbggeq6"
"Vegan Bang Bang Broccoli - Rabbit and Wolves https://t.co/XFSTRxA5iX"
"RT @McAfeeBee251v: Comedic life after football suits Plum, WVU product Pat McAfee #McAfee #bhivelabs https://t.co/JLvpKObmHt"
"RT @DearAuntCrabby: Two peas on a pod. @realDonaldTrump https://t.co/J0R7QuEePl"
