"RT @MamaVoulas: 📆 Today 12pm-10pm @ World Beer Festival (409 Blackwell St, 27701) @SFFRaleigh"
"From 12pm-10pm @ChirbaChirba is @ World Beer Fest / 409 Blackwell St, 27701 https://t.co/4fsH4DWiHX"
"@VKNask They even have a beer garden now apparently. But this year I'm coincidentally out of town both weekends. :/"
"RT @EdKrassen: Why is it OK for Trump Supporters to criticize NFL players for kneeling during the Anthem, when 99.99% of them are… "
"@charlotteagenda @c don’t forget @LbrarianBooker birthday beer crawl in plaza midwood! @CatawbaBeer, @LegionBrewing… https://t.co/B6ypUdKXg5"
"Drinking a Gang of Blades by @burialbeer @ Bowles Drive Parking Lot -S11 — https://t.co/nQZ81LVH0o"
"RT @marlee_marrotta: Chicken friggin tenders https://t.co/t9tsrqLHLl"
"RT @YahBoyCourage: police really be risking their lives everyday. absolutely incredible job getting this monster off the streets https://t.…"
"I’m voting for Walkers Smoky Bacon! #chooseorlose\nhttps://t.co/kRj8ITNlfY"
"RT @brownsuga_marie: i broke bread when i aint even have bread to break"
"Cheers to National Dessert Day! Join us for dinner tonight &amp; enjoy a sweet treat created by our Pastry Chef Jamie!"
"RT @Quaandadon: This new wave of DICKHEAD \"comedy \" yall tryna create is lame as fuck. https://t.co/X88ZXZdN5l"
"Turkey cheese and mayo is the holy trinity of sandwiches"
"Pumpkin Cake, Apple Caramel Pumpkin Seed @vortexdoughnuts 🎃\n#pumpkin #donuts @ Vortex Doughnuts https://t.co/lzQvaGRphM"
"RT @pmarshwx: Clemson to OU: “Hold my beer.”\n\n#DidNotSeeThatComing"
"RT @FakeSportsCentr: Sports World:  \"DAMN, that Iowa State win over the Sooners will definitely be the biggest underdog win all season\"\n\nCl…"
"New trending #GIF tagged beer, drink, drunk, drinking, weekend, bunny, rabbit, saturday, liquor via Giphy… https://t.co/umpQ01VTt4"
"RT @meechonmars: They not as good as yo spicy nuggets &amp; a side of BRING EM BACK sauce https://t.co/fncw5O0AkN"
"RT @FJ1AO: pizza culture technology"
"In the Tennessee mountains. Local pizza joint gives 15% off if you wear your gun into the restaurant. Yeahhhh not in mood for pizza anymore"
"This shit is so fucking trash https://t.co/3ezLWebO5I"
"RT @CU_KMac: How did I miss this - Tanner Muse with the fucking BEER CHUG CELLY 😂😂😂 https://t.co/nPysn73D07"
"Speaking of breaking bread, I’m tryna take my ol’ lady to @BeyuCaffe tonight and I just hope the catfish sliders I… https://t.co/C7cRIHMJca"
"Bible. Psalms 127:2\n[2]It is vain for you to rise up early, to sit up late, to eat the bread of sorrows: for so he… https://t.co/jrGk1jFzp4"
"It's in support of the 2nd amendment and \"our new government\" https://t.co/JJ9D531r5U"
"Yes @onlyburger helped us set up Raleighs first food truck rodeo w 9 trucks!! https://t.co/JDeTlvvJnf"
"RT @cheryl_haurik: @ChuckNASCAR Psa 41:9  Yea, mine own familiar friend, in whom I trusted, which did eat of my bread, hath lifted up… "
"RT @ElegantIife: Fuck the wheat and white bread. I’m eating my sandwiches with this bread https://t.co/6nfV7vFk0o"
"RT @KarlousM: If you listen to James Brown you can connect with the soul of your great grandfather. True shit. Yo grandma fried fish to thi…"
"Some cheese eggs would hit"
"It's our @BondBrosBeer Saturday! Come and get your #bulkogikbbq and pair it with their award winning beer on this b… https://t.co/gdjB8oWeAY"
"RT @janinekwon_: NU'EST W talk about their preferences 💕 Ah, these cuties 🙈\nQ: Beer or Soju?\n🐯: I don't drink, though??\nhttps://t.co/WR9KUk…"
"RT @mildpeaches: Hawaiian bread is like the best bread out there tho fr"
"@_CaramelKissex Respect. Get that bread b"
"RT @Drea_TheCreole: Pizza is trash. Philly sandwiches are trash. All sandwiches are trash."
"RT @laurinfxckRalph: I broke bread when I ain't even have bread to break"
"Q: \"Baby, what do you want to eat after your football practice?\" \nA: \"Sweet Tea, bacon, &amp; cornbread.\" #ThingsSouthernMamasAsk"
"Cannoli Cake anyone? Available at Sweet Cheeks Bakery! Phone at 919-303-9305 https://t.co/kwbpV8wUrv #bakery #apex… https://t.co/pyjoHFAkCq"
"RT @NFLDraftInsider: #Clemson S Tanner Muse returns a fumble for a TD and proceeds to crack open a beer 😂😂 15 yards https://t.co/GyO03P1Nun"
"RT @mitchelmusso: I’m the man who had the cheese https://t.co/BTr61Uw4qS"
"\"I'm drinkin beer, n eatin tush\nMy darlin left me for an octopus\nHe has eight legs I have one tooth\nI sure do miss… https://t.co/OHhIBsEsY6"
"#burnpile - Drinking an Autumnal Dichotomous (2016) by @jesterkingbeer at @burialbeer  — https://t.co/D7IBibyyqo"
"RT @leathershirts: imagine u walk into grandmas house it smell good af u go into the kitchen post malone standing there with a plate of coo…"
"RT @TroyDreyfus: OJ Simpson:  \"Wow... I can't believe they let me off the hook!!  This is unbelievable. I totally worked the system\"\n\nUNC:…"
"@JeffJacksonNC My mom and stepdad go to the one on 51 all the time! Chicken fried steaks!"
"RT @iamwilliewill: Fuck the wheat and white bread. I’m eating my sandwiches with this bread https://t.co/gnIBuD0DH3"
"2nd Annual CLT s'MACdown Mac-n-Cheese Competition &amp; Craft Beer Tasting ALL U CAN SAMPLE! TIX… https://t.co/HHJ7rLMKwF"
"First Ward Fall Festival October 13-14: Sip craft beer and enjoy food trucks and family games… https://t.co/5ucnSIyL2W"
"I just earned the 'Cheers To You! (Level 5)' badge on @untappd! https://t.co/cCBituGgm3"
"Links https://t.co/O2wfDYufVo"
"Young Dunkin Donuts Iced Coffee https://t.co/XujkQghyYu"
"Alright State let's go! Already had one disappointment with no beer towers at bar."
"RT @GrishinMax: Making cakes using 3D printing technology. https://t.co/YHQOeOMy6e"
"RT @Janelle_No_5: Are you mad cuz Financial Aid playing with your refund check? Or Fried Chicken Friday just got you lit this morning… "
"919Flashback - You never Sausage a Dip! https://t.co/1SZV3npbR0 #919raleigh"
"RT @RichVos: @nataliesurely @Forgive_Blue I think putting fries on ketchup ruins ketchup"
"Al Riggs coffee review episode 18: Dunkin’ Donuts chocolate donut flavored coffee is OK and not the best B-\nbuy Hek… https://t.co/Xbg526L7KA"
"RT @EastLaneAve: 100 Beer Bottle Caps Mixed Lot $12 #Recycle #Upcycle Craft #bottlecaps #beercaps #beerbottlecaps… "
"Attending the @worldbeerfest at DBAP today? Stop by and say Hi.. Look at our beer lineup w/a new @BullDurhamBeer Be… https://t.co/8OxB4Hpt8x"
"RT @emarl_: Twitter peaked at an account where birds could tweet by pecking at bacon fat on a keyboard https://t.co/ISJmbxzGMc https://t.co…"
"Energy drinks the cause of brain hemorrhage, doctors say https://t.co/7DQzfmuNMd via @@11AliveNews"
"@jbundy89 Panther cheerleaders and free beer too..  Suck it.  Um wow good game"
"Raleigh .. mall &amp; cheese cake factory ?"
"@cpmcgonagle @piersmorgan Anybody hungrey for pizza ???"
"Yall i was so lit lastnight.. my best friend opened a soda bottle, &amp; i said \"bless you\" with confidence 😂😂"
"RT @totallyclairezo: two biggest shocks of adult life:\n1. everyone does cocaine \n2. cheese is fucking expensive"
"RT @DrTomMartinPhD: Love Comin' At Ya. Remember: Waffles, Eggs, Bacon and Biscuits  (can't go wrong). https://t.co/HHKQv5nx9F"
"Crispppp n smooth - Drinking  The Hart by @holymtnbrewing at @burialbeer  — https://t.co/K2UC2717ms"
"Yeah so this one is crazy - a blonde breakfast milk stout - messes with your... (Half-Calf) https://t.co/a93OfFCEzK #photo"
"Disgusting. https://t.co/TUNb0IUAdQ"
"World Beer Fest! - Drinking a KA-BAR Brown Ale by @railhousebrew at @durhambulls  — https://t.co/DJyBw0a9lQ #photo"
"I have a request for some new cookies if that’s the case!"
"RT @vinnycrack: WHOEVER MAKES THESE CAPTIONS NEEDS A RAISE https://t.co/N6fDOL32Hy"
"best weaver street combo: young boy with a pile of shredded cheese &amp; pile of raisins- in each pile rests an unpeeled egg."
"I just ordered pizza for the first time since moving from Brooklyn to Charlotte. \n\nI don't expect my follow up tweets to be in good spirits."
"Precious cargo.\n\nWhen you’re a beer geek, you end up bringing beer to a friend’s move, too. https://t.co/L3cA3njROR"
"Sausage biscuits always the move 🙏🏼🙏🏼🙏🏼"
"@LoverOBeer @untappd @LoverOBeer Way to go! What's the most interesting beer you've tried recently?"
"RT @emilyhlove113: Just wanna go to a pumpkin patch &amp; take cute fall pics &amp; sit around a fire &amp; go ice skating &amp; go see Christmas lights &amp;…"
"RT @UTSAResearch: The Science of #Beer...at #UTSA. #tooinfectious @STCEID https://t.co/C4hrySHxrT"
"RT @ItsFoodPorn: Cookie Dough Dip and Cookies 🍪 https://t.co/6DT83t7aUf"
"RT @chikinstruggles: CFA: “Any sauce with your nuggets?\"\nG: “No just uh ketchup and polyester sauce.\"\nCFA: \".......... certainly!\""
"RT @PornFoodies: French fries 👅🙌 https://t.co/yBG8pdpivR"
"@worldbeerfest Why didn't we think of that...must be the beer"
"Grand Opening Today... @MercadoElPaso Buy $10 of bread &amp; receive $3 off ALL WEEK LONG! Plaza Fiesta, 2111 Asheville… https://t.co/zSTl6H7Uc4"
"Beer &amp; mimosas for breakfast today #lordfairsquad"
"Donuts good af no matter what kind https://t.co/MgIGR9vLRq"
"RT @PuestoLoco: @Solafide12 @Kathysminerva @RVAwonk @Heinzilla @puesto I bet you a beer that Mueller &amp; Schneiderman worked on that… "
"Only came for the beer. Go Patriots @ The Unknown Brewing Company https://t.co/ktme8eay0y"
"Just witnessed a small child in a pizza joint with a unicorn horn on. Talk about #servinglooks"
"\"[T]hey often favour songs that are associated with influential times, places and  people.\" Or beer https://t.co/NF31GkTQgA"
"happy birthday kaitlin🎉 hope seventeen’s full of pizza, good music, and beach trips :) love ya long time💗 https://t.co/mXGGPysepF"
"Still time to get your tickets for the tour today. It leaves 2:45 PM from Flight. Purchase here… https://t.co/aORrLX22sD"
"RT @MajinDookie: Pussy smell like vienna sausage juice"
"RT @KFCBarstool: I am CRYING. The beer exploding on the one chick and the gibberish as the other one probably falls into a coma 😂😂😂 https:/…"
"RT @TheBullpen_ATC: Attending the @worldbeerfest at DBAP today? Stop by and say Hi.. Look at our beer lineup w/a new @BullDurhamBeer Be… "
"RT @jjazmyn_g: lmk if you tryna fall in love so we can \n• carve pumpkins \n• watch movies\n• go to a corn maze \n• go ice skating \n•… "
"RT @MisterPreda: I need a large pizza to deal with this awards show. #AMAs"
"RT @The_UtterMost: More maple bacon please. #BePositiveIn4Words"
"Bisonte Pizza on #Yelp: First time last night. Bourbon wings, Italian sandwich, and Greek salad were all very very … https://t.co/fDgz3L0u0W"
"Out here!  Come say hi and check out all the awesome breweries https://t.co/jMiFRnTpC8"
"RT @lilemailtrapper: Lmfao cause he eating sausage https://t.co/AehquL85zF"
"Angelica Pickles (Rugrats)\n\nRice krispy treat pops\nCake pops\nCookies\n3tier Cake 6in, 8in, 10in"
"Sipping beer 🍺 in vip lounge https://t.co/ZLrK5JJzK3"
"@RossMartin_IC BTW Cam Johnson looks smoother than a cold beer on an August moon 🌙"
"RT @DeliciousStuffs: Rebellious Miley Cyrus Appears In Painful Images As She Drinks A Beer Being Without Pants Just In A Bra\nhttps://t.co/O…"
"I love cookies so much its a problem"
"@_JoshDGraham @1037WTIB There's a beer &amp; pool stick in the background of this photo so I'm just going to assume the… https://t.co/zSMBTfOrnP"
"bitch you brokeeee shut up don’t talk to me get your bread up"
"Fans keep tossing pizza on ‘Breaking Bad’ house https://t.co/SRlWjjMbPu"
"Come join us tonight as we tap a BIG Bourbon barrel aged barleywine. @ The Beer Growler… https://t.co/BSDK77kE5D"
"Nice citrus aroma and flavor! - Drinking a What What by @revisionbrewing at @macssbv  — https://t.co/qUsDFRrv3L"
"@31BJN @62greenmachine @JJohnsonless @BigBoyVol 4 more hours on the pork. 30 minutes on the sausage."
"$7 Nachos, $3.50 @gooseisland IPA. All day every (Sat&amp;Sun)day. @visitnorthhills @ World of Beer… https://t.co/1yeMXsgGzj"
"RT @BdogLaf: Tonight: \n\n-Retweet for no cover and a chance to win $100 bartab\n-$4 Mixed Drink &amp; Beer Pitchers\n-$.50 cent shots https://t.co…"
"@OwenJones84 That's how Stalin started. \n\nFirst Gregg's then Percy Ingles and sent all the sausage rolls of to a Gu… https://t.co/LBxjz9yjF9"
"This is what you could have on your weekends @Amazon. https://t.co/UXOH9Gmycx"
"Draft beer list for today and the taps have increased by 2.... Thats right we now have 12 beers… https://t.co/d2n6FObf6r"
"Today would’ve been my Pop Pop’s 100th birthday. Obviously, the only way to celebrate the Sprecher way is to drink… https://t.co/XOQRpvYkpH"
"RT @debbdotblonde: @ChuckNASCAR @nightMAHER them's FIGHTING words!! (and God forbid, don't pick on bacon either)!! https://t.co/4CXBBpIRFB"
"RT @HatfieldAnne: 78 of my last 78 servers heard me the first time when I asked for more bread."
"Celebrate with our signature homemade chocolate cake. https://t.co/vVIWJPS1AB"
"RT @baddiesandmusic: Who Got Cake Thread 🎂 Drop your cakes ‼️ https://t.co/bpvVk3M8uO"
"RT @JakeJams_Vol3: Hines Field\n\n...better ketchup. https://t.co/S3p0KIL8Oj"
"I suspect Whole Foods’ hot bar bacon is what Elizabeth Barrett Browning was thinking of when she wrote Sonnet 43. 💕🥓💕"
"Big n boozy - Drinking a Cuvee de Tomme by @lostabbey at @burialbeer  — https://t.co/TsBePGdywS"
"RT @benjaminbruce: Everyone this year is all about working out/getting in shape. Meanwhile I’m just sat here eating pizza with spaghetti an…"
"There are many people of color who love craft beer, but craft beer industry is one of the whitest and race exclusive industries in the U.S."
"RT @oliviaanc: BAKE WITH ME! PUMPKIN SPICE COOKIES (fall haul, halloween festivities &amp; more) https://t.co/JE2GKrOfgX"
"@JSmithOTI I think the majority of Sheetz locations have this. Even in my practically puritan town (in North Caroli… https://t.co/PmCAAhAXj8"
"RT @RTMannJr: Watch this Louisiana family, if only for the clueless disparagement of people on welfare. (Hint: the whole family i… "
"@JenniferMRomig Today I ate something amazing. Buttery biscuit, maple sausage, perfectly-fried egg, caramelized oni… https://t.co/Bj2lddXTOp"
"And craft beer culture is not \"casual\" to those whom don't usually fit it, often people/women of color, femmes, poor folk, etc."
"RT @BlazePizza: @Bullzeye_PhD We've got vegan cheese! 🍕 #HowDoYouBlaze"
"@politifakes Absolutely. \"Go on, guys, you can go further left than that! Here, we'll hold your beer, give it a shot!\""
"I'm at Randy's Pizza in Durham, NC https://t.co/DrWeos7RFZ"
"Fresh pizza coming at ya! \nGhost Thumb - tomato sauce, mozzarella, andouille, caramelized onions, fresh peppers, ro… https://t.co/Uj6Nzm1wew"
"Wanna have a pizza party but the man drunk on writing"
"RT @landoffacts: Garlic Cheese-Stuffed Pretzel Bombs. https://t.co/MkdPqvaTrv"
"I don't think pub groups are wrong. When beer culture theology takes up so much space in the \"progressive Xtian sphere\" it can be isolating."
"Beer Battered String Bean Fries [Vegan] https://t.co/nFKhjmDqUD via @onegreenplanet"
"RT @JRocIsMajor_: Amen and amen again! https://t.co/KqcdP05zfk"
"RT @Da_Ky_Guy9: Will I ever learn to avoid gas station pizza?\nAbsolutely not."
"I'll beat ya ass you slander Mac &amp; cheese"
"RT @yourlru: if you skip the meat you could save 200 animals per year and 220,000 gallons of water. https://t.co/lMSUCfyxkk"
"Have enjoyed @UnknownBrewing , @MashHouseNC , @HiWireBrewing , @BirdsongBrewing, and @D9Brewing so far at Durham World Beer Fest"
"RT @DevinHayes: I’ve been going on a no fast food, no dairy, no processed, no soda, and just an all around healthy diet to clear up my face…"
"Pizza ???? Smh https://t.co/xeAPHlZbiG"
"I’ll pray for you https://t.co/P3TJDWNnTl"
"RT @the_Fuckery_Tho: Yes, pizza https://t.co/B8h6IMF7YH"
"Football beer weed food"
"Niggs slandering pizza how unamerican https://t.co/6uvgBf03Me"
"The first donuts that Stephen &amp; I have found that beat our fav NC donut spot 🍩 We ordered 1/2 a… https://t.co/G766tTpm2u"
"We made it to halong bay. In 6 days. Fuck. I think me and @shepbutt deserve a beer"
"We have Belgian beer for the adults and bounce houses for the kids! Hugo the Hornet will even be stopping by. Happy… https://t.co/O71BioOdc7"
"Looking 👀 for NC beer &amp; wine at the Fair? 🍷🍺 Here's how to find us! Pls share #PublicHouseNC #NCStateFair #ncbeer… https://t.co/PSm1vehodY"
"RT @LAKings: Grab your friends &amp; come to the LA Kings Beer Fest before tonight's game! \nIncludes game ticket, koozie &amp; 2 beers.… "
"@anniejclark i thought young cookies would be good...but young pizza pizza takes the cake, respectfully. 👍🏼"
"Burnpile - Drinking a Rhubarb Gose by @bfsbeer at @burialbeer  — https://t.co/C3t2N69txP"
"@Wendys dad ordered no cheese on a plain hamburger, but got cheese. Why?"
"Yall dont understand how much im craving lidos pizza and a diet coke"
"RT @WhatTheFFacts: The world's largest pizza was about 2.5 times as big as a Basketball court. https://t.co/sWiBlZSkfh"
"Ordered chicken tenders and they brought it with complimentary gravy. Texas, what??"
"My expectations were met. \n\nThe pizza sucks."
"I hope we stay thick as thieves. Butter and bread. Pillars on colonial homes."
"RT @aeoqna: Bro: *eating*\nBro: *looks up at sis as if he just had a vision*\nBro: if tomato is a fruit, then is ketchup a smoothie..!?\nSis:…"
"RT @sugarcreekbrew: We have Belgian beer for the adults and bounce houses for the kids! Hugo the Hornet will even be stopping by. Happy… "
"The soda fountain where I work at is out of o2 and I tried it and IT WAS SO BAD I'M JUST BLARGH"
"Cheese sticks so damn good bruh"
"RT @_unbvsic: Wake up early in the morning &amp; eat that pussy like cold pizza 🍕 https://t.co/JLZCaijcXE"
"#Oktoberfest is here! Come get some beer specials and support the Jaycees @ The Official Second… https://t.co/boo563ONUh"
"Wine, Cheese, and Chocolate Event. Right now until 6pm. Cheesecake with Chocolate balsamic while it lasts… https://t.co/0P4dASoWUI"
"RT @LongboardsKC: Big Rob got the Chicken Parmesan Wrap in Lee's Summit: Chicken parm, Swiss, Provolone, toast, Bacon, Egg, Sriracha… "
"My Mac &amp; Cheese @labarndt11 @kbugz96 @alexianunez5 😂 https://t.co/9VrbyJkeih"
"RT @djoats02: when u stop drinking soda and start drinking water https://t.co/uGS3flthKU"
"When you're delivering pizza and you spot a white squirrel https://t.co/yHhhYxHdtW"
"RT @TrueBlueGirl57: @SparkleSoup45 @kathy101252 We're good, me too! But...ummm....got any homemade cookies?"
"Contact - All About Beer: https://t.co/anaO9oWvy6"
"@minacoladas @dsemumi i'll have you both know that I have finished a large fry and a bacon double cheeseburger alone on multiple occasions"
"RT @CharlesMcCool: Right now I am drinking this local #craftbeer at a pub in #NorthernIreland. What is your favorite local beer?… "
"RT @MonsieurPapi: Your man got cakes. I hope you're clapping em. https://t.co/eLMM8AYblM"
"RT @bobvulfov: (to the guy who just delivered my pizza) text me when u get home so i know ur safe"
"@_courteroy Kevin Bacon"
"@SynonymForWet My Houseguest beer will be one that looks like one type of beer but is easily mistaken for another.… https://t.co/WdTkPlvePP"
"@raiynestorm22 @RoboAtNight @Lady_Nightfallz @ZolonAD @DruidoftheKink come join the afterdark side we have cookies"
"RT @BULLCITYSWAGG: Corny Af RT @QueenzFlip: PIZZA TOO DAMN GOOD I LOST MY MIND !!! THE KICKED ME OUT BECAUSE INSAID THEIR PIZZA IS GOOD htt…"
"@PeachSaliva @AngriestPat I’m 21 and just as picky as I’ve ever been when it comes to food. I get weird looks as a… https://t.co/X3yEK7qh1b"
"I am daydreaming of the ham-and-cheese sliders and bacon-wrapped smoked sausages that my roommate made last night 🤤"
"RT @_iSplash: You had a nigga named Muhammad making bacon sandwiches? That shit must me torch! https://t.co/i3k4lW5Mh9"
"hello i need w88t let's cmoce it then buy 50¢ bread and swing @ the park lmk :0)"
"NEW UNIFORMS THANK YOU PIZZA HUT!!!🍕 https://t.co/hTPzH2Xjmx"
"Ever try fried pizza at the @NCStateFair? Here’s how it’s made! https://t.co/MNP9pkTBOr"
"OMG. We have a major gun problem in USA that congress refuses to address &amp; a #MoronInChief eager to launch nuclear… https://t.co/4GqPeT4a2L"
"Hub City Brew Fest is in full swing! Only in Spartanburg do you get your beer blessed before a… https://t.co/DGaurMsDvl"
"Whoas - Drinking  The Crescent Ship by @FoamBrewery at @burialbeer  — https://t.co/PY1AmMIYtz"
"RT @tonyposnanski: How about calling it Kid Scouts, go camping, tie knots, sell cookies, and everyone just shut up. https://t.co/yKPCG8KHCn"
"RT @hollyhendrix_: You're like 10 minutes away from me!!!! 😍 #countmein #dinnerdate https://t.co/XhcA5HBnFY"
"Enjoying some delicious Bloody Mary's! The secret? @avbc Barney Flats Oatmeal Stout &amp; Eat Beer hot sauce. #avbc… https://t.co/YS0iqQsTwQ"
"RT @jtempleelizabet: NEW UNIFORMS THANK YOU PIZZA HUT!!!🍕 https://t.co/hTPzH2Xjmx"
"#Lunch!!  josephspitabread flatbread pizza!!! 🍕 Made with @raosspecfood pizza sauce, incurred… https://t.co/chZZKQHXQ3"
"RT @PancakeHouseCLT: A slow cooker keeps this Baked Pimento Cheese Dip #Recipe warm from the first quarter to the last. @Southern_Living… "
"RT @racheldrogers: Enjoying some delicious Bloody Mary's! The secret? @avbc Barney Flats Oatmeal Stout &amp; Eat Beer hot sauce. #avbc… "
"Some of last nights damage! #cantillon #beer https://t.co/2AJHsqKxHq"
"RT @RitaCobix: @CasaLettori @Hakflak @BrindusaB1 @BPerrionni @josepcampo @cmont4560 @Choco_Sandy1 @scastaldi9 @henrirouen… "
"RT @JackedYoTweets: So she lovin’ the crew? https://t.co/M1wbsYwBao"
"RT @OllieMcKendrick: glad i spent 20 minutes in the supermarket paralysed by choice only to buy the same disgusting frozen pizza i buy ever…"
"BAKING SODA: The Most Powerful Ingredient That You Can Use To Heal Any Health Problem! https://t.co/V9I74ONOhv"
"Looking for that perfect snack that screams Fall? Apple Pie Snack Cakes https://t.co/IQZgUO2Lwl #recipes #apples… https://t.co/8vL7PeRhbf"
"RT @Helen_KelIer: Made pizza tonight! Let's see how it tastes 🍕 https://t.co/jKX0cYxUxl"
"RT @Fatboy_sse: I LOVE RANDYS DONUTS IN LA 😂🍩 #FATBOYGANG https://t.co/W65zMCs4Iz"
"RT @iMDRW: Pimento cheese and pork skins...they must be stopped. Cc...@Sauniell https://t.co/EcyPuKoeR7"
"RT @CCBrewingNC: Oktoberfest featuring @redoakbrew is this Saturday from 1-7! Great beer, great contests, great prizes! Don’t miss i… "
"Well balanced beer. Just a hint of heat well balanced by the hop character.... (Jalapeño IPA) https://t.co/dAiB9rBtN9"
"Bacon Queso... yes please! #baddaddysburgerbar #lunchdate #foodporn @ Bad Daddy's Burger Bar https://t.co/fpjr3I8NfS"
"I'm 'I'd rather have a shower coffee than a shower beer' years old."
"@SpiritsPodcast Though lately at work I've been making mug cakes and marathoning Agents of Shield."
"bitch how about the pizza man never showed up with my pizza &amp; wings 😭😭 https://t.co/MWhTdhlcx5"
"They cheese curds be love 😋"
"Them cheese curds be love 😋"
"Harper's Music &amp; Treat Stand was a success, thanks to the bar cookies we baker from @allrecipes… https://t.co/EuSRQF4icU"
"RT @TroubleByChoice: His dad was a dead beat he was spending all that bread on designer 3 piece suits let’s start a dialogue https://t.co/a…"
"Also I forgot to share this bun I got at the pastry place; the small asian lady said they are hip rn &amp; it was very… https://t.co/mX6Xzor50c"
"@fuggirls YAAASSS!! I’ll start baking cookies now and work on my H8Rade recipe (alcoholic, of course)."
"Why am I craving grilled cheese"
"RT @ReesesPBCups: Reese’s Peanut Butter Cups, cookies and vanilla ice cream. Get ready to win #NationalDessertDay.… "
"average at best... - Drinking a Hula Girl by @lost_province at @hickorystation  — https://t.co/dDcIPby6tV"
"Stop by today for a tour and a @birdsongbrewing or nodabrewing beer on us! We are open until 5pm… https://t.co/bDj65kjuSM"
"Finding the saving grace in Krispy Kreme coffee and donuts with @kpitsti2 . Pretty much sitting around this morning… https://t.co/WYqttcvt5D"
"@PrisonPlanet Guess they need go back and learn some English and eat some bacon u seriously need to move to American"
"Brunch beer - Drinking a Wrought Iron Cream Stout by @planktownbrew - https://t.co/U2Jn0U7TAM #photo"
"Anyone like beer?🍻🍺 @ Yard House https://t.co/vzJ02KnLWE"
"My love for pizza is thicc"
"Zucchini Cakes with Spinach, Arugula &amp; Basil Sour Cream https://t.co/O1Rqcs92hj via @ordinaryvegan"
"Observation from this morning: You really see the worst in people when there's an hour-long wait for wood-fired pizza at a pumpkin patch."
"Taste like banana Runts. Not a bad thing - Drinking a Wells Banana Bread Beer at @durhambulls - https://t.co/6fMjLraODF"
"RT @Bossip: Smashed The Homies? Drake Rumored To Be Homeboy Humping Bella Hadid's Airmax Loving Cakes After The Weeknd… "
"Fall activities! Oh, and beer!!! #Oktoberfest #SugarMountain #BannerElk #WNC #Fall #Autumn #Beer… https://t.co/4ad7qH393J"
"RT @tastemade: Buffalo Chicken Pull-Apart Bread\nThe only way to improve shareable bread is with Buffalo chicken and lots of cheese… "
"Every Sunday ALL Draft Beer $7 or less is $3.50. Bring your lunch/dinner and come join us for cheap craft beer https://t.co/0RYHhi0Uwm"
"@pizzahut waited an hour and 20 mins and paid $22 for one large and very cold pizza!  Not a happy customer!"
"@PolitiBunny Ppl have been fired by an employer for a picture of a girl drinking a beer on FB. We lose anonymity, I… https://t.co/Z41BT2cqAc"
"RT @Briana_Viola: i shoulda went to the parties https://t.co/mablUn810n"
"BLT. Minus the L and T Our Cheshire Smokehouse bacon is great by itself or with https://t.co/FiRfWJRpXC #madeinnc https://t.co/Ym7jn3ARqf"
"@Uhcihre8 is it debbie because has called me debra? it bc you like debbie cakes??"
"Enjoy our delicious deep dish pizza deal! #BIGCheesePizza #BIGCheeseBigDeals https://t.co/6VYaUjIkNU"
"Beer is calling my name"
"@EdBCollie look at all the bread loaves! https://t.co/72nl9XE3OH"
"Agreed https://t.co/jvIQ4oBfXl"
"RT @KaylarWill: My very unpopular food opinion is I prefer stove top Mac &amp; cheese over baked 😩😩😩"
"wow RT @KaylarWill: My very unpopular food opinion is I prefer stove top Mac &amp; cheese over baked 😩😩😩"
"Gonna get some strawberry soda and drink it out a wine glass"
"@ItsFoodPorn @duckdonuts \"Made to order\" donuts are better than Krispy Kreme! https://t.co/7GRvkjng8O"
"RT @tweetsbyeddie: Opened the fridge and I trembled with fear\nMy buddies are coming and I'm all out of beer\n#MyTroublesThatRhyme"
"@patriziamiani Thank you. Beautiful here today. Hope it's the same for you. At Phoenix Bakery in Pittsboro this mor… https://t.co/m3WiDoM7Yh"
"@dicehateme I don't know. Could use a bit more bacon in my opinion."
"On top of having AMAZING Jamaician patties I just had the best macaroni &amp; cheese I have ever tasted! Ever! @ThePatteyWagon in Garner/Raleigh"
